
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_5-56GaSmallBox.BP_5-56GaSmallBox_C
/// Size: 0x0068 (0x000290 - 0x0002F8)
class ABP_5_56GaSmallBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	FRandomStream                                      Count_ammo_seed;                                            // 0x02B8   (0x0008)  
	double                                             Space;                                                      // 0x02C0   (0x0008)  
	bool                                               Visible_Box;                                                // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02C9   (0x0007)  MISSED
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02D0   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D9   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02E0   (0x0008)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02E9   (0x0003)  MISSED
	int32_t                                            __Count_ammo_seed__;                                        // 0x02EC   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_5-56GaSmallBox.BP_5-56GaSmallBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_45GaSmallBox.BP_45GaSmallBox_C
/// Size: 0x0088 (0x000290 - 0x000318)
class ABP_45GaSmallBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Box;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C0   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02C9   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02D0   (0x0008)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02D9   (0x0003)  MISSED
	int32_t                                            __Count_ammo_seed__;                                        // 0x02DC   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x02E0   (0x0008)  
	int32_t                                            __Height_ammo_Seed__;                                       // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	double                                             Min_ammo_Height;                                            // 0x02F0   (0x0008)  
	double                                             Max_ammo_Height;                                            // 0x02F8   (0x0008)  
	FRandomStream                                      Count_ammo_seed;                                            // 0x0300   (0x0008)  
	FRandomStream                                      Height_ammo_Seed;                                           // 0x0308   (0x0008)  
	double                                             Space;                                                      // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_45GaSmallBox.BP_45GaSmallBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaBigBox.BP_300GaBigBox_C
/// Size: 0x0058 (0x000290 - 0x0002E8)
class ABP_300GaBigBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C8   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02D8   (0x0008)  
	double                                             Space;                                                      // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaBigBox.BP_300GaBigBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_5-56GaMidBox.BP_5-56GaMidBox_C
/// Size: 0x005C (0x000290 - 0x0002EC)
class ABP_5_56GaMidBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	double                                             Space;                                                      // 0x02B8   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02C1   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02D0   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D9   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02E0   (0x0008)  
	int32_t                                            Material_variant;                                           // 0x02E8   (0x0004)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_5-56GaMidBox.BP_5-56GaMidBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_7-62GaMidBox.BP_7-62GaMidBox_C
/// Size: 0x0058 (0x000290 - 0x0002E8)
class ABP_7_62GaMidBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C8   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             Space;                                                      // 0x02D8   (0x0008)  
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_7-62GaMidBox.BP_7-62GaMidBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_GrenadeBox1.BP_GrenadeBox1_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_GrenadeBox1_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02B8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_GrenadeBox1.BP_GrenadeBox1_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_12GaBigBox.BP_12GaBigBox_C
/// Size: 0x0098 (0x000290 - 0x000328)
class ABP_12GaBigBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02C8   (0x0001)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02C9   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x02CA   (0x0002)  MISSED
	FRandomStream                                      Count_seed;                                                 // 0x02CC   (0x0008)  
	int32_t                                            __Count_ammo_seed__;                                        // 0x02D4   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x02D8   (0x0008)  
	FRandomStream                                      Rotation_Seed;                                              // 0x02E0   (0x0008)  
	int32_t                                            __Rotation_Ammo_Seed__;                                     // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	double                                             Min_ammo_Rotation;                                          // 0x02F0   (0x0008)  
	double                                             Max_ammo_Rotation;                                          // 0x02F8   (0x0008)  
	FRandomStream                                      Height__Seed;                                               // 0x0300   (0x0008)  
	int32_t                                            __Height_ammo_Seed__;                                       // 0x0308   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x030C   (0x0004)  MISSED
	double                                             Min_ammo_Height;                                            // 0x0310   (0x0008)  
	double                                             Max_ammo_Height;                                            // 0x0318   (0x0008)  
	double                                             Space;                                                      // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_12GaBigBox.BP_12GaBigBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_GrenadeBox2.BP_GrenadeBox2_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_GrenadeBox2_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02B8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_GrenadeBox2.BP_GrenadeBox2_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaSmallBox.BP_300GaSmallBox_C
/// Size: 0x0034 (0x000290 - 0x0002C4)
class ABP_300GaSmallBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02A8   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02B8   (0x0008)  
	int32_t                                            Material_variant;                                           // 0x02C0   (0x0004)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaSmallBox.BP_300GaSmallBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaMidBox.BP_300GaMidBox_C
/// Size: 0x0090 (0x000290 - 0x000320)
class ABP_300GaMidBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C8   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02D8   (0x0008)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02E1   (0x0003)  MISSED
	int32_t                                            __Count_ammo_seed__;                                        // 0x02E4   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x02E8   (0x0008)  
	FRandomStream                                      Count_ammo_seed;                                            // 0x02F0   (0x0008)  
	FRandomStream                                      Height_ammo_Seed;                                           // 0x02F8   (0x0008)  
	double                                             Space;                                                      // 0x0300   (0x0008)  
	int32_t                                            __Height_ammo_Seed__;                                       // 0x0308   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x030C   (0x0004)  MISSED
	double                                             Min_ammo_Height;                                            // 0x0310   (0x0008)  
	double                                             Max_ammo_Height;                                            // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_300GaMidBox.BP_300GaMidBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_45GaBigBox.BP_45GaBigBox_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_45GaBigBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02B8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_45GaBigBox.BP_45GaBigBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_9GaMidBox.BP_9GaMidBox_C
/// Size: 0x0090 (0x000290 - 0x000320)
class ABP_9GaMidBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	FRandomStream                                      Count_ammo_seed;                                            // 0x02C8   (0x0008)  
	FRandomStream                                      Height_ammo_Seed;                                           // 0x02D0   (0x0008)  
	double                                             Space;                                                      // 0x02D8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02E0   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02E8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02E9   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02F0   (0x0008)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02F8   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02F9   (0x0003)  MISSED
	int32_t                                            __Count_ammo_seed__;                                        // 0x02FC   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x0300   (0x0008)  
	int32_t                                            __Height_ammo_Seed__;                                       // 0x0308   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x030C   (0x0004)  MISSED
	double                                             Min_ammo_Height;                                            // 0x0310   (0x0008)  
	double                                             Max_ammo_Height;                                            // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_9GaMidBox.BP_9GaMidBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_9GaBiglBox.BP_9GaBiglBox_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_9GaBiglBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02B8   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_9GaBiglBox.BP_9GaBiglBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Ammo_and_bullets_Pack/Blueprints/BP_12GaSmallBox.BP_12GaSmallBox_C
/// Size: 0x0090 (0x000290 - 0x000320)
class ABP_12GaSmallBox_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UInstancedStaticMeshComponent*               InstancedStaticMesh;                                        // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A8   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02B0   (0x0008)  
	bool                                               Visible_Cap;                                                // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B9   (0x0007)  MISSED
	double                                             Rotation_Cap;                                               // 0x02C0   (0x0008)  
	double                                             Box_Draw_Distance__0___Infinity_;                           // 0x02C8   (0x0008)  
	bool                                               Ammo_visible;                                               // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	double                                             Ammo_Draw_Distance__0___Infinity_;                          // 0x02D8   (0x0008)  
	bool                                               Use_random_count_of_ammo;                                   // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02E1   (0x0003)  MISSED
	int32_t                                            __Count_ammo_seed__;                                        // 0x02E4   (0x0004)  
	double                                             Count_ammo_in__;                                            // 0x02E8   (0x0008)  
	int32_t                                            __Rotation_Ammo_Seed__;                                     // 0x02F0   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x02F4   (0x0004)  MISSED
	double                                             Min_ammo_Rotation;                                          // 0x02F8   (0x0008)  
	double                                             Max_ammo_Rotation;                                          // 0x0300   (0x0008)  
	FRandomStream                                      Count_ammo_seed;                                            // 0x0308   (0x0008)  
	FRandomStream                                      Rotation_ammo_Seed;                                         // 0x0310   (0x0008)  
	double                                             Space;                                                      // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/Ammo_and_bullets_Pack/Blueprints/BP_12GaSmallBox.BP_12GaSmallBox_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

