
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine

/// Class /Game/Cable_kit/Blueprints/BP_Spline_master.BP_Spline_master_C
/// Size: 0x0078 (0x000290 - 0x000308)
class ABP_Spline_master_C : public AActor
{ 
public:
	class USplineComponent*                            Spline;                                                     // 0x0290   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0298   (0x0008)  
	class UStaticMesh*                                 Mesh;                                                       // 0x02A0   (0x0008)  
	SDK_UNDEFINED(1,2030) /* TEnumAsByte<ESplineMeshAxis> */ __um(Forward_Axis);                                   // 0x02A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02A9   (0x0007)  MISSED
	double                                             Mesh_Width;                                                 // 0x02B0   (0x0008)  
	class UMaterialInterface*                          Material_slot_01;                                           // 0x02B8   (0x0008)  
	class UMaterialInterface*                          Material_slot_02;                                           // 0x02C0   (0x0008)  
	class UMaterialInterface*                          Material_slot_03;                                           // 0x02C8   (0x0008)  
	class UMaterialInterface*                          Material_slot_04;                                           // 0x02D0   (0x0008)  
	class UMaterialInterface*                          Material_slot_05;                                           // 0x02D8   (0x0008)  
	class UMaterialInterface*                          Material_slot_06;                                           // 0x02E0   (0x0008)  
	class UMaterialInterface*                          Material_slot_07;                                           // 0x02E8   (0x0008)  
	class UMaterialInterface*                          Material_slot_08;                                           // 0x02F0   (0x0008)  
	class UMaterialInterface*                          Material_slot_09;                                           // 0x02F8   (0x0008)  
	class UMaterialInterface*                          Material_slot;                                              // 0x0300   (0x0008)  


	/// Functions
	// Function /Game/Cable_kit/Blueprints/BP_Spline_master.BP_Spline_master_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

