
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine

/// Enum /Game/Chameleon/Enums/BlendModes.BlendModes
/// Size: 0x17
enum class BlendModes : uint8_t
{
	BlendModes__NewEnumerator0                                                       = 0,
	BlendModes__NewEnumerator1                                                       = 1,
	BlendModes__NewEnumerator2                                                       = 2,
	BlendModes__NewEnumerator3                                                       = 3,
	BlendModes__NewEnumerator4                                                       = 4,
	BlendModes__NewEnumerator5                                                       = 5,
	BlendModes__NewEnumerator6                                                       = 6,
	BlendModes__NewEnumerator7                                                       = 7,
	BlendModes__NewEnumerator8                                                       = 8,
	BlendModes__NewEnumerator9                                                       = 9,
	BlendModes__NewEnumerator10                                                      = 10,
	BlendModes__NewEnumerator11                                                      = 11,
	BlendModes__NewEnumerator12                                                      = 12,
	BlendModes__NewEnumerator13                                                      = 13,
	BlendModes__NewEnumerator14                                                      = 14,
	BlendModes__NewEnumerator15                                                      = 15,
	BlendModes__BlendModes_MAX                                                       = 16
};

/// Enum /Game/Chameleon/Enums/DrawingNoiseModes.DrawingNoiseModes
/// Size: 0x03
enum class DrawingNoiseModes : uint8_t
{
	DrawingNoiseModes__NewEnumerator0                                                = 0,
	DrawingNoiseModes__NewEnumerator1                                                = 1,
	DrawingNoiseModes__DrawingNoiseModes_MAX                                         = 2
};

/// Enum /Game/Chameleon/Enums/colorChannels.ColorChannels
/// Size: 0x04
enum class ColorChannels : uint8_t
{
	ColorChannels__NewEnumerator0                                                    = 0,
	ColorChannels__NewEnumerator1                                                    = 1,
	ColorChannels__NewEnumerator2                                                    = 2,
	ColorChannels__ColorChannels_MAX                                                 = 3
};

/// Enum /Game/Chameleon/Enums/LOOKPresetsEnum.LOOKPresetsEnum
/// Size: 0x151
enum class LOOKPresetsEnum : uint8_t
{
	LOOKPresetsEnum__NewEnumerator0                                                  = 0,
	LOOKPresetsEnum__NewEnumerator1                                                  = 1,
	LOOKPresetsEnum__NewEnumerator2                                                  = 2,
	LOOKPresetsEnum__NewEnumerator3                                                  = 3,
	LOOKPresetsEnum__NewEnumerator4                                                  = 4,
	LOOKPresetsEnum__NewEnumerator5                                                  = 5,
	LOOKPresetsEnum__NewEnumerator6                                                  = 6,
	LOOKPresetsEnum__NewEnumerator7                                                  = 7,
	LOOKPresetsEnum__NewEnumerator8                                                  = 8,
	LOOKPresetsEnum__NewEnumerator9                                                  = 9,
	LOOKPresetsEnum__NewEnumerator10                                                 = 10,
	LOOKPresetsEnum__NewEnumerator11                                                 = 11,
	LOOKPresetsEnum__NewEnumerator12                                                 = 12,
	LOOKPresetsEnum__NewEnumerator13                                                 = 13,
	LOOKPresetsEnum__NewEnumerator14                                                 = 14,
	LOOKPresetsEnum__NewEnumerator15                                                 = 15,
	LOOKPresetsEnum__NewEnumerator16                                                 = 16,
	LOOKPresetsEnum__NewEnumerator17                                                 = 17,
	LOOKPresetsEnum__NewEnumerator50                                                 = 18,
	LOOKPresetsEnum__NewEnumerator51                                                 = 19,
	LOOKPresetsEnum__NewEnumerator52                                                 = 20,
	LOOKPresetsEnum__NewEnumerator53                                                 = 21,
	LOOKPresetsEnum__NewEnumerator54                                                 = 22,
	LOOKPresetsEnum__NewEnumerator18                                                 = 23,
	LOOKPresetsEnum__NewEnumerator19                                                 = 24,
	LOOKPresetsEnum__NewEnumerator20                                                 = 25,
	LOOKPresetsEnum__NewEnumerator21                                                 = 26,
	LOOKPresetsEnum__NewEnumerator22                                                 = 27,
	LOOKPresetsEnum__NewEnumerator23                                                 = 28,
	LOOKPresetsEnum__NewEnumerator24                                                 = 29,
	LOOKPresetsEnum__NewEnumerator25                                                 = 30,
	LOOKPresetsEnum__NewEnumerator26                                                 = 31,
	LOOKPresetsEnum__NewEnumerator27                                                 = 32,
	LOOKPresetsEnum__NewEnumerator28                                                 = 33,
	LOOKPresetsEnum__NewEnumerator29                                                 = 34,
	LOOKPresetsEnum__NewEnumerator30                                                 = 35,
	LOOKPresetsEnum__NewEnumerator31                                                 = 36,
	LOOKPresetsEnum__NewEnumerator32                                                 = 37,
	LOOKPresetsEnum__NewEnumerator33                                                 = 38,
	LOOKPresetsEnum__NewEnumerator34                                                 = 39,
	LOOKPresetsEnum__NewEnumerator35                                                 = 40,
	LOOKPresetsEnum__NewEnumerator36                                                 = 41,
	LOOKPresetsEnum__NewEnumerator37                                                 = 42,
	LOOKPresetsEnum__NewEnumerator38                                                 = 43,
	LOOKPresetsEnum__NewEnumerator39                                                 = 44,
	LOOKPresetsEnum__NewEnumerator40                                                 = 45,
	LOOKPresetsEnum__NewEnumerator41                                                 = 46,
	LOOKPresetsEnum__NewEnumerator42                                                 = 47,
	LOOKPresetsEnum__NewEnumerator43                                                 = 48,
	LOOKPresetsEnum__NewEnumerator44                                                 = 49,
	LOOKPresetsEnum__NewEnumerator45                                                 = 50,
	LOOKPresetsEnum__NewEnumerator46                                                 = 51,
	LOOKPresetsEnum__NewEnumerator47                                                 = 52,
	LOOKPresetsEnum__NewEnumerator48                                                 = 53,
	LOOKPresetsEnum__NewEnumerator49                                                 = 54,
	LOOKPresetsEnum__NewEnumerator55                                                 = 55,
	LOOKPresetsEnum__NewEnumerator56                                                 = 56,
	LOOKPresetsEnum__NewEnumerator57                                                 = 57,
	LOOKPresetsEnum__NewEnumerator58                                                 = 58,
	LOOKPresetsEnum__NewEnumerator59                                                 = 59,
	LOOKPresetsEnum__NewEnumerator60                                                 = 60,
	LOOKPresetsEnum__NewEnumerator61                                                 = 61,
	LOOKPresetsEnum__NewEnumerator62                                                 = 62,
	LOOKPresetsEnum__NewEnumerator63                                                 = 63,
	LOOKPresetsEnum__NewEnumerator64                                                 = 64,
	LOOKPresetsEnum__NewEnumerator65                                                 = 65,
	LOOKPresetsEnum__NewEnumerator66                                                 = 66,
	LOOKPresetsEnum__NewEnumerator67                                                 = 67,
	LOOKPresetsEnum__NewEnumerator68                                                 = 68,
	LOOKPresetsEnum__NewEnumerator69                                                 = 69,
	LOOKPresetsEnum__NewEnumerator70                                                 = 70,
	LOOKPresetsEnum__NewEnumerator71                                                 = 71,
	LOOKPresetsEnum__NewEnumerator72                                                 = 72,
	LOOKPresetsEnum__NewEnumerator73                                                 = 73,
	LOOKPresetsEnum__NewEnumerator74                                                 = 74,
	LOOKPresetsEnum__NewEnumerator75                                                 = 75,
	LOOKPresetsEnum__NewEnumerator76                                                 = 76,
	LOOKPresetsEnum__NewEnumerator77                                                 = 77,
	LOOKPresetsEnum__NewEnumerator78                                                 = 78,
	LOOKPresetsEnum__NewEnumerator79                                                 = 79,
	LOOKPresetsEnum__NewEnumerator80                                                 = 80,
	LOOKPresetsEnum__NewEnumerator81                                                 = 81,
	LOOKPresetsEnum__NewEnumerator82                                                 = 82,
	LOOKPresetsEnum__NewEnumerator83                                                 = 83,
	LOOKPresetsEnum__NewEnumerator84                                                 = 84,
	LOOKPresetsEnum__NewEnumerator85                                                 = 85,
	LOOKPresetsEnum__NewEnumerator86                                                 = 86,
	LOOKPresetsEnum__NewEnumerator87                                                 = 87,
	LOOKPresetsEnum__NewEnumerator88                                                 = 88,
	LOOKPresetsEnum__NewEnumerator89                                                 = 89,
	LOOKPresetsEnum__NewEnumerator90                                                 = 90,
	LOOKPresetsEnum__NewEnumerator91                                                 = 91,
	LOOKPresetsEnum__NewEnumerator92                                                 = 92,
	LOOKPresetsEnum__NewEnumerator93                                                 = 93,
	LOOKPresetsEnum__NewEnumerator94                                                 = 94,
	LOOKPresetsEnum__NewEnumerator95                                                 = 95,
	LOOKPresetsEnum__NewEnumerator96                                                 = 96,
	LOOKPresetsEnum__NewEnumerator97                                                 = 97,
	LOOKPresetsEnum__NewEnumerator98                                                 = 98,
	LOOKPresetsEnum__NewEnumerator99                                                 = 99,
	LOOKPresetsEnum__NewEnumerator100                                                = 100,
	LOOKPresetsEnum__NewEnumerator101                                                = 101,
	LOOKPresetsEnum__NewEnumerator102                                                = 102,
	LOOKPresetsEnum__NewEnumerator103                                                = 103,
	LOOKPresetsEnum__NewEnumerator104                                                = 104,
	LOOKPresetsEnum__NewEnumerator105                                                = 105,
	LOOKPresetsEnum__NewEnumerator106                                                = 106,
	LOOKPresetsEnum__NewEnumerator107                                                = 107,
	LOOKPresetsEnum__NewEnumerator108                                                = 108,
	LOOKPresetsEnum__NewEnumerator109                                                = 109,
	LOOKPresetsEnum__NewEnumerator110                                                = 110,
	LOOKPresetsEnum__NewEnumerator111                                                = 111,
	LOOKPresetsEnum__NewEnumerator112                                                = 112,
	LOOKPresetsEnum__NewEnumerator113                                                = 113,
	LOOKPresetsEnum__NewEnumerator114                                                = 114,
	LOOKPresetsEnum__NewEnumerator115                                                = 115,
	LOOKPresetsEnum__NewEnumerator116                                                = 116,
	LOOKPresetsEnum__NewEnumerator117                                                = 117,
	LOOKPresetsEnum__NewEnumerator118                                                = 118,
	LOOKPresetsEnum__NewEnumerator119                                                = 119,
	LOOKPresetsEnum__NewEnumerator120                                                = 120,
	LOOKPresetsEnum__NewEnumerator121                                                = 121,
	LOOKPresetsEnum__NewEnumerator122                                                = 122,
	LOOKPresetsEnum__NewEnumerator123                                                = 123,
	LOOKPresetsEnum__NewEnumerator124                                                = 124,
	LOOKPresetsEnum__NewEnumerator125                                                = 125,
	LOOKPresetsEnum__NewEnumerator126                                                = 126,
	LOOKPresetsEnum__NewEnumerator127                                                = 127,
	LOOKPresetsEnum__NewEnumerator128                                                = 128,
	LOOKPresetsEnum__NewEnumerator129                                                = 129,
	LOOKPresetsEnum__NewEnumerator130                                                = 130,
	LOOKPresetsEnum__NewEnumerator131                                                = 131,
	LOOKPresetsEnum__NewEnumerator132                                                = 132,
	LOOKPresetsEnum__NewEnumerator133                                                = 133,
	LOOKPresetsEnum__NewEnumerator134                                                = 134,
	LOOKPresetsEnum__NewEnumerator135                                                = 135,
	LOOKPresetsEnum__NewEnumerator136                                                = 136,
	LOOKPresetsEnum__NewEnumerator137                                                = 137,
	LOOKPresetsEnum__NewEnumerator138                                                = 138,
	LOOKPresetsEnum__NewEnumerator139                                                = 139,
	LOOKPresetsEnum__NewEnumerator140                                                = 140,
	LOOKPresetsEnum__NewEnumerator141                                                = 141,
	LOOKPresetsEnum__NewEnumerator142                                                = 142,
	LOOKPresetsEnum__NewEnumerator143                                                = 143,
	LOOKPresetsEnum__NewEnumerator144                                                = 144,
	LOOKPresetsEnum__NewEnumerator145                                                = 145,
	LOOKPresetsEnum__NewEnumerator146                                                = 146,
	LOOKPresetsEnum__NewEnumerator147                                                = 147,
	LOOKPresetsEnum__NewEnumerator148                                                = 148,
	LOOKPresetsEnum__NewEnumerator149                                                = 149,
	LOOKPresetsEnum__LOOKPresetsEnum_MAX                                             = 150
};

/// Struct /Game/Chameleon/Structures/Vector2DN.Vector2DN
/// Size: 0x0008 (0x000000 - 0x000008)
struct FVector2DN
{ 
	float                                              X_2_61690A0C49AE65EEBEA3F1869ED7C8B0;                       // 0x0000   (0x0004)  
	float                                              Y_4_99EA40724D71AB71DA2E298FBE765633;                       // 0x0004   (0x0004)  
};

/// Struct /Game/Chameleon/Structures/AdvancedEffectFeatures.AdvancedEffectFeatures
/// Size: 0x0034 (0x000000 - 0x000034)
struct FAdvancedEffectFeatures
{ 
	SDK_UNDEFINED(1,2031) /* TEnumAsByte<BlendModes> */ __um(BlendMode_12_09737E6C44063CBE16D45A8896564C06);       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	class UTexture2D*                                  BlendMask_21_9E705B66406A56FD3FFAF1A6942926D5;              // 0x0008   (0x0008)  
	FVector2DN                                         BlendMaskScale_24_EA5846484DB94044F896A09A0BC2F6C0;         // 0x0010   (0x0008)  
	float                                              BlendDistance_33_7594D9DD4D782916B58945895B32667E;          // 0x0018   (0x0004)  
	float                                              BlendDistanceSharpness_35_6A828E614037A27B69EE71A96FC5821D; // 0x001C   (0x0004)  
	bool                                               BlendDistanceInvert_37_D287DE844826F2359AAFE3858976F62A;    // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	float                                              BlendingOpacity_10_63DB57664274BA07E8C302A5DE11468B;        // 0x0024   (0x0004)  
	int32_t                                            EffectPriority_11_EDF854034FC93238C76D8FA5C8F7CD2F;         // 0x0028   (0x0004)  
	bool                                               CustomDepth_1_CCA4E6DA4D5BFFF130E4238E20DDB1B8;             // 0x002C   (0x0001)  
	bool                                               StencilBuffer_15_EA46BAF04C25E4D2EA4796B4C92C5FE6;          // 0x002D   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x002E   (0x0002)  MISSED
	int32_t                                            StencilMask_18_BF959A7242C50326D3AE65A973C5A5B1;            // 0x0030   (0x0004)  
};

/// Struct /Game/Chameleon/Structures/AdvancedEffectFeaturesNoCustomDepth.AdvancedEffectFeaturesNoCustomDepth
/// Size: 0x002C (0x000000 - 0x00002C)
struct FAdvancedEffectFeaturesNoCustomDepth
{ 
	SDK_UNDEFINED(1,2032) /* TEnumAsByte<BlendModes> */ __um(BlendMode_12_09737E6C44063CBE16D45A8896564C06);       // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0001   (0x0007)  MISSED
	class UTexture2D*                                  BlendMask_15_664A106449FD3C01747ABC9174124057;              // 0x0008   (0x0008)  
	FVector2DN                                         BlendMaskScale_18_615A76A449B11B7912A0AEA82EB64EA5;         // 0x0010   (0x0008)  
	float                                              BlendDistance_23_BD484C304DC4B8E69152DA879158606B;          // 0x0018   (0x0004)  
	float                                              BlendDistanceSharpness_24_17B5A9EF45A85808BD4C3DB4D7A1BDE3; // 0x001C   (0x0004)  
	bool                                               BlendDistanceInvert_26_BAA4896D4DB1D15370EB73ABA02CBF01;    // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0021   (0x0003)  MISSED
	float                                              BlendingOpacity_10_63DB57664274BA07E8C302A5DE11468B;        // 0x0024   (0x0004)  
	int32_t                                            EffectPriority_11_EDF854034FC93238C76D8FA5C8F7CD2F;         // 0x0028   (0x0004)  
};

/// Struct /Game/Chameleon/Structures/Vector3DN.Vector3DN
/// Size: 0x000C (0x000000 - 0x00000C)
struct FVector3DN
{ 
	float                                              X_2_61690A0C49AE65EEBEA3F1869ED7C8B0;                       // 0x0000   (0x0004)  
	float                                              Y_4_99EA40724D71AB71DA2E298FBE765633;                       // 0x0004   (0x0004)  
	float                                              Z_7_3931AEC34F09EC9204600DB26430DD22;                       // 0x0008   (0x0004)  
};

/// Class /Game/Chameleon/Chameleon.Chameleon_C
/// Size: 0x2910 (0x000290 - 0x002BA0)
class AChameleon_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	class UMaterialBillboardComponent*                 MaterialBillboard;                                          // 0x0298   (0x0008)  
	class UPostProcessComponent*                       InternalPP;                                                 // 0x02A0   (0x0008)  
	class UBoxComponent*                               Bounding_Box;                                               // 0x02A8   (0x0008)  
	bool                                               Bleach_Bypass;                                              // 0x02B0   (0x0001)  
	bool                                               Distance_Fog;                                               // 0x02B1   (0x0001)  
	bool                                               Channel_Clamper;                                            // 0x02B2   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x02B3   (0x0005)  MISSED
	class UMaterial*                                   mChannelClamper;                                            // 0x02B8   (0x0008)  
	class UMaterialInstanceDynamic*                    iChannelClamper;                                            // 0x02C0   (0x0008)  
	bool                                               Channel_Swapper;                                            // 0x02C8   (0x0001)  
	bool                                               Screen_Drops;                                               // 0x02C9   (0x0001)  
	bool                                               Alcohol;                                                    // 0x02CA   (0x0001)  
	bool                                               Drug;                                                       // 0x02CB   (0x0001)  
	bool                                               Mosaic;                                                     // 0x02CC   (0x0001)  
	bool                                               Pixel_Dissolve;                                             // 0x02CD   (0x0001)  
	bool                                               Blur;                                                       // 0x02CE   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x02CF   (0x0001)  MISSED
	class UMaterial*                                   mBleachBypass;                                              // 0x02D0   (0x0008)  
	class UMaterial*                                   mDistanceFog;                                               // 0x02D8   (0x0008)  
	class UMaterial*                                   mChannelSwapper;                                            // 0x02E0   (0x0008)  
	class UMaterial*                                   mScreenDrops;                                               // 0x02E8   (0x0008)  
	class UMaterial*                                   mAlcohol;                                                   // 0x02F0   (0x0008)  
	class UMaterial*                                   mDrug;                                                      // 0x02F8   (0x0008)  
	class UMaterial*                                   mMosaic;                                                    // 0x0300   (0x0008)  
	class UMaterial*                                   mPixelDissolve;                                             // 0x0308   (0x0008)  
	class UMaterial*                                   mBlur;                                                      // 0x0310   (0x0008)  
	double                                             Channel_Clamper_Red_Intensity;                              // 0x0318   (0x0008)  
	double                                             Channel_Clamper_Green_Intensity;                            // 0x0320   (0x0008)  
	double                                             Channel_Clamper_Blue_Intensity;                             // 0x0328   (0x0008)  
	class UMaterialInstanceDynamic*                    iBleachBypass;                                              // 0x0330   (0x0008)  
	class UMaterialInstanceDynamic*                    iDistanceFog;                                               // 0x0338   (0x0008)  
	class UMaterialInstanceDynamic*                    iChannelSwapper;                                            // 0x0340   (0x0008)  
	SDK_UNDEFINED(1,2033) /* TEnumAsByte<ColorChannels> */ __um(Channel_Swapper_Red);                              // 0x0348   (0x0001)  
	SDK_UNDEFINED(1,2034) /* TEnumAsByte<ColorChannels> */ __um(Channel_Swapper_Green);                            // 0x0349   (0x0001)  
	SDK_UNDEFINED(1,2035) /* TEnumAsByte<ColorChannels> */ __um(Channel_Swapper_Blue);                             // 0x034A   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x034B   (0x0005)  MISSED
	class UMaterialInstanceDynamic*                    iScreenDrops;                                               // 0x0350   (0x0008)  
	class UMaterialInstanceDynamic*                    iAlcohol;                                                   // 0x0358   (0x0008)  
	class UMaterialInstanceDynamic*                    iDrug;                                                      // 0x0360   (0x0008)  
	class UMaterialInstanceDynamic*                    iMosaic;                                                    // 0x0368   (0x0008)  
	class UMaterialInstanceDynamic*                    iPixelDissolve;                                             // 0x0370   (0x0008)  
	class UMaterialInstanceDynamic*                    iBlur;                                                      // 0x0378   (0x0008)  
	class UTexture2D*                                  Screen_Drops_Layer_1_Map;                                   // 0x0380   (0x0008)  
	double                                             Screen_Drops_Layer_1_Intensity;                             // 0x0388   (0x0008)  
	double                                             Mosaic_Scale;                                               // 0x0390   (0x0008)  
	double                                             Alcohol_Speed;                                              // 0x0398   (0x0008)  
	double                                             Drug_Speed;                                                 // 0x03A0   (0x0008)  
	double                                             Pixel_Dissolve_Intensity;                                   // 0x03A8   (0x0008)  
	double                                             Blur_Amount;                                                // 0x03B0   (0x0008)  
	bool                                               ASCII;                                                      // 0x03B8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x03B9   (0x0007)  MISSED
	class UMaterial*                                   mAscii;                                                     // 0x03C0   (0x0008)  
	class UMaterialInstanceDynamic*                    iAscii;                                                     // 0x03C8   (0x0008)  
	bool                                               Colorize;                                                   // 0x03D0   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x03D1   (0x0007)  MISSED
	class UMaterial*                                   mColorize;                                                  // 0x03D8   (0x0008)  
	class UMaterialInstanceDynamic*                    iColorize;                                                  // 0x03E0   (0x0008)  
	double                                             Colorize_Detail;                                            // 0x03E8   (0x0008)  
	bool                                               Comic;                                                      // 0x03F0   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x03F1   (0x0007)  MISSED
	class UMaterial*                                   mComic;                                                     // 0x03F8   (0x0008)  
	class UMaterialInstanceDynamic*                    iComic;                                                     // 0x0400   (0x0008)  
	FLinearColor                                       Comic_Blend_Color;                                          // 0x0408   (0x0010)  
	double                                             Comic_Threshold;                                            // 0x0418   (0x0008)  
	bool                                               Edge_Detect;                                                // 0x0420   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x0421   (0x0007)  MISSED
	class UMaterial*                                   mEdgeDetect;                                                // 0x0428   (0x0008)  
	class UMaterialInstanceDynamic*                    iEdgeDetect;                                                // 0x0430   (0x0008)  
	bool                                               Emboss;                                                     // 0x0438   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x0439   (0x0007)  MISSED
	class UMaterial*                                   mEmboss;                                                    // 0x0440   (0x0008)  
	class UMaterialInstanceDynamic*                    iEmboss;                                                    // 0x0448   (0x0008)  
	bool                                               Glitch;                                                     // 0x0450   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x0451   (0x0007)  MISSED
	class UMaterial*                                   mGlitch;                                                    // 0x0458   (0x0008)  
	class UMaterialInstanceDynamic*                    iGlitch;                                                    // 0x0460   (0x0008)  
	double                                             Glitch_Speed;                                               // 0x0468   (0x0008)  
	double                                             Glitch_Lines;                                               // 0x0470   (0x0008)  
	double                                             Glitch_Blocking;                                            // 0x0478   (0x0008)  
	bool                                               Monitor_Effects;                                            // 0x0480   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x0481   (0x0007)  MISSED
	class UMaterial*                                   mGrainNLines;                                               // 0x0488   (0x0008)  
	class UMaterialInstanceDynamic*                    iGrainNLines;                                               // 0x0490   (0x0008)  
	double                                             Monitor_Effects_Line_Count;                                 // 0x0498   (0x0008)  
	double                                             Monitor_Effects_Intensity_1;                                // 0x04A0   (0x0008)  
	double                                             Monitor_Effects_Intensity_2;                                // 0x04A8   (0x0008)  
	bool                                               Hard_Emboss;                                                // 0x04B0   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x04B1   (0x0007)  MISSED
	class UMaterial*                                   mHardEmboss;                                                // 0x04B8   (0x0008)  
	class UMaterialInstanceDynamic*                    iHardEmboss;                                                // 0x04C0   (0x0008)  
	bool                                               Hue_Panner;                                                 // 0x04C8   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x04C9   (0x0007)  MISSED
	class UMaterial*                                   mHuePanner;                                                 // 0x04D0   (0x0008)  
	class UMaterialInstanceDynamic*                    iHuePanner;                                                 // 0x04D8   (0x0008)  
	double                                             Hue_Panner_Speed;                                           // 0x04E0   (0x0008)  
	bool                                               Monochrome;                                                 // 0x04E8   (0x0001)  
	unsigned char                                      UnknownData12_5[0x7];                                       // 0x04E9   (0x0007)  MISSED
	class UMaterial*                                   mMonochrome;                                                // 0x04F0   (0x0008)  
	class UMaterialInstanceDynamic*                    iMonochrome;                                                // 0x04F8   (0x0008)  
	FLinearColor                                       Monochrome_Color;                                           // 0x0500   (0x0010)  
	bool                                               Radial_Blur;                                                // 0x0510   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x0511   (0x0007)  MISSED
	class UMaterial*                                   mRadialBlur;                                                // 0x0518   (0x0008)  
	class UMaterialInstanceDynamic*                    iRadialBlur;                                                // 0x0520   (0x0008)  
	double                                             Radial_Blur_Width;                                          // 0x0528   (0x0008)  
	int32_t                                            Radial_Blur_Samples;                                        // 0x0530   (0x0004)  
	bool                                               Scratches;                                                  // 0x0534   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x0535   (0x0003)  MISSED
	class UMaterial*                                   mScratches;                                                 // 0x0538   (0x0008)  
	class UMaterialInstanceDynamic*                    iScratches;                                                 // 0x0540   (0x0008)  
	bool                                               Screen_Waves;                                               // 0x0548   (0x0001)  
	unsigned char                                      UnknownData15_5[0x7];                                       // 0x0549   (0x0007)  MISSED
	class UMaterial*                                   mScreenWaves;                                               // 0x0550   (0x0008)  
	class UMaterialInstanceDynamic*                    iScreenWaves;                                               // 0x0558   (0x0008)  
	double                                             Screen_Waves_X_Tiling;                                      // 0x0560   (0x0008)  
	double                                             Screen_Waves_Y_Tiling;                                      // 0x0568   (0x0008)  
	double                                             Monitor_Effects_Distortion_1;                               // 0x0570   (0x0008)  
	double                                             Monitor_Effects_Distortion_2;                               // 0x0578   (0x0008)  
	double                                             Monitor_Effects_Picture_Scale;                              // 0x0580   (0x0008)  
	FLinearColor                                       Distance_Fog_Near_Color;                                    // 0x0588   (0x0010)  
	FLinearColor                                       Distance_Fog_Far_Color;                                     // 0x0598   (0x0010)  
	double                                             Distance_Fog_Distance;                                      // 0x05A8   (0x0008)  
	class UTexture2D*                                  Scratches_Distortion_Map;                                   // 0x05B0   (0x0008)  
	double                                             Scratches_Distortion_Amount;                                // 0x05B8   (0x0008)  
	FLinearColor                                       Scratches_Color;                                            // 0x05C0   (0x0010)  
	double                                             Screen_Drops_Layer_1_Speed;                                 // 0x05D0   (0x0008)  
	double                                             Screen_Drops_Layer_1_Noise;                                 // 0x05D8   (0x0008)  
	class UTexture2D*                                  Screen_Drops_Layer_2_Map;                                   // 0x05E0   (0x0008)  
	double                                             Screen_Drops_Layer_2_Intensity;                             // 0x05E8   (0x0008)  
	double                                             Screen_Drops_Layer_2_Speed;                                 // 0x05F0   (0x0008)  
	double                                             Screen_Drops_Layer_2_Noise;                                 // 0x05F8   (0x0008)  
	class UTexture2D*                                  Screen_Drops_Layer_3_Map;                                   // 0x0600   (0x0008)  
	double                                             Screen_Drops_Layer_3_Intensity;                             // 0x0608   (0x0008)  
	double                                             Screen_Drops_Layer_3_Speed;                                 // 0x0610   (0x0008)  
	bool                                               Invert;                                                     // 0x0618   (0x0001)  
	unsigned char                                      UnknownData16_5[0x7];                                       // 0x0619   (0x0007)  MISSED
	class UMaterial*                                   mInvert;                                                    // 0x0620   (0x0008)  
	class UMaterialInstanceDynamic*                    iInvert;                                                    // 0x0628   (0x0008)  
	bool                                               Iridescent;                                                 // 0x0630   (0x0001)  
	unsigned char                                      UnknownData17_5[0x7];                                       // 0x0631   (0x0007)  MISSED
	class UMaterial*                                   mIridescent;                                                // 0x0638   (0x0008)  
	class UMaterialInstanceDynamic*                    iIridescent;                                                // 0x0640   (0x0008)  
	double                                             Iridescent_Iridescence;                                     // 0x0648   (0x0008)  
	bool                                               Kuwahara;                                                   // 0x0650   (0x0001)  
	unsigned char                                      UnknownData18_5[0x7];                                       // 0x0651   (0x0007)  MISSED
	class UMaterial*                                   mKuwahara;                                                  // 0x0658   (0x0008)  
	class UMaterialInstanceDynamic*                    iKuwahara;                                                  // 0x0660   (0x0008)  
	int32_t                                            Kuwahara_Amount;                                            // 0x0668   (0x0004)  
	bool                                               Pulse;                                                      // 0x066C   (0x0001)  
	unsigned char                                      UnknownData19_5[0x3];                                       // 0x066D   (0x0003)  MISSED
	class UMaterial*                                   mPulse;                                                     // 0x0670   (0x0008)  
	class UMaterialInstanceDynamic*                    iPulse;                                                     // 0x0678   (0x0008)  
	double                                             Pulse_Center_X;                                             // 0x0680   (0x0008)  
	double                                             Pulse_Center_Y;                                             // 0x0688   (0x0008)  
	double                                             Pulse_Speed;                                                // 0x0690   (0x0008)  
	double                                             Pulse_Smoothing;                                            // 0x0698   (0x0008)  
	bool                                               Squares;                                                    // 0x06A0   (0x0001)  
	unsigned char                                      UnknownData20_5[0x7];                                       // 0x06A1   (0x0007)  MISSED
	class UMaterial*                                   mSquares;                                                   // 0x06A8   (0x0008)  
	class UMaterialInstanceDynamic*                    iSquares;                                                   // 0x06B0   (0x0008)  
	double                                             Squares_Scale;                                              // 0x06B8   (0x0008)  
	double                                             Squares_Ratio;                                              // 0x06C0   (0x0008)  
	double                                             Squares_Radius;                                             // 0x06C8   (0x0008)  
	double                                             Squares_Brightness;                                         // 0x06D0   (0x0008)  
	bool                                               Tiles;                                                      // 0x06D8   (0x0001)  
	unsigned char                                      UnknownData21_5[0x7];                                       // 0x06D9   (0x0007)  MISSED
	class UMaterial*                                   mTiles;                                                     // 0x06E0   (0x0008)  
	class UMaterialInstanceDynamic*                    iTiles;                                                     // 0x06E8   (0x0008)  
	bool                                               Tiles_Centered;                                             // 0x06F0   (0x0001)  
	unsigned char                                      UnknownData22_5[0x7];                                       // 0x06F1   (0x0007)  MISSED
	double                                             Tiles_Count;                                                // 0x06F8   (0x0008)  
	bool                                               TV_Noise;                                                   // 0x0700   (0x0001)  
	unsigned char                                      UnknownData23_5[0x7];                                       // 0x0701   (0x0007)  MISSED
	class UMaterial*                                   mTVNoise;                                                   // 0x0708   (0x0008)  
	class UMaterialInstanceDynamic*                    iTVNoise;                                                   // 0x0710   (0x0008)  
	double                                             TV_Noise_Contrast;                                          // 0x0718   (0x0008)  
	double                                             TV_Noise_Intensity;                                         // 0x0720   (0x0008)  
	unsigned char                                      UnknownData24_5[0x8];                                       // 0x0728   (0x0008)  MISSED
	FPostProcessSettings                               Native_Post_Process;                                        // 0x0730   (0x06E0)  
	bool                                               LOOK_;                                                      // 0x0E10   (0x0001)  
	SDK_UNDEFINED(1,2036) /* TEnumAsByte<LOOKPresetsEnum> */ __um(LOOK__Presets);                                  // 0x0E11   (0x0001)  
	bool                                               Circles;                                                    // 0x0E12   (0x0001)  
	unsigned char                                      UnknownData25_5[0x5];                                       // 0x0E13   (0x0005)  MISSED
	class UMaterial*                                   mCircles;                                                   // 0x0E18   (0x0008)  
	class UMaterialInstanceDynamic*                    iCircles;                                                   // 0x0E20   (0x0008)  
	double                                             Circles_Ratio;                                              // 0x0E28   (0x0008)  
	double                                             Circles_Tiling;                                             // 0x0E30   (0x0008)  
	bool                                               Sonar;                                                      // 0x0E38   (0x0001)  
	unsigned char                                      UnknownData26_5[0x7];                                       // 0x0E39   (0x0007)  MISSED
	class UMaterial*                                   mSonar;                                                     // 0x0E40   (0x0008)  
	class UMaterialInstanceDynamic*                    iSonar;                                                     // 0x0E48   (0x0008)  
	FLinearColor                                       Sonar_Color;                                                // 0x0E50   (0x0010)  
	double                                             Sonar_Color_Intensity;                                      // 0x0E60   (0x0008)  
	double                                             Sonar_Depth;                                                // 0x0E68   (0x0008)  
	double                                             Sonar_Wave_Distance;                                        // 0x0E70   (0x0008)  
	double                                             Sonar_Distortion_Intensity;                                 // 0x0E78   (0x0008)  
	double                                             Sonar_Sharpness;                                            // 0x0E80   (0x0008)  
	double                                             Alcohol_Offset;                                             // 0x0E88   (0x0008)  
	bool                                               Distance_Distortion;                                        // 0x0E90   (0x0001)  
	unsigned char                                      UnknownData27_5[0x7];                                       // 0x0E91   (0x0007)  MISSED
	class UMaterial*                                   mDistanceDistortion;                                        // 0x0E98   (0x0008)  
	class UMaterialInstanceDynamic*                    iDistanceDistortion;                                        // 0x0EA0   (0x0008)  
	class UTexture2D*                                  Distance_Distortion_Normal;                                 // 0x0EA8   (0x0008)  
	double                                             Distance_Distortion_Amount;                                 // 0x0EB0   (0x0008)  
	double                                             Distance_Distortion_Edge_Distance;                          // 0x0EB8   (0x0008)  
	double                                             Distance_Distortion_Edge_Fading;                            // 0x0EC0   (0x0008)  
	double                                             Distance_Distortion_Movement_Speed;                         // 0x0EC8   (0x0008)  
	double                                             Distance_Distortion_Movement_Scale;                         // 0x0ED0   (0x0008)  
	double                                             Distance_Distortion_Affected_Brightness;                    // 0x0ED8   (0x0008)  
	double                                             Distance_Distortion_Unaffected_Brightness;                  // 0x0EE0   (0x0008)  
	bool                                               Drawing;                                                    // 0x0EE8   (0x0001)  
	unsigned char                                      UnknownData28_5[0x7];                                       // 0x0EE9   (0x0007)  MISSED
	class UMaterial*                                   mDrawing;                                                   // 0x0EF0   (0x0008)  
	class UMaterialInstanceDynamic*                    iDrawing;                                                   // 0x0EF8   (0x0008)  
	class UTexture2D*                                  Drawing_Paper_Texture;                                      // 0x0F00   (0x0008)  
	SDK_UNDEFINED(1,2037) /* TEnumAsByte<DrawingNoiseModes> */ __um(Drawing_Noise_Algorithm);                      // 0x0F08   (0x0001)  
	unsigned char                                      UnknownData29_5[0x7];                                       // 0x0F09   (0x0007)  MISSED
	double                                             Drawing_Ink_Amount;                                         // 0x0F10   (0x0008)  
	double                                             Drawing_Liner_Amount;                                       // 0x0F18   (0x0008)  
	FLinearColor                                       Drawing_Blending_Color;                                     // 0x0F20   (0x0010)  
	bool                                               Magic_Transitions;                                          // 0x0F30   (0x0001)  
	unsigned char                                      UnknownData30_5[0x7];                                       // 0x0F31   (0x0007)  MISSED
	class UMaterial*                                   mMagicTransitions;                                          // 0x0F38   (0x0008)  
	class UMaterialInstanceDynamic*                    iMagicTransitions;                                          // 0x0F40   (0x0008)  
	class UTexture2D*                                  Magic_Transitions_Final_Texture;                            // 0x0F48   (0x0008)  
	class UTexture2D*                                  Magic_Transitions_Mask_Texture;                             // 0x0F50   (0x0008)  
	double                                             Magic_Transitions_Transition_Amount;                        // 0x0F58   (0x0008)  
	double                                             Magic_Transitions_Flashing_Intensity;                       // 0x0F60   (0x0008)  
	double                                             Magic_Transitions_Flashing_Tolerance;                       // 0x0F68   (0x0008)  
	FLinearColor                                       Magic_Transitions_Flashing_Color;                           // 0x0F70   (0x0010)  
	bool                                               Screen_Damage;                                              // 0x0F80   (0x0001)  
	unsigned char                                      UnknownData31_5[0x7];                                       // 0x0F81   (0x0007)  MISSED
	class UMaterial*                                   mScreenDamage;                                              // 0x0F88   (0x0008)  
	class UMaterialInstanceDynamic*                    iScreenDamage;                                              // 0x0F90   (0x0008)  
	class UTexture2D*                                  Screen_Damage_Texture;                                      // 0x0F98   (0x0008)  
	double                                             Screen_Damage_Intensity;                                    // 0x0FA0   (0x0008)  
	double                                             Screen_Damage_Distortion;                                   // 0x0FA8   (0x0008)  
	FLinearColor                                       Screen_Damage_Tint;                                         // 0x0FB0   (0x0010)  
	double                                             Screen_Damage_Edge_Size;                                    // 0x0FC0   (0x0008)  
	double                                             Screen_Damage_Fading;                                       // 0x0FC8   (0x0008)  
	bool                                               Screen_Decals;                                              // 0x0FD0   (0x0001)  
	unsigned char                                      UnknownData32_5[0x7];                                       // 0x0FD1   (0x0007)  MISSED
	class UMaterial*                                   mScreenDecals;                                              // 0x0FD8   (0x0008)  
	class UMaterialInstanceDynamic*                    iScreenDecals;                                              // 0x0FE0   (0x0008)  
	class UTexture2D*                                  Screen_Decals_Slot_1___Texture;                             // 0x0FE8   (0x0008)  
	double                                             Screen_Decals_Slot_1___Distortion;                          // 0x0FF0   (0x0008)  
	double                                             Screen_Decals_Slot_1___Intensity;                           // 0x0FF8   (0x0008)  
	double                                             Screen_Decals_Slot_1___Position_X;                          // 0x1000   (0x0008)  
	double                                             Screen_Decals_Slot_1___Position_Y;                          // 0x1008   (0x0008)  
	double                                             Screen_Decals_Slot_1___Rotation;                            // 0x1010   (0x0008)  
	double                                             Screen_Decals_Slot_1___Size;                                // 0x1018   (0x0008)  
	class UTexture2D*                                  Screen_Decals_Slot_2___Texture;                             // 0x1020   (0x0008)  
	double                                             Screen_Decals_Slot_2___Distortion;                          // 0x1028   (0x0008)  
	double                                             Screen_Decals_Slot_2___Intensity;                           // 0x1030   (0x0008)  
	double                                             Screen_Decals_Slot_2___Position_X;                          // 0x1038   (0x0008)  
	double                                             Screen_Decals_Slot_2___Position_Y;                          // 0x1040   (0x0008)  
	double                                             Screen_Decals_Slot_2___Rotation;                            // 0x1048   (0x0008)  
	double                                             Screen_Decals_Slot_2___Size;                                // 0x1050   (0x0008)  
	class UTexture2D*                                  Screen_Decals_Slot_3___Texture;                             // 0x1058   (0x0008)  
	double                                             Screen_Decals_Slot_3___Distortion;                          // 0x1060   (0x0008)  
	double                                             Screen_Decals_Slot_3___Intensity;                           // 0x1068   (0x0008)  
	double                                             Screen_Decals_Slot_3___Position_X;                          // 0x1070   (0x0008)  
	double                                             Screen_Decals_Slot_3___Position_Y;                          // 0x1078   (0x0008)  
	double                                             Screen_Decals_Slot_3___Rotation;                            // 0x1080   (0x0008)  
	double                                             Screen_Decals_Slot_3___Size;                                // 0x1088   (0x0008)  
	class UTexture2D*                                  Screen_Decals_Slot_4___Texture;                             // 0x1090   (0x0008)  
	double                                             Screen_Decals_Slot_4___Distortion;                          // 0x1098   (0x0008)  
	double                                             Screen_Decals_Slot_4___Intensity;                           // 0x10A0   (0x0008)  
	double                                             Screen_Decals_Slot_4___Position_X;                          // 0x10A8   (0x0008)  
	double                                             Screen_Decals_Slot_4___Position_Y;                          // 0x10B0   (0x0008)  
	double                                             Screen_Decals_Slot_4___Rotation;                            // 0x10B8   (0x0008)  
	double                                             Screen_Decals_Slot_4___Size;                                // 0x10C0   (0x0008)  
	bool                                               Sharpen;                                                    // 0x10C8   (0x0001)  
	unsigned char                                      UnknownData33_5[0x7];                                       // 0x10C9   (0x0007)  MISSED
	class UMaterial*                                   mSharpen;                                                   // 0x10D0   (0x0008)  
	class UMaterialInstanceDynamic*                    iSharpen;                                                   // 0x10D8   (0x0008)  
	double                                             Sharpen_Value;                                              // 0x10E0   (0x0008)  
	bool                                               Toon_Shading;                                               // 0x10E8   (0x0001)  
	unsigned char                                      UnknownData34_5[0x7];                                       // 0x10E9   (0x0007)  MISSED
	class UMaterial*                                   mToonShading;                                               // 0x10F0   (0x0008)  
	class UMaterialInstanceDynamic*                    iToonShading;                                               // 0x10F8   (0x0008)  
	bool                                               Toon_Shading_Use_Diffuse_Buffer;                            // 0x1100   (0x0001)  
	unsigned char                                      UnknownData35_5[0x7];                                       // 0x1101   (0x0007)  MISSED
	double                                             Toon_Shading_Details;                                       // 0x1108   (0x0008)  
	double                                             Toon_Shading_Fading_;                                       // 0x1110   (0x0008)  
	double                                             Toon_Shading_Size;                                          // 0x1118   (0x0008)  
	double                                             Toon_Shading_Sobel_Strength;                                // 0x1120   (0x0008)  
	bool                                               Anamorphic_Lens_Flares;                                     // 0x1128   (0x0001)  
	unsigned char                                      UnknownData36_5[0x7];                                       // 0x1129   (0x0007)  MISSED
	class UMaterial*                                   mAnamorphicLensFlares;                                      // 0x1130   (0x0008)  
	class UMaterialInstanceDynamic*                    iAnamorphicLensFlares;                                      // 0x1138   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Linear_Color;                        // 0x1140   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Exposure_Scale;                      // 0x1148   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Threshold;                           // 0x1150   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Intensity;                           // 0x1158   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Steps;                               // 0x1160   (0x0008)  
	double                                             Anamorphic_Lens_Flares_Length;                              // 0x1168   (0x0008)  
	FLinearColor                                       Anamorphic_Lens_Flares_Tint;                                // 0x1170   (0x0010)  
	bool                                               Frost;                                                      // 0x1180   (0x0001)  
	unsigned char                                      UnknownData37_5[0x7];                                       // 0x1181   (0x0007)  MISSED
	class UMaterial*                                   mFrost;                                                     // 0x1188   (0x0008)  
	class UMaterialInstanceDynamic*                    iFrost;                                                     // 0x1190   (0x0008)  
	class UTexture2D*                                  Frost_Texture;                                              // 0x1198   (0x0008)  
	double                                             Frost_Colorization;                                         // 0x11A0   (0x0008)  
	double                                             Frost_Distortion_Strength;                                  // 0x11A8   (0x0008)  
	double                                             Frost_Visible_Area;                                         // 0x11B0   (0x0008)  
	FLinearColor                                       ASCII_Color_Multiplier;                                     // 0x11B8   (0x0010)  
	bool                                               Neon;                                                       // 0x11C8   (0x0001)  
	unsigned char                                      UnknownData38_5[0x7];                                       // 0x11C9   (0x0007)  MISSED
	class UMaterial*                                   mNeon;                                                      // 0x11D0   (0x0008)  
	class UMaterialInstanceDynamic*                    iNeon;                                                      // 0x11D8   (0x0008)  
	FLinearColor                                       Neon_Color;                                                 // 0x11E0   (0x0010)  
	FLinearColor                                       Neon_Background_Color;                                      // 0x11F0   (0x0010)  
	double                                             Neon_Power;                                                 // 0x1200   (0x0008)  
	double                                             Neon_Noise;                                                 // 0x1208   (0x0008)  
	double                                             Neon_Noise_Speed;                                           // 0x1210   (0x0008)  
	bool                                               Custom_Depth_Highlighter;                                   // 0x1218   (0x0001)  
	unsigned char                                      UnknownData39_5[0x7];                                       // 0x1219   (0x0007)  MISSED
	class UMaterial*                                   mCustomDepthHighlighter;                                    // 0x1220   (0x0008)  
	class UMaterialInstanceDynamic*                    iCustomDepthHighlighter;                                    // 0x1228   (0x0008)  
	FLinearColor                                       Custom_Depth_Highlighter_Highlight_Color;                   // 0x1230   (0x0010)  
	double                                             Custom_Depth_Highlighter_Highlight_Opacity;                 // 0x1240   (0x0008)  
	bool                                               Custom_Depth_Highlighter__Clip_;                            // 0x1248   (0x0001)  
	unsigned char                                      UnknownData40_5[0x7];                                       // 0x1249   (0x0007)  MISSED
	class UMaterial*                                   mCustomDepthHighlighterClip;                                // 0x1250   (0x0008)  
	class UMaterialInstanceDynamic*                    iCustomDepthHighlighterClip;                                // 0x1258   (0x0008)  
	FLinearColor                                       Custom_Depth_Highlighter__C__Highlight_Color;               // 0x1260   (0x0010)  
	double                                             Custom_Depth_Highlighter__C__Highlight_Opacity;             // 0x1270   (0x0008)  
	double                                             Edge_Detect_Threshold;                                      // 0x1278   (0x0008)  
	double                                             Scratches_Noising;                                          // 0x1280   (0x0008)  
	bool                                               Enabled;                                                    // 0x1288   (0x0001)  
	bool                                               Unbound;                                                    // 0x1289   (0x0001)  
	unsigned char                                      UnknownData41_5[0x6];                                       // 0x128A   (0x0006)  MISSED
	TArray<class UMaterial*>                           AllMaterials;                                               // 0x1290   (0x0010)  
	double                                             Screen_Drops_Layer_3_Noise;                                 // 0x12A0   (0x0008)  
	FLinearColor                                       Screen_Drops_Diffuse_Color;                                 // 0x12A8   (0x0010)  
	double                                             Screen_Drops_Splashes_Amount;                               // 0x12B8   (0x0008)  
	double                                             Screen_Drops_Splashes_Tiling;                               // 0x12C0   (0x0008)  
	double                                             Screen_Drops_Splashes_Intensity;                            // 0x12C8   (0x0008)  
	double                                             Screen_Drops_Bump;                                          // 0x12D0   (0x0008)  
	bool                                               _2D_Transform;                                              // 0x12D8   (0x0001)  
	unsigned char                                      UnknownData42_5[0x7];                                       // 0x12D9   (0x0007)  MISSED
	class UMaterial*                                   m2DTransform;                                               // 0x12E0   (0x0008)  
	class UMaterialInstanceDynamic*                    i2DTransform;                                               // 0x12E8   (0x0008)  
	bool                                               Kaleidoscope;                                               // 0x12F0   (0x0001)  
	unsigned char                                      UnknownData43_5[0x7];                                       // 0x12F1   (0x0007)  MISSED
	class UMaterial*                                   mKaleidoscope;                                              // 0x12F8   (0x0008)  
	class UMaterialInstanceDynamic*                    iKaleidoscope;                                              // 0x1300   (0x0008)  
	bool                                               Letterboxing;                                               // 0x1308   (0x0001)  
	unsigned char                                      UnknownData44_5[0x7];                                       // 0x1309   (0x0007)  MISSED
	class UMaterial*                                   mLetterboxing;                                              // 0x1310   (0x0008)  
	class UMaterialInstanceDynamic*                    iLetterboxing;                                              // 0x1318   (0x0008)  
	bool                                               Snow;                                                       // 0x1320   (0x0001)  
	unsigned char                                      UnknownData45_5[0x7];                                       // 0x1321   (0x0007)  MISSED
	class UMaterial*                                   mSnow;                                                      // 0x1328   (0x0008)  
	class UMaterialInstanceDynamic*                    iSnow;                                                      // 0x1330   (0x0008)  
	double                                             _2D_Transform_Anchor_Point__X_;                             // 0x1338   (0x0008)  
	double                                             _2D_Transform_Anchor_Point__Y_;                             // 0x1340   (0x0008)  
	double                                             _2D_Transform_Rotate;                                       // 0x1348   (0x0008)  
	double                                             _2D_Transform_Pan__X_;                                      // 0x1350   (0x0008)  
	double                                             _2D_Transform_Pan__Y_;                                      // 0x1358   (0x0008)  
	double                                             _2D_Transform_Scale__X_;                                    // 0x1360   (0x0008)  
	double                                             _2D_Transform_Scale__Y_;                                    // 0x1368   (0x0008)  
	bool                                               _2D_Transform_Tiled;                                        // 0x1370   (0x0001)  
	unsigned char                                      UnknownData46_5[0x3];                                       // 0x1371   (0x0003)  MISSED
	int32_t                                            Kaleidoscope_Amount;                                        // 0x1374   (0x0004)  
	double                                             Kaleidoscope_SphericalDistortion;                           // 0x1378   (0x0008)  
	double                                             Kaleidoscope_Warp;                                          // 0x1380   (0x0008)  
	double                                             Kaleidoscope_FMul;                                          // 0x1388   (0x0008)  
	class UTexture2D*                                  Letterboxing_Texture;                                       // 0x1390   (0x0008)  
	double                                             Letterboxing_Size;                                          // 0x1398   (0x0008)  
	bool                                               Letterboxing_Horizontal;                                    // 0x13A0   (0x0001)  
	bool                                               Letterboxing_Vertical;                                      // 0x13A1   (0x0001)  
	unsigned char                                      UnknownData47_5[0x6];                                       // 0x13A2   (0x0006)  MISSED
	double                                             Snow_Amount;                                                // 0x13A8   (0x0008)  
	double                                             Snow_Distortion;                                            // 0x13B0   (0x0008)  
	double                                             Snow_Size;                                                  // 0x13B8   (0x0008)  
	double                                             Snow_Speed__X_;                                             // 0x13C0   (0x0008)  
	double                                             Snow_Speed__Y_;                                             // 0x13C8   (0x0008)  
	double                                             Drawing_Animation_Speed;                                    // 0x13D0   (0x0008)  
	double                                             Distance_Fog_Edge_Sharpness;                                // 0x13D8   (0x0008)  
	double                                             Screen_Drops_Diffuse_Intensity;                             // 0x13E0   (0x0008)  
	bool                                               World_Splash;                                               // 0x13E8   (0x0001)  
	unsigned char                                      UnknownData48_5[0x7];                                       // 0x13E9   (0x0007)  MISSED
	class UMaterial*                                   mWorldSplash;                                               // 0x13F0   (0x0008)  
	class UMaterialInstanceDynamic*                    iWorldSplash;                                               // 0x13F8   (0x0008)  
	double                                             World_Splash_Distort;                                       // 0x1400   (0x0008)  
	double                                             World_Splash_Smoothness;                                    // 0x1408   (0x0008)  
	double                                             World_Splash_Tiling;                                        // 0x1410   (0x0008)  
	FLinearColor                                       World_Splash_Color_Tint;                                    // 0x1418   (0x0010)  
	int32_t                                            Blur_Samples;                                               // 0x1428   (0x0004)  
	FLinearColor                                       Frost_Color;                                                // 0x142C   (0x0010)  
	unsigned char                                      UnknownData49_5[0x4];                                       // 0x143C   (0x0004)  MISSED
	double                                             Comic_PreMultiplier;                                        // 0x1440   (0x0008)  
	double                                             Comic_Desaturation;                                         // 0x1448   (0x0008)  
	bool                                               World_Glitch;                                               // 0x1450   (0x0001)  
	unsigned char                                      UnknownData50_5[0x7];                                       // 0x1451   (0x0007)  MISSED
	class UMaterial*                                   mWorldGlitch;                                               // 0x1458   (0x0008)  
	class UMaterialInstanceDynamic*                    iWorldGlitch;                                               // 0x1460   (0x0008)  
	bool                                               World_Glitch_Animated;                                      // 0x1468   (0x0001)  
	unsigned char                                      UnknownData51_5[0x7];                                       // 0x1469   (0x0007)  MISSED
	double                                             World_Glitch_Animation_Speed;                               // 0x1470   (0x0008)  
	double                                             World_Glitch_Distance;                                      // 0x1478   (0x0008)  
	double                                             World_Glitch_Distance_Sharpness;                            // 0x1480   (0x0008)  
	double                                             World_Glitch_Phase;                                         // 0x1488   (0x0008)  
	double                                             World_Glitch_Power;                                         // 0x1490   (0x0008)  
	FVector                                            World_Glitch_Grid_Position;                                 // 0x1498   (0x0018)  
	FVector                                            World_Glitch_Grid_Size;                                     // 0x14B0   (0x0018)  
	bool                                               Digitize;                                                   // 0x14C8   (0x0001)  
	unsigned char                                      UnknownData52_5[0x7];                                       // 0x14C9   (0x0007)  MISSED
	class UMaterial*                                   mDigitize;                                                  // 0x14D0   (0x0008)  
	class UMaterialInstanceDynamic*                    iDigitize;                                                  // 0x14D8   (0x0008)  
	FLinearColor                                       Digitize_Cell_Color;                                        // 0x14E0   (0x0010)  
	FVector                                            Digitize_Cell_Position;                                     // 0x14F0   (0x0018)  
	FVector                                            Digitize_Cell_Position_Over_Time;                           // 0x1508   (0x0018)  
	double                                             Digitize_Distance;                                          // 0x1520   (0x0008)  
	double                                             Digitize_Distance_Sharpness;                                // 0x1528   (0x0008)  
	double                                             Digitize_Cell_Size;                                         // 0x1530   (0x0008)  
	double                                             Digitize_Cell_Color_Multiplier;                             // 0x1538   (0x0008)  
	double                                             Digitize_Cell_Distortion;                                   // 0x1540   (0x0008)  
	double                                             Digitize_Background_Color_Multiplier;                       // 0x1548   (0x0008)  
	bool                                               Alarm;                                                      // 0x1550   (0x0001)  
	unsigned char                                      UnknownData53_5[0x7];                                       // 0x1551   (0x0007)  MISSED
	class UMaterial*                                   mAlarm;                                                     // 0x1558   (0x0008)  
	class UMaterialInstanceDynamic*                    iAlarm;                                                     // 0x1560   (0x0008)  
	FLinearColor                                       Alarm_Color;                                                // 0x1568   (0x0010)  
	double                                             Alarm_Speed;                                                // 0x1578   (0x0008)  
	bool                                               Sketch;                                                     // 0x1580   (0x0001)  
	unsigned char                                      UnknownData54_5[0x7];                                       // 0x1581   (0x0007)  MISSED
	class UMaterial*                                   mSketch;                                                    // 0x1588   (0x0008)  
	class UMaterialInstanceDynamic*                    iSketch;                                                    // 0x1590   (0x0008)  
	FLinearColor                                       Sketch_Color;                                               // 0x1598   (0x0010)  
	FLinearColor                                       Sketch_Background_Color;                                    // 0x15A8   (0x0010)  
	double                                             Sketch_Power;                                               // 0x15B8   (0x0008)  
	double                                             Sketch_Pattern_Rotation;                                    // 0x15C0   (0x0008)  
	double                                             Sketch_Pattern_Speed;                                       // 0x15C8   (0x0008)  
	FLinearColor                                       Custom_Depth_Highlighter_Outline_Color;                     // 0x15D0   (0x0010)  
	double                                             Custom_Depth_Highlighter_Outline_Opacity;                   // 0x15E0   (0x0008)  
	FLinearColor                                       Custom_Depth_Highlighter__C__Outline_Color;                 // 0x15E8   (0x0010)  
	double                                             Custom_Depth_Highlighter__C__Outline_Opacity;               // 0x15F8   (0x0008)  
	bool                                               Wired;                                                      // 0x1600   (0x0001)  
	unsigned char                                      UnknownData55_5[0x7];                                       // 0x1601   (0x0007)  MISSED
	class UMaterialInstanceDynamic*                    iWired;                                                     // 0x1608   (0x0008)  
	class UMaterial*                                   mWired;                                                     // 0x1610   (0x0008)  
	FLinearColor                                       Wired_Color;                                                // 0x1618   (0x0010)  
	double                                             Wired_Power;                                                // 0x1628   (0x0008)  
	FAdvancedEffectFeatures                            Mosaic___Advanced;                                          // 0x1630   (0x0038)  
	FAdvancedEffectFeatures                            Drug___Advanced;                                            // 0x1668   (0x0038)  
	FAdvancedEffectFeatures                            Alcohol___Advanced;                                         // 0x16A0   (0x0038)  
	FAdvancedEffectFeatures                            Pixel_Dissolve___Advanced;                                  // 0x16D8   (0x0038)  
	FAdvancedEffectFeatures                            Channel_Clamper___Advanced;                                 // 0x1710   (0x0038)  
	FAdvancedEffectFeatures                            Channel_Swapper___Advanced;                                 // 0x1748   (0x0038)  
	FAdvancedEffectFeatures                            Bleach_Bypass___Advanced;                                   // 0x1780   (0x0038)  
	FAdvancedEffectFeatures                            Blur___Advanced;                                            // 0x17B8   (0x0038)  
	double                                             ASCII_PreMultiplier;                                        // 0x17F0   (0x0008)  
	FAdvancedEffectFeatures                            ASCII___Advanced;                                           // 0x17F8   (0x0038)  
	FAdvancedEffectFeatures                            Colorize___Advanced;                                        // 0x1830   (0x0038)  
	FAdvancedEffectFeatures                            Edge_Detect___Advanced;                                     // 0x1868   (0x0038)  
	FAdvancedEffectFeatures                            Emboss___Advanced;                                          // 0x18A0   (0x0038)  
	FAdvancedEffectFeatures                            Hard_Emboss___Advanced;                                     // 0x18D8   (0x0038)  
	double                                             Glitch_Grid_Distortion_Power;                               // 0x1910   (0x0008)  
	double                                             Glitch_Grid_Distortion_Size;                                // 0x1918   (0x0008)  
	double                                             Glitch_Grid_Distortion_Speed;                               // 0x1920   (0x0008)  
	FAdvancedEffectFeatures                            Glitch___Advanced;                                          // 0x1928   (0x0038)  
	bool                                               Monitor_Effects_Tiled;                                      // 0x1960   (0x0001)  
	unsigned char                                      UnknownData56_5[0x7];                                       // 0x1961   (0x0007)  MISSED
	FAdvancedEffectFeatures                            Monitor_Effects___Advanced;                                 // 0x1968   (0x0038)  
	FAdvancedEffectFeatures                            Hue_Panner___Advanced;                                      // 0x19A0   (0x0038)  
	FAdvancedEffectFeatures                            Monochrome___Advanced;                                      // 0x19D8   (0x0038)  
	FVector2D                                          Radial_Blur_Center;                                         // 0x1A10   (0x0010)  
	FVector2D                                          Radial_Blur_Sample_Offset;                                  // 0x1A20   (0x0010)  
	FAdvancedEffectFeatures                            Radial_Blur___Advanced;                                     // 0x1A30   (0x0038)  
	FAdvancedEffectFeatures                            Scratches___Advanced;                                       // 0x1A68   (0x0038)  
	FAdvancedEffectFeatures                            Screen_Waves___Advanced;                                    // 0x1AA0   (0x0038)  
	FAdvancedEffectFeatures                            Distance_Fog___Advanced;                                    // 0x1AD8   (0x0038)  
	FAdvancedEffectFeatures                            Screen_Drops___Advanced;                                    // 0x1B10   (0x0038)  
	FAdvancedEffectFeatures                            Invert___Advanced;                                          // 0x1B48   (0x0038)  
	FAdvancedEffectFeatures                            Iridescent___Advanced;                                      // 0x1B80   (0x0038)  
	FAdvancedEffectFeatures                            Kuwahara___Advanced;                                        // 0x1BB8   (0x0038)  
	FAdvancedEffectFeatures                            Pulse___Advanced;                                           // 0x1BF0   (0x0038)  
	FAdvancedEffectFeatures                            Squares___Advanced;                                         // 0x1C28   (0x0038)  
	FAdvancedEffectFeatures                            Tiles___Advanced;                                           // 0x1C60   (0x0038)  
	FAdvancedEffectFeatures                            TV_Noise___Advanced;                                        // 0x1C98   (0x0038)  
	FAdvancedEffectFeatures                            Circles___Advanced;                                         // 0x1CD0   (0x0038)  
	FAdvancedEffectFeatures                            Sonar___Advanced;                                           // 0x1D08   (0x0038)  
	FAdvancedEffectFeatures                            Distance_Distortion___Advanced;                             // 0x1D40   (0x0038)  
	FAdvancedEffectFeatures                            Drawing___Advanced;                                         // 0x1D78   (0x0038)  
	FAdvancedEffectFeatures                            Magic_Transitions___Advanced;                               // 0x1DB0   (0x0038)  
	FAdvancedEffectFeatures                            Screen_Damage___Advanced;                                   // 0x1DE8   (0x0038)  
	FAdvancedEffectFeatures                            Screen_Decals___Advanced;                                   // 0x1E20   (0x0038)  
	FAdvancedEffectFeatures                            Sharpen___Advanced;                                         // 0x1E58   (0x0038)  
	FAdvancedEffectFeatures                            Toon_Shading___Advanced;                                    // 0x1E90   (0x0038)  
	FAdvancedEffectFeatures                            Anamorphic_Lens_Flares___Advanced;                          // 0x1EC8   (0x0038)  
	FAdvancedEffectFeatures                            Frost___Advanced;                                           // 0x1F00   (0x0038)  
	FAdvancedEffectFeatures                            Neon___Advanced;                                            // 0x1F38   (0x0038)  
	FAdvancedEffectFeaturesNoCustomDepth               Custom_Depth_Highlighter___Advanced;                        // 0x1F70   (0x0030)  
	FAdvancedEffectFeaturesNoCustomDepth               Custom_Depth_Highlighter__Clip____Advanced;                 // 0x1FA0   (0x0030)  
	FLinearColor                                       _2D_Transform_Background_Color;                             // 0x1FD0   (0x0010)  
	FAdvancedEffectFeatures                            _2D_Transform___Advanced;                                   // 0x1FE0   (0x0038)  
	FAdvancedEffectFeatures                            Kaleidoscope___Advanced;                                    // 0x2018   (0x0038)  
	FAdvancedEffectFeatures                            Letterboxing___Advanced;                                    // 0x2050   (0x0038)  
	FAdvancedEffectFeatures                            Snow___Advanced;                                            // 0x2088   (0x0038)  
	FAdvancedEffectFeatures                            World_Splash___Advanced;                                    // 0x20C0   (0x0038)  
	FAdvancedEffectFeatures                            World_Glitch___Advanced;                                    // 0x20F8   (0x0038)  
	FAdvancedEffectFeatures                            Digitize___Advanced;                                        // 0x2130   (0x0038)  
	FAdvancedEffectFeatures                            Alarm___Advanced;                                           // 0x2168   (0x0038)  
	FAdvancedEffectFeatures                            Sketch___Advanced;                                          // 0x21A0   (0x0038)  
	FAdvancedEffectFeatures                            Wired___Advanced;                                           // 0x21D8   (0x0038)  
	double                                             Comic_Pattern_Intensity;                                    // 0x2210   (0x0008)  
	int32_t                                            Comic_Pattern_Line_Count;                                   // 0x2218   (0x0004)  
	unsigned char                                      UnknownData57_5[0x4];                                       // 0x221C   (0x0004)  MISSED
	double                                             Comic_Pattern_Rotation;                                     // 0x2220   (0x0008)  
	FAdvancedEffectFeatures                            Comic___Advanced;                                           // 0x2228   (0x0038)  
	bool                                               Actor_Featurette;                                           // 0x2260   (0x0001)  
	unsigned char                                      UnknownData58_5[0x7];                                       // 0x2261   (0x0007)  MISSED
	class UMaterial*                                   mActorFeaturette;                                           // 0x2268   (0x0008)  
	class UMaterialInstanceDynamic*                    iActorFeaturette;                                           // 0x2270   (0x0008)  
	FLinearColor                                       Actor_Featurette_Background_Multiplier;                     // 0x2278   (0x0010)  
	double                                             Actor_Featurette_Background_Desaturation;                   // 0x2288   (0x0008)  
	FLinearColor                                       Actor_Featurette_Foreground_Multiplier;                     // 0x2290   (0x0010)  
	double                                             Actor_Featurette_Foreground_Saturation;                     // 0x22A0   (0x0008)  
	double                                             Actor_Featurette_Blur_Amount;                               // 0x22A8   (0x0008)  
	int32_t                                            Actor_Featurette_Blur_Samples;                              // 0x22B0   (0x0004)  
	int32_t                                            Actor_Featurette_Stencil_Mask;                              // 0x22B4   (0x0004)  
	FAdvancedEffectFeaturesNoCustomDepth               Actor_Featurette___Advanced;                                // 0x22B8   (0x0030)  
	bool                                               Infected;                                                   // 0x22E8   (0x0001)  
	unsigned char                                      UnknownData59_5[0x7];                                       // 0x22E9   (0x0007)  MISSED
	class UMaterial*                                   mInfected;                                                  // 0x22F0   (0x0008)  
	class UMaterialInstanceDynamic*                    iInfected;                                                  // 0x22F8   (0x0008)  
	double                                             Infected_Distortion_Amount;                                 // 0x2300   (0x0008)  
	double                                             Infected_Smoothness;                                        // 0x2308   (0x0008)  
	double                                             Infected_Speed;                                             // 0x2310   (0x0008)  
	double                                             Infected_TransformZ;                                        // 0x2318   (0x0008)  
	FAdvancedEffectFeatures                            Infected___Advanced;                                        // 0x2320   (0x0038)  
	bool                                               Colored_AO;                                                 // 0x2358   (0x0001)  
	unsigned char                                      UnknownData60_5[0x7];                                       // 0x2359   (0x0007)  MISSED
	class UMaterial*                                   mColoredAO;                                                 // 0x2360   (0x0008)  
	class UMaterialInstanceDynamic*                    iColoredAO;                                                 // 0x2368   (0x0008)  
	FLinearColor                                       Colored_AO_Color;                                           // 0x2370   (0x0010)  
	double                                             Colored_AO_Intensity;                                       // 0x2380   (0x0008)  
	FAdvancedEffectFeatures                            Colored_AO___Advanced;                                      // 0x2388   (0x0038)  
	bool                                               Camera_Shake;                                               // 0x23C0   (0x0001)  
	unsigned char                                      UnknownData61_5[0x7];                                       // 0x23C1   (0x0007)  MISSED
	class UMaterial*                                   mCameraShake;                                               // 0x23C8   (0x0008)  
	class UMaterialInstanceDynamic*                    iCameraShake;                                               // 0x23D0   (0x0008)  
	double                                             Camera_Shake_Power__X_;                                     // 0x23D8   (0x0008)  
	double                                             Camera_Shake_Power__Y_;                                     // 0x23E0   (0x0008)  
	double                                             Camera_Shake_Frequency;                                     // 0x23E8   (0x0008)  
	FAdvancedEffectFeatures                            Camera_Shake___Advanced;                                    // 0x23F0   (0x0038)  
	bool                                               Disco_Ball;                                                 // 0x2428   (0x0001)  
	unsigned char                                      UnknownData62_5[0x7];                                       // 0x2429   (0x0007)  MISSED
	class UMaterial*                                   mDiscoBall;                                                 // 0x2430   (0x0008)  
	class UMaterialInstanceDynamic*                    iDiscoBall;                                                 // 0x2438   (0x0008)  
	FVector3DN                                         Disco_Ball_WS_Center;                                       // 0x2440   (0x000C)  
	FLinearColor                                       Disco_Ball_Color_1;                                         // 0x244C   (0x0010)  
	FLinearColor                                       Disco_Ball_Color_2;                                         // 0x245C   (0x0010)  
	unsigned char                                      UnknownData63_5[0x4];                                       // 0x246C   (0x0004)  MISSED
	FVector                                            Disco_Ball_Block_Scale;                                     // 0x2470   (0x0018)  
	double                                             Disco_Ball_Block_Distribution;                              // 0x2488   (0x0008)  
	double                                             Disco_Ball_Rotation_Speed;                                  // 0x2490   (0x0008)  
	double                                             Disco_Ball_Manual_Rotation;                                 // 0x2498   (0x0008)  
	FAdvancedEffectFeatures                            Disco_Ball___Advanced;                                      // 0x24A0   (0x0038)  
	bool                                               Hazy_Lights;                                                // 0x24D8   (0x0001)  
	unsigned char                                      UnknownData64_5[0x7];                                       // 0x24D9   (0x0007)  MISSED
	class UMaterial*                                   mHazyLights;                                                // 0x24E0   (0x0008)  
	class UMaterialInstanceDynamic*                    iHazyLights;                                                // 0x24E8   (0x0008)  
	FVector2DN                                         Hazy_Lights_Move_Speed;                                     // 0x24F0   (0x0008)  
	FVector2DN                                         Hazy_Lights_Position;                                       // 0x24F8   (0x0008)  
	FAdvancedEffectFeatures                            Hazy_Lights___Advanced;                                     // 0x2500   (0x0038)  
	bool                                               Melted_World;                                               // 0x2538   (0x0001)  
	unsigned char                                      UnknownData65_5[0x7];                                       // 0x2539   (0x0007)  MISSED
	class UMaterial*                                   mMeltedWorld;                                               // 0x2540   (0x0008)  
	class UMaterialInstanceDynamic*                    iMeltedWorld;                                               // 0x2548   (0x0008)  
	FVector                                            Melted_World_Size;                                          // 0x2550   (0x0018)  
	double                                             Melted_World_Distance;                                      // 0x2568   (0x0008)  
	double                                             Melted_World_Power;                                         // 0x2570   (0x0008)  
	double                                             Melted_World_Sharpness;                                     // 0x2578   (0x0008)  
	FAdvancedEffectFeatures                            Melted_World___Advanced;                                    // 0x2580   (0x0038)  
	bool                                               Selective_Color;                                            // 0x25B8   (0x0001)  
	unsigned char                                      UnknownData66_5[0x7];                                       // 0x25B9   (0x0007)  MISSED
	class UMaterial*                                   mSelectiveColor;                                            // 0x25C0   (0x0008)  
	class UMaterialInstanceDynamic*                    iSelectiveColor;                                            // 0x25C8   (0x0008)  
	FLinearColor                                       Selective_Color_Mask_Color;                                 // 0x25D0   (0x0010)  
	double                                             Selective_Color_Hue_Tolerance;                              // 0x25E0   (0x0008)  
	double                                             Selective_Color_Saturation_Tolerance;                       // 0x25E8   (0x0008)  
	double                                             Selective_Color_Value_Tolerance;                            // 0x25F0   (0x0008)  
	FAdvancedEffectFeatures                            Selective_Color___Advanced;                                 // 0x25F8   (0x0038)  
	bool                                               Screen_Fire;                                                // 0x2630   (0x0001)  
	unsigned char                                      UnknownData67_5[0x7];                                       // 0x2631   (0x0007)  MISSED
	class UMaterial*                                   mScreenFire;                                                // 0x2638   (0x0008)  
	class UMaterialInstanceDynamic*                    iScreenFire;                                                // 0x2640   (0x0008)  
	FLinearColor                                       Screen_Fire_Color;                                          // 0x2648   (0x0010)  
	double                                             Screen_Fire_Distortion_Amount;                              // 0x2658   (0x0008)  
	double                                             Screen_Fire_Mask_Contrast;                                  // 0x2660   (0x0008)  
	double                                             Screen_Fire_Mask_Scale;                                     // 0x2668   (0x0008)  
	double                                             Screen_Fire_Flame_Tiling;                                   // 0x2670   (0x0008)  
	double                                             Screen_Fire_Speed;                                          // 0x2678   (0x0008)  
	FAdvancedEffectFeatures                            Screen_Fire___Advanced;                                     // 0x2680   (0x0038)  
	bool                                               Haunted;                                                    // 0x26B8   (0x0001)  
	unsigned char                                      UnknownData68_5[0x7];                                       // 0x26B9   (0x0007)  MISSED
	class UMaterial*                                   mHaunted;                                                   // 0x26C0   (0x0008)  
	class UMaterialInstanceDynamic*                    iHaunted;                                                   // 0x26C8   (0x0008)  
	double                                             Haunted_Amount;                                             // 0x26D0   (0x0008)  
	double                                             Haunted_Mask_Scale;                                         // 0x26D8   (0x0008)  
	class UTexture2D*                                  Haunted_Texture;                                            // 0x26E0   (0x0008)  
	double                                             Haunted_Texture_Scale;                                      // 0x26E8   (0x0008)  
	FAdvancedEffectFeatures                            Haunted___Advanced;                                         // 0x26F0   (0x0038)  
	bool                                               Grid_Cell;                                                  // 0x2728   (0x0001)  
	unsigned char                                      UnknownData69_5[0x7];                                       // 0x2729   (0x0007)  MISSED
	class UMaterial*                                   mGridCell;                                                  // 0x2730   (0x0008)  
	class UMaterialInstanceDynamic*                    iGridCell;                                                  // 0x2738   (0x0008)  
	bool                                               Grid_Cell_Animated;                                         // 0x2740   (0x0001)  
	unsigned char                                      UnknownData70_5[0x7];                                       // 0x2741   (0x0007)  MISSED
	double                                             Grid_Cell_Animation_Speed;                                  // 0x2748   (0x0008)  
	FLinearColor                                       Grid_Cell_Color;                                            // 0x2750   (0x0010)  
	FLinearColor                                       Grid_Cell_Void_Color;                                       // 0x2760   (0x0010)  
	double                                             Grid_Cell_Tiling;                                           // 0x2770   (0x0008)  
	double                                             Grid_Cell_Transition_Amount;                                // 0x2778   (0x0008)  
	bool                                               Lens_Distortion;                                            // 0x2780   (0x0001)  
	unsigned char                                      UnknownData71_5[0x7];                                       // 0x2781   (0x0007)  MISSED
	class UMaterial*                                   mLensDistortion;                                            // 0x2788   (0x0008)  
	class UMaterialInstanceDynamic*                    iLensDistortion;                                            // 0x2790   (0x0008)  
	double                                             Lens_Distortion_Optic_Refinement;                           // 0x2798   (0x0008)  
	double                                             Lens_Distortion_Optic_Size;                                 // 0x27A0   (0x0008)  
	double                                             Lens_Distortion_Optic_Position_X;                           // 0x27A8   (0x0008)  
	double                                             Lens_Distortion_Optic_Position_Y;                           // 0x27B0   (0x0008)  
	class UTexture2D*                                  Lens_Distortion_Scope_Texture;                              // 0x27B8   (0x0008)  
	double                                             Lens_Distortion_Scope_Texture_Scale_X;                      // 0x27C0   (0x0008)  
	double                                             Lens_Distortion_Scope_Texture_Scale_Y;                      // 0x27C8   (0x0008)  
	FAdvancedEffectFeatures                            Lens_Distortion___Advanced;                                 // 0x27D0   (0x0038)  
	FAdvancedEffectFeatures                            Grid_Cell___Advanced;                                       // 0x2808   (0x0038)  
	bool                                               Zone;                                                       // 0x2840   (0x0001)  
	unsigned char                                      UnknownData72_5[0x7];                                       // 0x2841   (0x0007)  MISSED
	class UMaterial*                                   mZone;                                                      // 0x2848   (0x0008)  
	class UMaterialInstanceDynamic*                    iZone;                                                      // 0x2850   (0x0008)  
	FLinearColor                                       Zone_Center;                                                // 0x2858   (0x0010)  
	double                                             Zone_Radius;                                                // 0x2868   (0x0008)  
	double                                             Zone_Edge_Hardness;                                         // 0x2870   (0x0008)  
	FLinearColor                                       Zone_Edge_Color;                                            // 0x2878   (0x0010)  
	FLinearColor                                       Zone_Coverage_Color;                                        // 0x2888   (0x0010)  
	FAdvancedEffectFeatures                            Zone___Advanced;                                            // 0x2898   (0x0038)  
	bool                                               Pyramid;                                                    // 0x28D0   (0x0001)  
	unsigned char                                      UnknownData73_5[0x7];                                       // 0x28D1   (0x0007)  MISSED
	class UMaterial*                                   mPyramid;                                                   // 0x28D8   (0x0008)  
	class UMaterialInstanceDynamic*                    iPyramid;                                                   // 0x28E0   (0x0008)  
	bool                                               Pyramid_Masked;                                             // 0x28E8   (0x0001)  
	unsigned char                                      UnknownData74_5[0x3];                                       // 0x28E9   (0x0003)  MISSED
	FLinearColor                                       Pyramid_Background_Color;                                   // 0x28EC   (0x0010)  
	unsigned char                                      UnknownData75_5[0x4];                                       // 0x28FC   (0x0004)  MISSED
	double                                             Pyramid_Width;                                              // 0x2900   (0x0008)  
	double                                             Pyramid_Pan;                                                // 0x2908   (0x0008)  
	double                                             Pyramid_Tile_Amount;                                        // 0x2910   (0x0008)  
	FAdvancedEffectFeatures                            Pyramid___Advanced;                                         // 0x2918   (0x0038)  
	bool                                               Mojo;                                                       // 0x2950   (0x0001)  
	unsigned char                                      UnknownData76_5[0x7];                                       // 0x2951   (0x0007)  MISSED
	class UMaterial*                                   mMojo;                                                      // 0x2958   (0x0008)  
	class UMaterialInstanceDynamic*                    iMojo;                                                      // 0x2960   (0x0008)  
	bool                                               Mojo_Animated;                                              // 0x2968   (0x0001)  
	unsigned char                                      UnknownData77_5[0x7];                                       // 0x2969   (0x0007)  MISSED
	double                                             Mojo_Animation_Speed;                                       // 0x2970   (0x0008)  
	class UTexture2D*                                  Mojo_Mask;                                                  // 0x2978   (0x0008)  
	class UTexture2D*                                  Mojo_Distortion_Map;                                        // 0x2980   (0x0008)  
	double                                             Mojo_Distortion_Amount;                                     // 0x2988   (0x0008)  
	FLinearColor                                       Mojo_Color;                                                 // 0x2990   (0x0010)  
	double                                             Mojo_Intensity;                                             // 0x29A0   (0x0008)  
	double                                             Mojo_Phase;                                                 // 0x29A8   (0x0008)  
	double                                             Mojo_Tolerance;                                             // 0x29B0   (0x0008)  
	FAdvancedEffectFeatures                            Mojo___Advanced;                                            // 0x29B8   (0x0038)  
	bool                                               Gradient_Fog;                                               // 0x29F0   (0x0001)  
	unsigned char                                      UnknownData78_5[0x7];                                       // 0x29F1   (0x0007)  MISSED
	class UMaterial*                                   mGradientFog;                                               // 0x29F8   (0x0008)  
	class UMaterialInstanceDynamic*                    iGradientFog;                                               // 0x2A00   (0x0008)  
	TArray<FColor>                                     Gradient_Fog_Colors;                                        // 0x2A08   (0x0010)  
	double                                             Gradient_Fog_Distance;                                      // 0x2A18   (0x0008)  
	double                                             Gradient_Fog_Sharpness;                                     // 0x2A20   (0x0008)  
	FAdvancedEffectFeatures                            Gradient_Fog___Advanced;                                    // 0x2A28   (0x0038)  
	class UTextureRenderTarget2D*                      ColorIndexRT;                                               // 0x2A60   (0x0008)  
	class UMaterial*                                   M_ColorIndexer;                                             // 0x2A68   (0x0008)  
	class UMaterialInstanceDynamic*                    I_ColorIndexer;                                             // 0x2A70   (0x0008)  
	bool                                               Dither;                                                     // 0x2A78   (0x0001)  
	unsigned char                                      UnknownData79_5[0x7];                                       // 0x2A79   (0x0007)  MISSED
	class UMaterial*                                   mDither;                                                    // 0x2A80   (0x0008)  
	class UMaterialInstanceDynamic*                    iDither;                                                    // 0x2A88   (0x0008)  
	double                                             Dither_Limit;                                               // 0x2A90   (0x0008)  
	FAdvancedEffectFeatures                            Dither___Advanced;                                          // 0x2A98   (0x0038)  
	bool                                               Speed_Lines;                                                // 0x2AD0   (0x0001)  
	unsigned char                                      UnknownData80_5[0x7];                                       // 0x2AD1   (0x0007)  MISSED
	class UMaterial*                                   mSpeedLines_;                                               // 0x2AD8   (0x0008)  
	class UMaterialInstanceDynamic*                    iSpeedLines;                                                // 0x2AE0   (0x0008)  
	double                                             Speed_Lines_Intensity;                                      // 0x2AE8   (0x0008)  
	double                                             Speed_Lines_Line_Width;                                     // 0x2AF0   (0x0008)  
	double                                             Speed_Lines_Speed;                                          // 0x2AF8   (0x0008)  
	double                                             Speed_Lines_Mask_Radius;                                    // 0x2B00   (0x0008)  
	double                                             Speed_Lines_Mask_Hardness;                                  // 0x2B08   (0x0008)  
	FAdvancedEffectFeatures                            Speed_Lines___Advanced;                                     // 0x2B10   (0x0038)  
	bool                                               Cyber_Scan;                                                 // 0x2B48   (0x0001)  
	unsigned char                                      UnknownData81_5[0x7];                                       // 0x2B49   (0x0007)  MISSED
	class UMaterial*                                   mCyberScan;                                                 // 0x2B50   (0x0008)  
	class UMaterialInstanceDynamic*                    iCyberScan;                                                 // 0x2B58   (0x0008)  
	double                                             Cyber_Scan_Speed;                                           // 0x2B60   (0x0008)  
	FAdvancedEffectFeatures                            Cyber_Scan___Advanced;                                      // 0x2B68   (0x0038)  


	/// Functions
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Cyber Scan Func
	// void Cyber Scan Func(bool IsEnabled);                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Speed Lines Func
	// void Speed Lines Func(bool IsEnabled);                                                                                // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Dither Func
	// void Dither Func(bool IsEnabled);                                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Gradient Fog Func
	// void Gradient Fog Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Create Effect Material Instance
	// void Create Effect Material Instance(class UMaterial* Material, class UMaterialInstanceDynamic*& Instance);           // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Mojo Func
	// void Mojo Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Pyramid Func
	// void Pyramid Func(bool IsEnabled);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Zone Func
	// void Zone Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Lens Func
	// void Lens Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Grid Cell Func
	// void Grid Cell Func(bool IsEnabled);                                                                                  // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Haunted Func
	// void Haunted Func(bool IsEnabled);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Screen Fire Func
	// void Screen Fire Func(bool IsEnabled);                                                                                // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Selective Color Func
	// void Selective Color Func(bool IsEnabled);                                                                            // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Melted World Func
	// void Melted World Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Hazy Lights Func
	// void Hazy Lights Func(bool IsEnabled);                                                                                // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Disco Ball Func
	// void Disco Ball Func(bool IsEnabled);                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Camera Shake Func
	// void Camera Shake Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Colored AO Func
	// void Colored AO Func(bool IsEnabled);                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Infected Func
	// void Infected Func(bool IsEnabled);                                                                                   // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Actor Featurette Func
	// void Actor Featurette Func(bool IsEnabled);                                                                           // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Set Advanced Effect Features (No Custom Depth)
	// void Set Advanced Effect Features (No Custom Depth)(FAdvancedEffectFeaturesNoCustomDepth Features, class UMaterial* Material, class UMaterialInstanceDynamic* Dynamic Material Instance); // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Set Advanced Effect Features
	// void Set Advanced Effect Features(FAdvancedEffectFeatures Features, class UMaterial* Material, class UMaterialInstanceDynamic* Dynamic Material Instance); // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Wired Func
	// void Wired Func(bool IsEnabled);                                                                                      // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Sketch Func
	// void Sketch Func(bool IsEnabled);                                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Alarm Func
	// void Alarm Func(bool IsEnabled);                                                                                      // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Digitize Func
	// void Digitize Func(bool IsEnabled);                                                                                   // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.World Glitch Func
	// void World Glitch Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.World Splash Func
	// void World Splash Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Snow Func
	// void Snow Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Letterboxing Func
	// void Letterboxing Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Kaleidoscope Func
	// void Kaleidoscope Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.2D Transform Func
	// void 2D Transform Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Set Effect Priority
	// void Set Effect Priority(int32_t Priority, class UMaterial* Material);                                                // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.ApplyChameleonSettings
	// void ApplyChameleonSettings();                                                                                        // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Custom Depth Highlighter (NC) Func
	// void Custom Depth Highlighter (NC) Func(bool IsEnabled);                                                              // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Custom Depth Highlighter Func
	// void Custom Depth Highlighter Func(bool IsEnabled);                                                                   // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Neon Func
	// void Neon Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Frost Func
	// void Frost Func(bool IsEnabled);                                                                                      // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Anamorphic Lens Flares Func
	// void Anamorphic Lens Flares Func(bool IsEnabled);                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Toon Shading Func
	// void Toon Shading Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Sharpen Func
	// void Sharpen Func(bool IsEnabled);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Screen Decals Func
	// void Screen Decals Func(bool IsEnabled);                                                                              // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Screen Damage Func
	// void Screen Damage Func(bool IsEnabled);                                                                              // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Magic Transitions Func
	// void Magic Transitions Func(bool IsEnabled);                                                                          // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Drawing Func
	// void Drawing Func(bool IsEnabled);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Distance Distortion Func
	// void Distance Distortion Func(bool Condition);                                                                        // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Sonar Func
	// void Sonar Func(bool Condition);                                                                                      // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Circles Func
	// void Circles Func(bool Condition);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.LOOK Func
	// void LOOK Func(bool Condition);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.TV Noise Func
	// void TV Noise Func(bool& IsEnabled);                                                                                  // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Tiles Func
	// void Tiles Func(bool& IsEnabled);                                                                                     // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Squares Func
	// void Squares Func(bool& IsEnabled);                                                                                   // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Pulse Func
	// void Pulse Func(bool& IsEnabled);                                                                                     // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Kuwahara Func
	// void Kuwahara Func(bool& IsEnabled);                                                                                  // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Iridescent Func
	// void Iridescent Func(bool& IsEnabled);                                                                                // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Invert Func
	// void Invert Func(bool& IsEnabled);                                                                                    // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Hard Emboss Func
	// void Hard Emboss Func(bool& IsEnabled);                                                                               // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Emboss Func
	// void Emboss Func(bool& IsEnabled);                                                                                    // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Edge Detect Func
	// void Edge Detect Func(bool& IsEnabled);                                                                               // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.ASCII Func
	// void ASCII Func(bool& IsEnabled);                                                                                     // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Bleach Func
	// void Bleach Func(bool& IsEnabled);                                                                                    // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Scratches Func
	// void Scratches Func(bool IsEnabled);                                                                                  // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Distance Fog Func
	// void Distance Fog Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Screen Waves Func
	// void Screen Waves Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Radial Blur Func
	// void Radial Blur Func(bool IsEnabled);                                                                                // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Monochrome Func
	// void Monochrome Func(bool IsEnabled);                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Hue Panner Func
	// void Hue Panner Func(bool IsEnabled);                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.MonitorFX Func
	// void MonitorFX Func(bool IsEnabled);                                                                                  // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Glitch Func
	// void Glitch Func(bool IsEnabled);                                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Comic Func
	// void Comic Func(bool IsEnabled);                                                                                      // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Colorize Func
	// void Colorize Func(bool Condition);                                                                                   // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Blur Func
	// void Blur Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Pixel Dissolve Func
	// void Pixel Dissolve Func(bool IsEnabled);                                                                             // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Drug Func
	// void Drug Func(bool IsEnabled);                                                                                       // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Alcohol Func
	// void Alcohol Func(bool IsEnabled);                                                                                    // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Mosaic Func
	// void Mosaic Func(bool IsEnabled);                                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Screen Drops Func
	// void Screen Drops Func(bool IsEnabled);                                                                               // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.InitChameleon
	// void InitChameleon();                                                                                                 // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Channel Swapper Func
	// void Channel Swapper Func(bool IsEnabled);                                                                            // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Channel Clamper Func
	// void Channel Clamper Func(bool& IsEnabled);                                                                           // [0x2119480] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.Create Material Instances
	// void Create Material Instances();                                                                                     // [0x2119480] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.ReceiveActorBeginOverlap
	// void ReceiveActorBeginOverlap(class AActor* OtherActor);                                                              // [0x2119480] Event|Public|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x2119480] Event|Public|BlueprintEvent 
	// Function /Game/Chameleon/Chameleon.Chameleon_C.ExecuteUbergraph_Chameleon
	// void ExecuteUbergraph_Chameleon(int32_t EntryPoint);                                                                  // [0x2119480] Final                
};

/// Class /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C
/// Size: 0x0028 (0x002BA0 - 0x002BC8)
class AFlashBang_Effect_C : public AChameleon_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x2BA0   (0x0008)  
	float                                              Timeline_1_NewTrack_0_AB6F86454940223ECF27DA959388CED9;     // 0x2BA8   (0x0004)  
	SDK_UNDEFINED(1,2038) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_1__Direction_AB6F86454940223ECF27DA959388CED9); // 0x2BAC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x2BAD   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x2BB0   (0x0008)  
	float                                              Timeline_0_NewTrack_0_43D6D4B443611D4A553FA9A1837A885B;     // 0x2BB8   (0x0004)  
	SDK_UNDEFINED(1,2039) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_0__Direction_43D6D4B443611D4A553FA9A1837A885B); // 0x2BBC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x2BBD   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline0;                                                  // 0x2BC0   (0x0008)  


	/// Functions
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                      // [0x2119480] BlueprintEvent       
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                        // [0x2119480] BlueprintEvent       
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.Timeline_1__FinishedFunc
	// void Timeline_1__FinishedFunc();                                                                                      // [0x2119480] BlueprintEvent       
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.Timeline_1__UpdateFunc
	// void Timeline_1__UpdateFunc();                                                                                        // [0x2119480] BlueprintEvent       
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x2119480] Event|Protected|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/FlashBang_Effect.FlashBang_Effect_C.ExecuteUbergraph_FlashBang_Effect
	// void ExecuteUbergraph_FlashBang_Effect(int32_t EntryPoint);                                                           // [0x2119480] Final|HasDefaults    
};

/// Class /Game/Chameleon/Recipes/YakinMermi_Effect.YakinMermi_Effect_C
/// Size: 0x0000 (0x002BA0 - 0x002BA0)
class AYakinMermi_Effect_C : public AChameleon_C
{ 
public:
};

/// Class /Game/Chameleon/Recipes/Yaralanma_Effect.Yaralanma_Effect_C
/// Size: 0x0000 (0x002BA0 - 0x002BA0)
class AYaralanma_Effect_C : public AChameleon_C
{ 
public:
};

/// Class /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C
/// Size: 0x000A (0x002BA0 - 0x002BAA)
class ADataPad_Effect_C : public AChameleon_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x2BA0   (0x0008)  
	bool                                               Kapandi;                                                    // 0x2BA8   (0x0001)  
	bool                                               IleriGeri;                                                  // 0x2BA9   (0x0001)  


	/// Functions
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x2119480] Event|Protected|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.SonarWave
	// void SonarWave(double A, double InterpSpeed);                                                                         // [0x2119480] Net|NetReliableNetMulticast|BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.SonarOpacity
	// void SonarOpacity(double A, double InterpSpeed);                                                                      // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.DigitizeOpacity
	// void DigitizeOpacity(double A, double InterpSpeed);                                                                   // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.GridCellOpacity
	// void GridCellOpacity(double A, double InterpSpeed);                                                                   // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.GlitchOpacity
	// void GlitchOpacity(double A, double InterpSpeed);                                                                     // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.NeonOpacity
	// void NeonOpacity(double A, double InterpSpeed);                                                                       // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.SonarSes
	// void SonarSes();                                                                                                      // [0x2119480] BlueprintCallable|BlueprintEvent 
	// Function /Game/Chameleon/Recipes/DataPad_Effect.DataPad_Effect_C.ExecuteUbergraph_DataPad_Effect
	// void ExecuteUbergraph_DataPad_Effect(int32_t EntryPoint);                                                             // [0x2119480] Final|HasDefaults    
};

/// Class /Game/Chameleon/Recipes/HasarAlma_Effect.HasarAlma_Effect_C
/// Size: 0x0000 (0x002BA0 - 0x002BA0)
class AHasarAlma_Effect_C : public AChameleon_C
{ 
public:
};

/// Struct /Game/Chameleon/Structures/LOOKCGStruct.LOOKCGStruct
/// Size: 0x0008 (0x000000 - 0x000008)
struct FLOOKCGStruct
{ 
	class UTexture*                                    File_13_63DC650B4BDD73EBAA9B97AAB0ABE957;                   // 0x0000   (0x0008)  
};

