
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_MedicalLocker1.BP_MedicalLocker1_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_MedicalLocker1_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Cap_Visible;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Cap_Rotation;                                               // 0x02B8   (0x0008)  
	double                                             Draw_Distance__0___Infinity_;                               // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_MedicalLocker1.BP_MedicalLocker1_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit2_02.BP_FirstAidKit2_02_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_FirstAidKit2_02_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Cap_Visible;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Cap_Rotation;                                               // 0x02B8   (0x0008)  
	double                                             Draw_Distance__0___Infinity_;                               // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit2_02.BP_FirstAidKit2_02_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit2_03.BP_FirstAidKit2_03_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_FirstAidKit2_03_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Cap_Visible;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Cap_Rotation;                                               // 0x02B8   (0x0008)  
	double                                             Draw_Distance__0___Infinity_;                               // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit2_03.BP_FirstAidKit2_03_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_MedicalLocker2.BP_MedicalLocker2_C
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ABP_MedicalLocker2_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02A0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02A8   (0x0008)  
	bool                                               Cap_Visible;                                                // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02B1   (0x0007)  MISSED
	double                                             Cap_Rotation;                                               // 0x02B8   (0x0008)  
	double                                             Draw_Distance__0___Infinity_;                               // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_MedicalLocker2.BP_MedicalLocker2_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit3_03.BP_FirstAidKit3_03_C
/// Size: 0x0060 (0x000290 - 0x0002F0)
class ABP_FirstAidKit3_03_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent07;                                      // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent06;                                      // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent05;                                      // 0x02A8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent04;                                      // 0x02B0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent03;                                      // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent02;                                      // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x02C8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x02D0   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x02D8   (0x0008)  
	bool                                               Aid_Package_Visible;                                        // 0x02E0   (0x0001)  
	bool                                               Gauze_Bandage_Visible;                                      // 0x02E1   (0x0001)  
	bool                                               Packed_Bandage_Visible;                                     // 0x02E2   (0x0001)  
	bool                                               Health_Syringe_Visible;                                     // 0x02E3   (0x0001)  
	bool                                               Painkiller_Box_Visible;                                     // 0x02E4   (0x0001)  
	bool                                               Pills_1_Visible;                                            // 0x02E5   (0x0001)  
	bool                                               Pills_2_Visible;                                            // 0x02E6   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x02E7   (0x0001)  MISSED
	double                                             Draw_Distance__0___Infinity_;                               // 0x02E8   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit3_03.BP_FirstAidKit3_03_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit3_01.BP_FirstAidKit3_01_C
/// Size: 0x00D8 (0x000290 - 0x000368)
class ABP_FirstAidKit3_01_C : public AActor
{ 
public:
	class UBillboardComponent*                         Billboard;                                                  // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent020;                                     // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent019;                                     // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent018;                                     // 0x02A8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent017;                                     // 0x02B0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent016;                                     // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent015;                                     // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent014;                                     // 0x02C8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent013;                                     // 0x02D0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent012;                                     // 0x02D8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent011;                                     // 0x02E0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent010;                                     // 0x02E8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent09;                                      // 0x02F0   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent08;                                      // 0x02F8   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent07;                                      // 0x0300   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent06;                                      // 0x0308   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent05;                                      // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent04;                                      // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent03;                                      // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent02;                                      // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent01;                                      // 0x0330   (0x0008)  
	class UStaticMeshComponent*                        StaticMeshComponent0;                                       // 0x0338   (0x0008)  
	class USceneComponent*                             SharedRoot;                                                 // 0x0340   (0x0008)  
	bool                                               Energy_Syringe_1_Visible;                                   // 0x0348   (0x0001)  
	bool                                               Health_Syringe_Visible;                                     // 0x0349   (0x0001)  
	bool                                               Energy_Syringe_2_Visible;                                   // 0x034A   (0x0001)  
	bool                                               Aid_Package_1_Visible;                                      // 0x034B   (0x0001)  
	bool                                               AidPackage_2_Visible;                                       // 0x034C   (0x0001)  
	bool                                               Painkiller_1_Visible;                                       // 0x034D   (0x0001)  
	bool                                               Painkiller_2_Visible;                                       // 0x034E   (0x0001)  
	bool                                               Pills_1_Visible;                                            // 0x034F   (0x0001)  
	bool                                               Pills_2_Visible;                                            // 0x0350   (0x0001)  
	bool                                               Pills_3_Visible;                                            // 0x0351   (0x0001)  
	bool                                               Pills_4_Visible;                                            // 0x0352   (0x0001)  
	bool                                               Pills_5_Visible;                                            // 0x0353   (0x0001)  
	bool                                               Pills_6_Visible;                                            // 0x0354   (0x0001)  
	bool                                               Pills_7_Visible;                                            // 0x0355   (0x0001)  
	bool                                               Gauze_Bandage_Visible;                                      // 0x0356   (0x0001)  
	bool                                               Gauze_Bandage_2_Visible;                                    // 0x0357   (0x0001)  
	bool                                               Packed_Bandage_Visible;                                     // 0x0358   (0x0001)  
	bool                                               Aid_Pot_1_Visible;                                          // 0x0359   (0x0001)  
	bool                                               Aid_Pot_2_Visible;                                          // 0x035A   (0x0001)  
	bool                                               Energy_Pot_Visible;                                         // 0x035B   (0x0001)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x035C   (0x0004)  MISSED
	double                                             Draw_Distance__0___Infinity_;                               // 0x0360   (0x0008)  


	/// Functions
	// Function /Game/First_Aid_Health_Kit/Blueprints/BP_FirstAidKit3_01.BP_FirstAidKit3_01_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x2119480] Event|Public|BlueprintCallable|BlueprintEvent 
};

