
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AdvancedLocomotionV4
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Engine

/// Class /Game/VigilanteMovement/Vehicles/West_Command_M1130/YeniMesh/SK_DuranArac_Skeleton_AnimBlueprint.SK_DuranArac_Skeleton_AnimBlueprint_C
/// Size: 0x0319 (0x000350 - 0x000669)
class USK_DuranArac_Skeleton_AnimBlueprint_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimBlueprintGeneratedMutableData                 __AnimBlueprintMutables;                                    // 0x0358   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x035A   (0x0006)  MISSED
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0360   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0368   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0370   (0x0020)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0390   (0x0048)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03D8   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0500   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone0;                                  // 0x0520   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace1;                       // 0x0648   (0x0020)  
	bool                                               KapiAcma;                                                   // 0x0668   (0x0001)  


	/// Functions
	// Function /Game/VigilanteMovement/Vehicles/West_Command_M1130/YeniMesh/SK_DuranArac_Skeleton_AnimBlueprint.SK_DuranArac_Skeleton_AnimBlueprint_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x2119480] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/VigilanteMovement/Vehicles/West_Command_M1130/YeniMesh/SK_DuranArac_Skeleton_AnimBlueprint.SK_DuranArac_Skeleton_AnimBlueprint_C.ExecuteUbergraph_SK_DuranArac_Skeleton_AnimBlueprint
	// void ExecuteUbergraph_SK_DuranArac_Skeleton_AnimBlueprint(int32_t EntryPoint);                                        // [0x2119480] Final                
};

/// Class /Game/VigilanteMovement/Vehicles/West_APC_Jackal/ArabaSeq.ArabaSeq_C
/// Size: 0x04F8 (0x000350 - 0x000848)
class UArabaSeq_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0388   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03A8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone0;                                  // 0x04D0   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone1;                                  // 0x05F8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone2;                                  // 0x0720   (0x0128)  


	/// Functions
	// Function /Game/VigilanteMovement/Vehicles/West_APC_Jackal/ArabaSeq.ArabaSeq_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                 // [0x2119480] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/VigilanteMovement/Vehicles/West_APC_Jackal/ArabaSeq.ArabaSeq_C.ExecuteUbergraph_ArabaSeq
	// void ExecuteUbergraph_ArabaSeq(int32_t EntryPoint);                                                                   // [0x2119480] Final                
};

