#pragma once

// Dumped with Dumper-7!


namespace SDK
{
	namespace ALS_PlayerCameraBehavior
	{


		//---------------------------------------------------------------------------------------------------------------------
		// ENUMS
		//---------------------------------------------------------------------------------------------------------------------


		//---------------------------------------------------------------------------------------------------------------------
		// STRUCTS
		//---------------------------------------------------------------------------------------------------------------------

		// 0x21F (0x220 - 0x1)
		// ScriptStruct ALS_PlayerCameraBehavior.ALS_PlayerCameraBehavior_C.AnimBlueprintGeneratedConstantData
		struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
		{
		public:
			uint8                                        Pad_3363[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class FName                                  __NameProperty_297;                                // 0x4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3364[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_298;                               // 0x10(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_299;                               // 0x20(0x10)(BlueprintVisible, EditFixedSize)
			class FName                                  __NameProperty_300;                                // 0x30(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_301;                                 // 0x38(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3365[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_302;                               // 0x40(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_303;                               // 0x50(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_304;                               // 0x60(0x10)(BlueprintVisible, EditFixedSize)
			class FName                                  __NameProperty_305;                                // 0x70(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_306;                                 // 0x78(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3366[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_307;                               // 0x80(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_308;                               // 0x90(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_309;                               // 0xA0(0x10)(BlueprintVisible)
			class FName                                  __NameProperty_310;                                // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_311;                                // 0xB8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_312;                                 // 0xC0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3367[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_313;                               // 0xC8(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_314;                               // 0xD8(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_315;                               // 0xE8(0x10)(BlueprintVisible)
			enum class EAlphaBlendOption                 __EnumProperty_316;                                // 0xF8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3368[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_317;                               // 0x100(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_318;                               // 0x110(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_319;                               // 0x120(0x10)(BlueprintVisible)
			struct FAnimNodeFunctionRef                  __StructProperty_320;                              // 0x130(0x20)(BlueprintVisible, NoDestructor)
			class UBlendProfile* __BlendProfile_321;                                // 0x150(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UCurveFloat* __CurveFloat_322;                                  // 0x158(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			bool                                         __BoolProperty_323;                                // 0x160(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAlphaBlendOption                 __EnumProperty_324;                                // 0x161(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EBlendListTransitionType          __EnumProperty_325;                                // 0x162(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_3369[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_326;                               // 0x168(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_327;                               // 0x178(0x10)(BlueprintVisible)
			struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x188(0x80)(None)
			struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x208(0x18)(None)
		};

		// 0xE (0xF - 0x1)
		// ScriptStruct ALS_PlayerCameraBehavior.ALS_PlayerCameraBehavior_C.AnimBlueprintGeneratedMutableData
		struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
		{
		public:
			uint8                                        __ByteProperty;                                    // 0x1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_0;                                  // 0x2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_1;                                  // 0x3(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_2;                                  // 0x4(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_3;                                  // 0x5(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_4;                                  // 0x6(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_5;                                  // 0x7(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_6;                                  // 0x8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_7;                                  // 0x9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_8;                                  // 0xA(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_9;                                  // 0xB(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_10;                                 // 0xC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_11;                                 // 0xD(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_12;                                 // 0xE(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		};

	}
}


