#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1E (0x1E - 0x0)
// UserDefinedStruct AltAttachMag.AltAttachMag
struct FAltAttachMag
{
public:
	double                                       Color_30_482354214E5CB79472A841B2BED797CA;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MermiKapasitesi_34_71EE30044EF8CF2F7812F48292B124F9; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_37_D0575BC24EBF68786A21CD9CB7CC4A0F;   // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Glock_A_31_C84CCC1B46339F93B546BC9000B812FD;   // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Beretta_M9_44_BC01CEFC4CA1595979CE1AB7D98137F9; // 0x19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FN_FiveSeven_46_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x1A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_M1911_47_1F820ECB4AEA061A990BD7BD627672BB;     // 0x1B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_HK_USP_48_C23AD3B94978E4D1DA9222B47258395D;    // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_2011_JW_50_E3F41EB94857FC3705ED18BA2B631F96;   // 0x1D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


