#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x76 (0x76 - 0x0)
// UserDefinedStruct AltSilah.AltSilah
struct FAltSilah
{
public:
	double                                       Color_15_98BF6B114BE3F2AB59A3BBA90C3B4318;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Damage_21_CABBD092453AAA4B12BA27AD76E113EC;        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FireRate_23_55B056A04FCB27D6D62380893E3BF0D7;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MoveSpeed_18_D35C59A74741F32F36A49A88D52BE674;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_25_2A86A138438F390A069562A0EE1DF4E0; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_27_0C5C02C44E231CD6DB43A7A6C139FCD4; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SwitchOpticSpeed_29_D018FAA84EB2DA99C82028B3F42AF674; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gravity_31_86A1EA8B4E1E0ABD6C9EE29072847749;       // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_33_8BE6323E402D834689D620860068EF63;       // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ADSSpeed_35_2878EC8C45071628B7F88BB26AB25D08;      // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EqUnEqSpeed_37_3EED00874E1F7A79ADB1088AB28FC847;   // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_39_B1B457E84811C6E575A7FA98219BD2D4;   // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Velocity_41_9119E50549D71BD7C512F0A2348BA171;      // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoundDistance_43_4C200E2E4A0987716B784FB4EE3F8C94; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Glock_50_145517054F110B0A1D8AA399DD4E44ED; // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Baretta_M9_51_DCB6FA5546CFF88A4C4FA882C6AFC87B; // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_FN_FiveSeven_52_D3ED2AE24350A21C5141BB8DE007CDDB; // 0x72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_M1911_53_3F4CEFD84249077A92F2A7BE4B3EAFC2; // 0x73(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_HK_USP_54_659F582A4EFB9950916BD2A202325FDA; // 0x74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_2011_JW_55_3925CF0D46E0E341E69B45B47400813F; // 0x75(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


