#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0xC0 - 0x0)
// UserDefinedStruct AltSilahStatlari.AltSilahStatlari
struct FAltSilahStatlari
{
public:
	TArray<double>                               Reciever_Glock_49_81481AF24F638D4D03F9E48638C797AE; // 0x0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Reciever_Beretta_M9_50_EFF82C4249ED0BF554DAF497CC299E05; // 0x10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Reciever_FN_FiveSeven_51_9DEFD5AB4BA48447D05E75A415A3DBEF; // 0x20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Reciever_M1911_52_D494AA0E43508D40DF58BF907AE05645; // 0x30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Reciever_HK_USP_53_960B16ED4428B7A4420E97B98D3FD21F; // 0x40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Reciever_2011_JW_57_A30358084995C46370D612A04562291B; // 0x50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Glock_A_7_64C0B1654273FE70823A25A7EFB2AC1E;    // 0x60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Beretta_M9_42_E77449CB4C00A205AF4E2E808ABF7C5D; // 0x70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FN_FiveSeven_43_AE2A385647ECD73E70A05A87CF66C717; // 0x80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_M1911_46_366D8B8C41A0EF6D284EC3B1D6DACBD9;     // 0x90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_HK_USP_47_5DAD812E46EB080681E4C084186E0033;    // 0xA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_2011_JW_48_516C64C945B032EA2999CC8D7AB56C4C;   // 0xB0(0x10)(Edit, BlueprintVisible)
};

}


