#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x11 (0x11 - 0x0)
// UserDefinedStruct AnaAttachCharging.AnaAttachCharging
struct FAnaAttachCharging
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_Ar15_01_41_C84CCC1B46339F93B546BC9000B812FD; // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_Springfield_PDW_43_8C1B26FB4449CD4F070570B55AC0A331; // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MCX_Virtus_45_3BA3BC164224B2455BA4A3A238445A92; // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MCX_Spear_47_DACD95C34A4E33B86DCE3BA2604316C4; // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_M4_51_3FF0B30F4E27731867AE3A8CCF8B5BC8;   // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_M4_02_52_0C314C0642918D645AA72CBCAE36712F; // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MK18_53_ADA1EDF54E30ADEA12E2C89675930CD2; // 0xE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_KrissVector_56_9FA1A4A4428F807875027C9D9C1231C7; // 0xF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_HK_MP7_57_55A19D80497D5A8746BF209B7777AA33; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


