#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x17 (0x17 - 0x0)
// UserDefinedStruct AnaAttachLHandguard.AnaAttachLHandguard
struct FAnaAttachLHandguard
{
public:
	class FName                                  SocketName_26_CD1B6FC54526BADEABE293B894B5F47C;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_19_09528B9947341DD2255F67A866BC2B20;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_15_C84CCC1B46339F93B546BC9000B812FD;     // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Laser_27_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Light_29_3461BA184E571705F4049388BCEE1070; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_A_21_3E6992554EF40438D4221E9F0DA9C170;   // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Peq_Laser_23_B2E63A8E4F16E057A927E0AF6D18B50A; // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Laser_01_31_4C67E36C46BD6B6F32260AAD829843AD; // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Light_01_33_91023055401075735A884D8B8C8EAD2A; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


