#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x17 (0x17 - 0x0)
// UserDefinedStruct AnaAttachFHandguard.AnaAttachFHandguard
struct FAnaAttachFHandguard
{
public:
	class FName                                  SocketName_26_0F53ED5146FE5F429EBDEF934EA9D40F;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_19_777B21794F807793CBAA4CB3ED8FCE14;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_15_C84CCC1B46339F93B546BC9000B812FD;     // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Laser_30_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Light_32_E94A17644ECD644983BC5CA8D7A72493; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_A_21_BFC0DAB348E9BAAFB6324E97B5372FB4;   // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Peq_Laser_23_F9E853214AABAAD20D552894901C0B25; // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Laser_01_34_44EC6AE14D13162B51403180E494CD45; // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Light_01_36_C88BAC354BF1377A3DD6D7844405D4F6; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


