#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x2D (0x2D - 0x0)
// UserDefinedStruct AnaAttachHandGrip.AnaAttachHandGrip
struct FAnaAttachHandGrip
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_34_276CE49F4C4C47D29BA399AFD30B8A7D;       // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_44_E008A0D04A62D7F9BB1330ABF79C36BE; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_46_D9F90F294B8E869D47BA6C92835A9E79; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_Ar15_01_78_C84CCC1B46339F93B546BC9000B812FD; // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_01_79_8C1B26FB4449CD4F070570B55AC0A331; // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_02_80_96FA1EEF4EBFC5479A0AB4AEC0CDC0B6; // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_03_81_1BBE692E426FA3D6344E089DFA721890; // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MCX_Virtus_01_82_2111E78E42101E56631F47A73DC7388D; // 0x24(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MCX_Spear_01_83_78FBFD8D43A922F7ACBAB685D5E85412; // 0x25(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_AK203_84_768C2D10473D2A949008F9932265F365; // 0x26(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_AKM_85_4D7183B643B2515110E7D6B1A20AD420;  // 0x27(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_HK_G3_86_47451C7D44E7D782005303A1EC1EAEBE; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_M4_02_87_F6C3D1F04AFFC93024A85A8462890873; // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MK18_88_D72F8AFC4B9A6E82B05B13AA8C182D0E; // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_SIG_MPX_SBR_89_DAE63399408EB19A1BB56AAC2E263804; // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_Springfield_PDW_90_95194A67479A46E270D101BC127E1598; // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


