#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x59 (0x59 - 0x0)
// UserDefinedStruct AnaAttachMuz.AnaAttachMuz
struct FAnaAttachMuz
{
public:
	double                                       Color_23_4A8A88434CD8674C030364AC9D3C0BE7;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_38_481123D046C578573B78B1884EFCDFE1; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_40_DC3022ED4421F7602D56F9812AA7C5A6; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_42_1DAD9445480C1BF1AE62F9A36316B39E;       // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gravity_45_6A93BCA34AA8C98A20AB06A458F5042B;       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Velocity_48_A081F7C8472539CC1050A6AD32C9B6E9;      // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoundDistance_73_5EEF22A744A34A8FA0AB99860F51D632; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Break_12_9DF4A5C340ED6360A0802E8DD81E1CF7;     // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Silen_13_7FAEC85745BD7C80EF4E0B9A40C6B690;     // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SupB_14_8B5D84CD43D1E50158BCF99587CFEF08;      // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_WCAr15_26_41FBFE644401CA19C12F3DA843EBC19B;    // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SFWarComp_27_C84CCC1B46339F93B546BC9000B812FD; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SFSocom_30_CF90FAD3461E59C6A99679BCA7841D00;   // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Rampage4_31_56B11AD44EDCD42250A37C97A7C7F54C;  // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_PAM472_35_BDB800E742FB915623D5ACA133BB7E64;    // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MultiportS_33_D951C44247072B76D211B799EDFE4B6C; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MultiportL_34_CFF641EB47B79A2A92D252920F8AA6CB; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Ak203_01_50_F93991924BD3DCEB0DE36BAEBBBE6D3F;  // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_01_52_17AD16C34625DC14BE9C33B1373AF2DD;  // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_02_54_F82B8C644018B9A9AB0B5FB3C3C78576;  // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_03_56_6848753B41DF4CA5D9E81DAB079A32AD;  // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Spear_01_58_9E34A54247BBC6B47D41A1B601F55296; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Spear_02_60_F0A66202421FA24E32F084BF819AF933; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Virtus_01_62_5E20DB7A4278528E58D03895CF90C695; // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_01_64_C6AFB0D0457BBF4F0A4A1095D1642627;    // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_02_66_C5BAEAA445671271E0ED0FA11A944584;    // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_03_68_46F5FF3E429C4B5FC0D43C9147225B20;    // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_04_70_9D4A02FE4580C97A5F25D1B884357A52;    // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_AR15_01_88_0A649D5F44629A9FD8028EAF34410B5A;   // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_AR15_02_89_8E82732A4FB623AE73D730B1BCA93D20;   // 0x4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_AR15_03_90_E17030514ED3DD4848AA5F9D41C23800;   // 0x4F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_AR15_04_91_32786AAD4D36FEB92BDF76B44F380E10;   // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_AR15_05_92_136F88EE4DD3214D1C7267A7DE7CA1FC;   // 0x51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_HK_G36_01_93_6B7661BB40558F5B8BEA5683F7B12C20; // 0x52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_HK_G36_02_94_F35582124D5702DEE1042D8D498A9634; // 0x53(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_KrissVector_01_95_91ACD720451CB12F003C4A8FE0566FCC; // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MK18_01_96_69263BA44A6628441C84AA9B7E28F6ED;   // 0x55(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MK18_02_97_59A08DE84D69A32D0C66E6B6F5A37E3B;   // 0x56(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SIG_MPX_SBR_01_98_12ED7ED243C91E582909E29F3AE2096E; // 0x57(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_UMP45_01_99_2D9D58494E0C72BC954530BD74D4A84C;  // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


