#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// UserDefinedStruct AnaAttachBOptic.AnaAttachBOptic
struct FAnaAttachBOptic
{
public:
	class FName                                  SocketName_23_550B6CCE4235E25A4DD0B6B9135B24BE;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_20_4141F32E4A17A3E36ED102B7D99A0A23;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ADSSpeed_30_A693058B47B07C91D67693B3927C5F24;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_32_3AB8FEE544E896994E5A33AC3BF20EC8; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SwitchOpticSpeed_34_3F2643C248A58952538CFCAFAA24C6FB; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP7_Ironsight_F_01_36_C84CCC1B46339F93B546BC9000B812FD; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Flip_16_9DF4A5C340ED6360A0802E8DD81E1CF7;     // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP5_Sight_02_45_918B7846456353C1AE9221B94D1027E5; // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Eotech_14_9915EC084B51FD46E911E785BD30234A;   // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_ElcanM145_26_2BE554A74F04FE7BEF1F099D1DE6C125; // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_SLX3_39_9E3CFC304258948B1D0882A16D5418C4;     // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Ar_01_41_93D6CE324FD43C66BEFCCDB104B4B328; // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Long_01_43_767C66D444460BFEC998A7B3EB2E5257; // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


