#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x36 (0x36 - 0x0)
// UserDefinedStruct AnaAttachMag.AnaAttachMag
struct FAnaAttachMag
{
public:
	double                                       Color_30_ED5F9A424CE29E78F72B3597F8C11B24;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MermiKapasitesi_34_719B15C7400042038D04F09CF542FAC6; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_37_630241C942FEDBEFD981B59D81682342;   // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MK18_01_100_C84CCC1B46339F93B546BC9000B812FD;  // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Springfield_PDW_01_101_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_01_43_FA76192E4B82950B8BC26899B3DB74CD;   // 0x1A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_02_45_CB587765492E54FE74C364B3B6E9D2F6;   // 0x1B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_03_47_9264668C468FB5340B802F829C4BD220;   // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_04_49_E482D5344E3FE53EF7FCC5ACE4546187;   // 0x1D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_05_106_941B40704C1454E16151E38E4456C440;  // 0x1E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_01_39_ED02BD1C4CB59CA6C5978AB7A3064C0D;  // 0x1F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_02_51_CCDE0B784ADDA7682E0C779733F99B1E;  // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_03_53_96E4C8684C9CFC244F7C4F929AB73A85;  // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_04_55_4C9202384ED4EEC8F30BA4BAF191142B;  // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_05_71_3D6FA6FE4872B7C2109290AA7D46E9A3;  // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_01_38_2F5D286F40165238072422BB429A4622;    // 0x24(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_02_57_E1FB340141E7E95926903CBBC979E0D1;    // 0x25(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_03_59_F25F517C4C5C3FD344049FB21DAE1CF9;    // 0x26(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_04_95_0C4E98AE4726C7DA9399DE8624CB47BA;    // 0x27(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MCX_Spear_01_40_793F17284CCFF2B109BAF09DFF4B3BE4; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MCX_Virtus_01_41_00CD6ECF47DF6E00E4034AA579AFF8C1; // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar_104_83817CDF4CA4630005011CB01114AA92;       // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_KrissVector_01_102_E083CF464B9A704FDB0CDDB801BEF79F; // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_AK203_01_66_7AB40FCB47B62DA4DD564C9E08047A86;  // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_AKM_01_67_67A91C034C65EBEE4ED0C4906F425B5B;    // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_HK_G36_01_107_25951CC4448D9DABF94E0387FAC8650D; // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_HK_G3_01_79_613999FF447B2A07A21F588FDD2CF15D;  // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_HK_MP7_01_77_E37633444308BC3D74F7A0B13425BEE0; // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_M14_01_84_23BC94654766E8C7C334B786B6F99800;    // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_M14_02_86_4A04262240002A6BC86C98BC87D2D4FA;    // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_M4_Drum_02_90_72E24127414253087D7E42AE3CFF0BC3; // 0x33(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_SIG_MPX_SBR_01_96_E131D5E441D34548A9E897B159FF5CF1; // 0x34(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_UMP45_01_99_922B66034DCB3BFC9550FF80F0DB2422;  // 0x35(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


