#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x53 (0x53 - 0x0)
// UserDefinedStruct AnaAttachBarrel.AnaAttachBarrel
struct FAnaAttachBarrel
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_26_B17C1F3A43106CDC66FE0EB2C813D360; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_28_2E70EA994BD973E65926DDBDEBA5F7B1; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Velocity_39_1C1EF12849C7B45ECD65358810502273;      // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_34_276CE49F4C4C47D29BA399AFD30B8A7D;       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gravity_38_2B3A14ED4B9CC1106B3C72B2363B2995;       // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FireRate_48_E704F3B042DF1B90A111B98F96DDAFAD;      // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_LB_01_54_C84CCC1B46339F93B546BC9000B812FD; // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_LB_02_60_CE8CECF54909153E005438B723F766F3; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_MB_01_62_C270B6474E31F9020FB40B9C3873351F; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_MB_02_64_1FC90F754421A0DC750990B5DD195153; // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_SB_01_66_4D672EB24336ECB8DE78F9933D5CBB17; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_SB_02_68_089E81EE4C221ABD8A9D15A52B50C4E5; // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_LB_01_53_8C1B26FB4449CD4F070570B55AC0A331; // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_MB_01_70_3F1342D94482D5567FB39B823D5E307D; // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_SB_01_72_597EA7C242943B1914C4E89E6D2FB7FF; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNFAL_LB_01_52_1FD240D74505AF82F3E75A8FF33EC973; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNFAL_MB_01_74_96BCB0944C2588844F5C898C5C9B4283; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNFAL_SB_01_76_B79F18724C8A46BE1E666DA633028CBD; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_MCX_Spear_01_56_AD96DB094228EB50B33254A16C2289E4; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_MCX_Virtus_01_58_E0B86F8B44DD0E320EAAE985E11C7183; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_AK203_01_85_4CA518AB4D44EF06DB988A8BD85F6888; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_AKM_01_86_0692C80643E7C870234C2384FF67D076; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_HK_G36_L_01_87_E18AEED74959D10BBA152DA4EF35ED07; // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_HK_G36_S_01_88_74A3845043B53264DB32DF96B3B92D14; // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_HK_G3_01_89_E5A1EC4E4C906A4D0A431C9D25705F0D; // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_L_01_91_600B3FE542EFFE8D1CA146A5727D4F4B; // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_M_01_92_3483562C429D57E58F84CA8A92AC8275; // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_S_01_95_AAFA87D043F2AB4FD1DEE3B28A473DF9; // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_M14_L_01_96_924C5A674A19B33E06267BAA5FA68EE7; // 0x4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_M14_S_01_100_7655E6B8438F576126DD14A0E037981B; // 0x4F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_SIG_MPX_SBR_01_101_8F1A3311413211112703BFB90AEDA14E; // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Springfield_PDW_01_104_29728AB5448A5A120B4D38B74D055405; // 0x51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_UMP45_01_105_CA5771014DE301FB6096A0A5B89DF16F; // 0x52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


