#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x4F (0x4F - 0x0)
// UserDefinedStruct AnaAttachHandguard.AnaAttachHandguard
struct FAnaAttachHandguard
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_26_B17C1F3A43106CDC66FE0EB2C813D360; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_28_2E70EA994BD973E65926DDBDEBA5F7B1; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_30_1C1EF12849C7B45ECD65358810502273;   // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EqUnEqSpeed_32_3FFAFC074DF0BFF57DE073A7E75AFD5B;   // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_34_276CE49F4C4C47D29BA399AFD30B8A7D;       // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_M4_A_22_C84CCC1B46339F93B546BC9000B812FD;     // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Vector_A_23_8C1B26FB4449CD4F070570B55AC0A331; // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_01_40_9F05F90746A4DE68A40C119D4C4211A9; // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_02_50_717C6B014A9A62B75DDA6A811C078E11; // 0x33(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_03_52_99FA8C304D6A5BCA2AA00F863C2BFAB5; // 0x34(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_04_54_0BF94369453ED5148227DC8F93CC514A; // 0x35(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_SB_HG_01_56_AC0A6F644A84F2355E2D74A23F3A7166; // 0x36(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_SB_HG_02_58_76D978DE487988CE6DD74D9BB54AD720; // 0x37(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_01_42_1D86E1814818CAB2EA1AAD931EB8D511; // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_02_66_DB2F8E26481AE122D4382886A576C9A4; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_03_68_35CB2AF74AA94FB43AF0D3951FC15176; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_04_80_C1341C3646809631968638941BB4D80D; // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_05_70_2662A66E4ECF28EFBF51EB94049FCFDB; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_06_72_93548A6D484FBB2576FD17B759AA2DE5; // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_01_74_5B3E5F6D4328054ED79EF88A95366906; // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_02_76_FEDB99624ADCE7FEDAFE21A113D33F74; // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_03_78_AC452B6741EDF6B22682A188D9346471; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_01_44_48C8B5F545B3F35FC05642BED53119BB; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_02_60_D63454ED4C6D22909C08FF95B9A979F0; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_03_62_792DB9E2480242BC249D888681B5351A; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_04_64_15501E664A1B14F986EEC8A35F974158; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MCX_Spear_HG_01_46_D002795948E84E163FC5F188C3CA0826; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MCX_Virtus_HG_01_48_343D272E4F18114E68BDED85D199864E; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_AK203_HG_01_103_272D7504491C0BBA1AC3EC940940787F; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_AKM_HG_01_102_17D4123C48C1871A2C44AEA253F2A99D; // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_HK_G36_HG_L_01_101_53DDF0E44D6CB8A5C7EF46BE068FB522; // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_HK_G36_HG_S_01_99_39FCAE5C4B1D63ECBD5D1D89187E0A2C; // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_HK_G3_HG_L_01_100_6E848F134CE3103447CEA995CC1A15BE; // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_KrissVector_HG_01_98_1545E8804C7C158D7AAD12B830026831; // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MK18_HG_01_106_B07DE0D94E5D847130DF60923ECBA584; // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Springfield_PDW_HG_01_107_5945E8474740D3117B499397591A0B2F; // 0x4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


