#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x18 (0x18 - 0x0)
// UserDefinedStruct AnaAttachUHandguard.AnaAttachUHandguard
struct FAnaAttachUHandguard
{
public:
	class FName                                  SocketName_27_880956EA4DEF02D9882EE38EE6197A0B;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_20_B5A6B77E4FC7EA903BE027A1F27ED4E9;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_14_C84CCC1B46339F93B546BC9000B812FD;     // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Laser_28_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Light_30_E8AC254A40E5A0A8EEBF60803A8AB5CA; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Barrel_FrontSight_17_1EBA67004460C30761208FBD041BA38D; // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_A_22_281F30F04018A0010524ED8D2F271393;   // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Peq_Laser_24_D4F15A8E46CF76F0D560CA8A1C9BD169; // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Laser_01_32_EABFB86641F6C6D33920B6A6B6FF8B9C; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Light_01_34_91C32EDC4E24407441C7B4BBC5CF6BC1; // 0x17(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


