#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x19 (0x19 - 0x0)
// UserDefinedStruct AnaAttachTrigger.AnaAttachTrigger
struct FAnaAttachTrigger
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Ar15_01_41_C84CCC1B46339F93B546BC9000B812FD; // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_FNFAL_01_42_8C1B26FB4449CD4F070570B55AC0A331; // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MCX_Spear_01_44_18E7B08644F333B7D2FDBF9D92B58592; // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MCX_Virtus_01_46_F8F8C1664C109B4ECB0F9AAA9958CCA6; // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Mp5_01_48_1C8DD91F4C2EC5D82E4B1F888BE6F3D6; // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_AK203_57_A634311044DAA106994916B8EB4C9CCC; // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_AKM_58_D584CDFA47E0170972958A8D8DFBB288;   // 0xE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_HK_G36_59_C2AF8BDC48F4B5A17A61B790F487E14A; // 0xF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_HK_G3_60_1366D6D34D8A92056E215AA3CCF5720C; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_HK_MP7_61_4594A42447136F32686FD6AA7B366539; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_KrissVector_62_3961AA9C46F553453918919EBA9BBA26; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_M14_65_73105DE34829FAFC1C8874B1D6D61922;   // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_M4_02_66_17879A2E4762A8AA5644918804C60266; // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MK18_72_DC82716D4A05963F70AA4BB06D479CF4;  // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_SIG_MPX_SBR_73_C1D542694C0536FA40B8188075FB3AA1; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Springfield_PDW_74_721C4967434A79A0E63CE896E8F32B5E; // 0x17(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_UMP45_75_ACF31B9C41866543668DB1AA4840E911; // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


