#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x17 (0x17 - 0x0)
// UserDefinedStruct AnaAttachRHandguard.AnaAttachRHandguard
struct FAnaAttachRHandguard
{
public:
	class FName                                  SocketName_31_967EF33C441B49528BECB98E9E668D98;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_24_68996CF04D79335DE20ECDB35CF5E59C;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_20_C84CCC1B46339F93B546BC9000B812FD;     // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Laser_32_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Light_34_C462422641B833BBDF39A8B7035C4E29; // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_A_26_2A2A1C7349D789FC311CED88861A0049;   // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Peq_Laser_28_769118B04DDBC38729CFF0A245945244; // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Laser_01_36_213AF621426E4183D226E2A9548F1753; // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Light_01_38_2902CDB64A1E3E77922CBAA383703127; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


