#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x53 (0x53 - 0x0)
// UserDefinedStruct AnaAttachStok.AnaAttachStok
struct FAnaAttachStok
{
public:
	class FName                                  SocketName_38_22F98ED5471BBA1281284DB48B9085A5;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_33_DCAF16064E0774C777490EAD09A751F6;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_41_02FE3B3B42608D88622267836EBB6021; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_43_072FFC7D4E8630C330AFBF99A95ED2BB; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_45_848C90DD4BB60D87E853688DBFC5715B;       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EqUnEqSpeed_47_2573DDE04B66D1E35E107DB59785EFF0;   // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_49_65025A7E4C0835D12F3B858560D1B67A;   // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_01_50_C84CCC1B46339F93B546BC9000B812FD;   // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_02_69_62295DD34DDAB8EBFEE59C9B2CCB7823;   // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_03_71_3789435840F19501CA98E6B981C61EED;   // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_04_73_12395E72486C624679E0FFA6F6FD3105;   // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_05_75_1D899802437C4E89994A938C9918E277;   // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_06_77_57139DA548E59C7F084C57A5D767B50B;   // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_01_51_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_02_52_FB1C43D14BBED5037A537CABC5ECC4AD; // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_03_54_7D6758FC4386A86FA78E7D9766A7F087; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_04_57_100BBDAD4C1E20A85FC6E8AB7438B8A6; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Ar15_BufferTube_58_89663B194BE1CEF5180ABBBAB3296A53; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Ar15_Buttstock_01_59_14ED2AB0420153F2063F8EB2E088E197; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Ar15_Buttstock_02_61_4535D3B244005C6840529F84BEEAC7F0; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_M4_28_2A4E30C04206AC2C350CAA8EF701DFC2;       // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_M4_02_63_47BC6D9F4A76228321334397161E878F;    // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Vector_30_FF2B0A81481F68441BC1FA86FC31A1BF;   // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Sponge_35_5B0956B547F0C51680EA919CDB49C31E;   // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MCX_Spear_01_65_B48E36F84782AD56F81B39B4E2A3FD93; // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MCX_Virtus_01_67_CCF3E31D45AC73BF86BE659EAFF01CB5; // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Springfield_PDW_79_8BFABA00478C6ED84B2278BD3E3FF704; // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MK18_82_3D567CFA428D30AA4D5DF299008B68B8;     // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MP7_84_4EAB794646077E16A493D2BCB3E3BA82;      // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_HK_G3_86_6AD0A6F44181BE44BD2D539A43E8DE44;    // 0x4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_HK_G36_88_99A6322C444BC5B0BBC9229C7DEAEEB0;   // 0x4F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_SIG_MPX_SBR_90_D26962FD4579268BC6EC33BF51AE9512; // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_UMP45_92_8BEEA1124B9CC1D7872A5F8F1E8530BD;    // 0x51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_AK203_01_97_D1A6A8AB41A7D71C33B63DB88A1BFDCD; // 0x52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


