#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// UserDefinedStruct AnaAttachBullet.AnaAttachBullet
struct FAnaAttachBullet
{
public:
	double                                       Color_30_ED5F9A424CE29E78F72B3597F8C11B24;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Damage_38_719B15C7400042038D04F09CF542FAC6;        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Velocity_39_630241C942FEDBEFD981B59D81682342;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gravity_42_9ACFEEF6419FB51BCA08DAADF9D1C3C2;       // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Penetre_51_0ACBE879445ECD6E69CCBEACA2EAB0A0;       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_5_56_52_C84CCC1B46339F93B546BC9000B812FD;   // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_53_9DF4A5C340ED6360A0802E8DD81E1CF7;   // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_39_65_BDB5BA534FADECD9ACF8A3B5E3F80717; // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_10m_54_ED02BD1C4CB59CA6C5978AB7A3064C0D;    // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_9m_55_33B3A8AC4C366ACC0C1763BBABA2A53E;     // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_5_56_Red_57_8604FE1B440A624CA9C881BEBCFF2F57; // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_Red_59_0789F4754EAC8CFE0F051FB071AA1F56; // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_39_Red_64_63875F194FE0EC1F4170CF815C0C8CC6; // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


