#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x44 (0x44 - 0x0)
// UserDefinedStruct AnaAttachBHandguard.AnaAttachBHandguard
struct FAnaAttachBHandguard
{
public:
	double                                       Color_16_1C8AC0DB4FD58D7141FC6AAEBFAE2B98;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ADSSpeed_23_5763BD4F46E31CCFC22B16BFE8273D80;      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_25_0992FA9249AD6C1B5C562684CD31446E; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_27_300D98D746B68ECCECF3B39B562C78DF; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_29_E9AADB744251C459B9031F876A0E1A56;       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SwitchOpticSpeed_31_7AA321E442644AC1AAC61580411683FB; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EqUnEqSpeed_33_0C22F6B943681BC2BE5A79B2C1E4A58E;   // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ver_13_C84CCC1B46339F93B546BC9000B812FD;      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_VerB_12_9DF4A5C340ED6360A0802E8DD81E1CF7;     // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Hor_18_CBCA54C94359A8B714747E99B22AFB96;      // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Hor_A_20_855CED544BBE7854A73A69B38CEC9D58;    // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_01_36_C3CDFE344A9E61DB99EA43AE7AD9CAD1;  // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_02_38_04B2A6A547EFB0021F91B58EB2B9AF75;  // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_03_40_D75C54214DE7D9CF703BD5BA744E34B2;  // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_MCX_Virtus_01_42_D1FEB7CB48AB9A9CF20F61987E5BA07A; // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Mp5_01_44_CAABF1554998F7D5DAC5C3B558398CD3;   // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_MK18_49_5DB6B24F4E5F069A3217B9AE0CF4E92A;     // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_SIG_MPX_SBR_50_C52FC00B490B3BAB9F7862B3A0F7EC8C; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_UMP45_51_5986C88D4C9F817296D55EA80A36A046;    // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


