#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x33 (0x33 - 0x0)
// UserDefinedStruct AnaAttachFOptic.AnaAttachFOptic
struct FAnaAttachFOptic
{
public:
	class FName                                  SocketName_36_DF0B64A74B388C58E0FACABBBF595122;    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Color_31_8BD1BB4E4C7F68F6E38ADDA124442A8B;         // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ADSSpeed_39_DB958FBF4E7393308E3F4B8C97E617B3;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_41_32E00AAD4473BE4842FF4AB860E3D9EB; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SwitchOpticSpeed_43_ACFFEA534CFC9E9EFD1065895A29AE58; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Reddot_A_28_C84CCC1B46339F93B546BC9000B812FD; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MK18_Sight_01_44_9DF4A5C340ED6360A0802E8DD81E1CF7; // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_ZeniticoBelomoPK_45_555399D6456A9F7D950C45A39849AC5C; // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP5_Sight_01_46_84274D7B4E56C1D1F68CFA8F291DD0F3; // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MCX_Virtus_Sight_01_47_26F5E7E547CDB172282EA7973A69DB55; // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_G36_Sight_01_49_E76A2A234150BAC6A9AC8F93608B8FC8; // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Front_Flip_A_33_4C6B0404423C3BF8C24F64B603D704C9; // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Ump45_Sight_01_51_15962E624A6F4CC39B6E9688ADCF3A2B; // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_01_53_8A238296411E6870248EFCAE92C834E8; // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_02_55_FE22E6A047710039C0F098A7A3DB3917; // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_03_57_0E581DF048F8C4B01F1CE091B468D906; // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


