#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC40 (0xC40 - 0x0)
// UserDefinedStruct AnaSilahStatlari.AnaSilahStatlari
struct FAnaSilahStatlari
{
public:
	TArray<double>                               Ar_M4_8_EF05305F443C51A2C207988062684AEE;          // 0x0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_AR15_71_EA4706E0455632EEF29CE4BE3687681E;       // 0x10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_FNFAL_107_63FC91034C70071982D1DCAF94F85838;     // 0x20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_MCX_Spear_133_DA74D6904B88311DFD6194808AB3480D; // 0x30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_MCX_Virtus_149_B0AE2E8E4320535C4D836CB415997DA6; // 0x40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_Springfield_PDW_165_652DC91140F7939B29049EBE145A68F3; // 0x50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_AK203_316_8C3661D844DD17ADF482208FA7B1DFA2;     // 0x60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_AKM_318_5D7E9BE2477E75CD14E57A8E1A09526A;       // 0x70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ar_MK18_322_2B8459CC4C8AB1DBFA4DDF9828F4F4CC;      // 0x80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_Mp5_91_8171EE7344B207BB54C522B69B9CD662;       // 0x90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_KrissVector_320_D25289E945B908DE7B9A6C8EB6189220; // 0xA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_UMP45_324_8C2C17864A50F60FE019F2BF7547B919;    // 0xB0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Ver_10_80EDF4B7415E44841DD3F6AD94018500;      // 0xC0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_VerB_12_E4B126924F8EDC324DD44B9D7116ABA1;     // 0xD0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Hor_14_AD4A8E4B4AFE599FC372A8BC130581BF;      // 0xE0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Hor_A_16_6FB5B7E34B781C8E98183685E32FFA92;    // 0xF0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Ar15_01_191_317530B444738D6EAB5105A8616EFB3C; // 0x100(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Ar15_02_193_4FF54DC847142FE7D64354A25965C7A4; // 0x110(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Ar15_03_195_E7BFA05E4C3005BA14188791FB5A1FD2; // 0x120(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_MCX_Virtus_01_197_13D3CB1B4FBF8092297D49A4FEFE1BC2; // 0x130(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_Mp5_01_199_F2F11B864260A784E715EEACF4B888A1;  // 0x140(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_MK18_352_5BEEF1624028C9E0DB7659B73428A117;    // 0x150(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_SIG_MPX_SBR_353_870F60414D461B76A6509494CE2C35DC; // 0x160(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Grip_UMP45_354_1A6D8F2C4804983ADDBD6C8F633954C8;   // 0x170(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_MP7_Ironsight_F_01_522_10F44C934360A41324262B955F24088F; // 0x180(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_MP5_Sight_02_539_85D5A00B4046D0D4BBFD50B144F04431; // 0x190(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Flip_18_E8782FF141785C69B16780A7A063C227;     // 0x1A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Eotech_20_CDCFF1AD4215007998659F8E50A8C80A;   // 0x1B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Reddot_A_22_1A3590814D830CBB0BFE55AA6CC04C69; // 0x1C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Front_Flip_A_24_2282450F4D7C288F4CD8E09B124C0132; // 0x1D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_MK18_Sight_01_526_6D7984114D81A93F86A4D48CE978B943; // 0x1E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_ZeniticoBelomoPK_528_6C95AB124D66A3468E330D8D2855E538; // 0x1F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_MP5_Sight_01_530_CCEAE47349DC4F9C85123CA654449980; // 0x200(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_MCX_Virtus_Sight_01_532_314B6B1648859BC36BFF868D70EF237F; // 0x210(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_G36_Sight_01_540_04FEBD104416D11D51614AA7825D3642; // 0x220(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_M4_A_26_81131F3C4A99E5A2859A68B1605ECCAF;     // 0x230(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Vector_A_37_1AD34F3141881C4620A8EA8D30C9E91D; // 0x240(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Ar15_LB_HG_01_81_B33BC5A54398A44523CB399EC10D4ABF; // 0x250(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Ar15_LB_HG_02_211_54683B504135596F8E6177BE32579C81; // 0x260(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Ar15_LB_HG_03_213_6AFB40474BDEB2456157CC886F721D58; // 0x270(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Ar15_LB_HG_04_215_4F6F8B26450CC63CC1D760BD8AD8A120; // 0x280(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_01_99_D616E4AD43FACC70ACC5AFBB4B1D9A78; // 0x290(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_02_217_BB672B9043767ABD33D3E9A5AA6BB678; // 0x2A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_03_219_FF594A8C4D3CF01191E3DE9D656BE484; // 0x2B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_04_221_549B2AF0403D4C645DD0E49E8721B70C; // 0x2C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_05_223_DC2500D2417B634421913B885475416F; // 0x2D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_M_HG_06_225_ACBC3884442DF24A39A64198E0E9421F; // 0x2E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_S_HG_01_227_324EC8464EC54BF74B03A88330874CAD; // 0x2F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_S_HG_02_229_97C422B64B8AEE2CCE9F1DBEE04D6931; // 0x300(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Mp5_S_HG_03_231_4E13B91A435B9BC33C39E48AC8527C63; // 0x310(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_FNFAL_HG_01_119_EF9F4CDC4CB7E0ADC65415B9E03FA5C1; // 0x320(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_FNFAL_HG_02_233_A9B61C1E44F67AA6BA9A2E84F3175707; // 0x330(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_FNFAL_HG_03_235_3E371D494C35819C4E05E7A753FBCA6C; // 0x340(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_FNFAL_HG_04_237_2F1151A74A8D23D5D258D0A74508E39F; // 0x350(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_MCX_Spear_HG_01_145_60FBFAB145A70A944743C391956148A5; // 0x360(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_MCX_Virtus_HG_01_157_85D89AD848F3859D490E76ACBE7B8C12; // 0x370(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_AK203_HG_01_478_B42787BD43266474CA6AF3A6148C03BE; // 0x380(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_AKM_HG_01_479_F1F1D9D24E780D230FB983A0F302F57C; // 0x390(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_HK_G36_HG_L_01_480_8D1838E84EDBA6DF5A0538B644BF9B74; // 0x3A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_HK_G36_HG_S_01_482_E08700D0423F909E823E0EB375CDC930; // 0x3B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_HK_G3_HG_L_01_487_1722353044C749767D94D69924D69416; // 0x3C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_KrissVector_HG_01_488_1571678640BCE4F1A7995687841DB548; // 0x3D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_MK18_HG_01_489_30334F3D432D89F659E0068C99623046; // 0x3E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Springfield_PDW_HG_01_490_0FB6FC214A6E0E8FF3F5A99457F899B0; // 0x3F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_MK18_01_432_6F51EEA24AC9D031DA6D9B91A8D71E36;  // 0x400(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Springfield_PDW_01_433_1EA7D91A4FA83B1D2D0A4A9649F69286; // 0x410(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar15_01_243_1B04B6EC439604BA8EE18DB99EAD516E;  // 0x420(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar15_02_245_B12173134DAFC909724ECC8E670E5FCC;  // 0x430(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar15_03_247_06615D454BDBD5DC96D0119E6CEE4DF5;  // 0x440(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar15_04_249_36675B214AF08F983EEC3B98ABFCA786;  // 0x450(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar15_05_444_8A4F09ED4DAC18CBBAC5E88C52508D68;  // 0x460(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FNFAL_01_129_314CF85C41F227EDECAF53A42ACB2A6B; // 0x470(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FNFAL_02_251_E81898C64029673AD746B097A4FAF8FE; // 0x480(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FNFAL_03_253_F550B61B45E199ABB9AC549F6A10ED9A; // 0x490(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FNFAL_04_255_686431A64F4DBE304BBC8CA127DDFFC7; // 0x4A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_FNFAL_05_447_5BB60B234654726212CAF0A4B595548A; // 0x4B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Ar_435_D9EF3BFF4CDCC0E0EDB84FB18DAF0FCC;       // 0x4C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_KrissVector_01_434_149D9660453281053B89F9972CF6BEC0; // 0x4D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Mp5_01_103_6E1609584B0D4DE8E5E70FB1EA828E35;   // 0x4E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Mp5_02_257_F39A833D4A1F97AEE94A76B35695D450;   // 0x4F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Mp5_03_259_34FB2DB94701816E902342B44ADFF97F;   // 0x500(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_Mp5_04_450_1E15A80348B8452F6B83C4829CA1BBC6;   // 0x510(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_MCX_Spear_01_137_CADC640D4A50DCD3A36ACFBA2759A988; // 0x520(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_MCX_Virtus_01_161_0D2061194FA095A7BCF8CC94C5FCF73F; // 0x530(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_AK203_01_471_2330230F4962FA288115E5BC1931A78B; // 0x540(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_AKM_01_472_71305A6E4002D83354F2B38ACBBA531C;   // 0x550(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_HK_G36_01_473_EE729430413C0D36C9B7D0B782AE5AE4; // 0x560(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_HK_G3_01_457_DC4D919A4236670B4D4CEB881681CD97; // 0x570(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_HK_MP7_01_458_5A617797441483AC484738B90E0A1EBA; // 0x580(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_M14_01_463_706985F642A87BF5E9E93286690EBC2D;   // 0x590(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_M14_02_464_BE251E6343164EC48E4A8AA3AD06DA8C;   // 0x5A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_M4_Drum_02_465_295B6FE14D26DC6DC9A06A88F276BFC0; // 0x5B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_SIG_MPX_SBR_01_466_4DF4624341B041965E3FF28A3370FD45; // 0x5C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Mag_UMP45_01_467_AB1FDDFE488EA51D8CF31C9910371CC8; // 0x5D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Break_49_40AB578041E4E51E3DE3DF911EB6753C;     // 0x5E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Silen_50_195CCDB74F757C763A93A899CE33C214;     // 0x5F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_SupB_51_DA3849734BCCAC3714FA848C2FC23723;      // 0x600(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_WCAr15_52_AF8F9ACF4C1797170DE32F98BA2145C7;    // 0x610(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_SFWarComp_53_04BEA52540D92724C456788E61B38CE7; // 0x620(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_SFSocom_54_E1D6A85042A7DA919597D6A9305FBC3F;   // 0x630(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Rampage4_55_1EA527F54B604E3535A956B1E3BEE2E4;  // 0x640(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_PAM472_58_C5D40ADB4F218A8A537260B3EC5C764D;    // 0x650(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MultiportS_59_2E9AF5414630FC60A5A8FEAE727D6D77; // 0x660(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MultiportL_60_C65084C74F7B6BA10340B3806D8F988B; // 0x670(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Ak203_01_261_D0C85B0A484E7CCC9A6535BC2A856162; // 0x680(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_FNFAL_01_263_F5C9818148DC1293961C11BE8C3C432E; // 0x690(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_FNFAL_02_265_1E16E13F43BA89B45D0C26A6EC461E83; // 0x6A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_FNFAL_03_267_425F75254A54634EF6224B8D9F57F2BA; // 0x6B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MCX_Spear_01_269_80F6B04547654752AC54F691D30046EB; // 0x6C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MCX_Spear_02_271_5BBD818243CF45F165DDDEBAA7FA4BDE; // 0x6D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MCX_Virtus_01_274_BE2CF58249171B54472D85859BA58DA6; // 0x6E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Mp5_01_276_3264FADB456AC68E5C1C2C80D5303CF4;   // 0x6F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Mp5_02_278_A4DAE67844806CA136AB0E92D707ACD0;   // 0x700(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Mp5_03_280_C5E9C84E4861C284992C03866A77E03F;   // 0x710(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_Mp5_04_282_D9D0487B4E424583F5E5E7BD3F3A96B9;   // 0x720(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_AR15_01_420_9FE0A75340C63351272CA0A707121868;  // 0x730(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_AR15_02_421_705BDFC64559D76204BF67985D69FCAB;  // 0x740(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_AR15_03_422_918BBB314EBF6DC69B8E8F8E41A89CBB;  // 0x750(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_AR15_04_423_9B5D442D48BABAF9D46EDBBCEAB0EF03;  // 0x760(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_AR15_05_424_E721F80D4B085C18596C87B071C1C654;  // 0x770(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_HK_G36_01_425_6FBBFF3440E090F3560C8991E825A08C; // 0x780(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_HK_G36_02_426_D9939F374C8E8AF6EF9478818590C7D4; // 0x790(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_KrissVector_01_427_41B68593406E450D8B171CA42234E8AC; // 0x7A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MK18_01_428_C76820F648F57C4D7E9C428BA6680084;  // 0x7B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_MK18_02_429_DCFC9D6F4FC58BDD27ED7AB469A3212D;  // 0x7C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_SIG_MPX_SBR_01_430_FC41D827450EBAE62DF936B3F41998EB; // 0x7D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Muz_UMP45_01_431_7CCF0E41463C617BC6459CBA3E88E22A; // 0x7E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_01_111_4F60AFF04DDDC54B44BD03BC8016D8DF;  // 0x7F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_02_302_90B0670D45225725527A84A505D969FC;  // 0x800(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_03_304_F22E062B4BE163178D789593EC14F86F;  // 0x810(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_04_306_C163BB224CFD135D59791AB1FA9A650D;  // 0x820(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_05_308_FDE492C7416B2049815FB487D756E459;  // 0x830(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Mp5_06_310_817A94784108E64D1C7F18B15147D5BC;  // 0x840(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_FNFAL_01_115_FCF467FA462490CF74EE5C8BE90AB950; // 0x850(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_FNFAL_02_284_44265A6D4BF4CD1B22A9039BBCD44D66; // 0x860(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_FNFAL_03_286_6586EEE2437D8576912C90A1C0A55CD1; // 0x870(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_FNFAL_04_288_05A794114577D8B9D6F196958EBD63A8; // 0x880(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Ar15_BufferTube_290_DCFAF1224D7C91C84E5E3EB546E446EF; // 0x890(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Ar15_Buttstock_01_292_6950BB6742052800B167B984E6266405; // 0x8A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Ar15_Buttstock_02_294_F1F3952A4EEADF81671CCB8400B916EF; // 0x8B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_M4_65_5EF00E3E4B74927D81A1D3A54ED768EF;       // 0x8C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_M4_02_296_ACF2D6F64C0793A0FA458890E869C840;   // 0x8D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Vector_66_5F4AB90047331FE40C0620B770AB4881;   // 0x8E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Sponge_67_F4EF34264FF7D544C23A679037BA4D63;   // 0x8F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_MCX_Spear_01_298_C7494A934206A096E5BADB95F13959AE; // 0x900(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_MCX_Virtus_01_300_172E70774588D16CAA4DC7B5B1AE7628; // 0x910(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_Springfield_PDW_312_C2CAED1C47D27F746BB5EBBA11886989; // 0x920(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_MK18_338_4CA9D5474BAF55819CBADF81D4D7822C;    // 0x930(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_HK_MP7_340_8C8064A24F6ABC4F6990B8B0F2E01AD3;  // 0x940(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_HK_G3_342_6A499B1044E292605C60CBA1B938532B;   // 0x950(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_HK_G36_344_FBD039084D4F604E4461F0B32256F3AD;  // 0x960(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_SIG_MPX_SBR_346_05D3D28746A9589505726EAA3254E3B0; // 0x970(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_UMP45_348_19E8F5A34F8C741A460A9AAC7E41C63E;   // 0x980(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Stok_AK203_01_538_35F3F4614CC2403A531D5CA98B776967; // 0x990(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_Ar15_01_75_885BB9AC47B7FD0C6658DC9A8E6CA3C0; // 0x9A0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_FNFAL_01_201_E9C484E0434030F397104DB6FA7855D0; // 0x9B0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_FNFAL_02_203_ECC6335D4C91DA5B124EF8937352F20E; // 0x9C0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_FNFAL_03_205_B182DE714D39889B0316B8AD172C0562; // 0x9D0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_MCX_Virtus_01_207_E65FE75940447964185045B299D33C6F; // 0x9E0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_MCX_Spear_01_209_F5A804C8497C1D41C228CFBE5BB10F7C; // 0x9F0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_AK203_506_943A90614F77B4A38975639A540274D3; // 0xA00(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_AKM_508_143DEB43427F1E9D833A02B0F015D0BA; // 0xA10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_HK_G3_510_B137D1C04F22A117F960A49DE5128B8E; // 0xA20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_M4_02_512_3AB670674C174D1C4A075D806584CF4B; // 0xA30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_MK18_514_63E010E743BEBF556EDC52B2628BE7B5; // 0xA40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_SIG_MPX_SBR_516_83DB8AC848E5F1391E0B01AE5355358A; // 0xA50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               HandGrip_Springfield_PDW_518_6632A38A4BBB281231DAD4B5930F13F1; // 0xA60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_LB_01_125_127FF04043968F939F1F46819C241CE0; // 0xA70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_LB_02_169_1B503D264F0665AE79E7AEA974B75122; // 0xA80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_MB_01_171_29391A70428AC48352D049B0641A283B; // 0xA90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_MB_02_173_AF729D654FCEF055F9CAA1BAE6BC36E3; // 0xAA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_SB_01_175_94E0907C4B4337484CA5168569604B02; // 0xAB0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Ar15_SB_02_177_756A26474CAD71A12DBB93AA88AAD1CA; // 0xAC0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Mp5_LB_01_124_B071113C4B759636DFF259BF9063DA68; // 0xAD0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Mp5_MB_01_181_8B4A776B41A0AF06F27B319DA3B3BBD4; // 0xAE0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Mp5_SB_01_183_2D03DC14498CA7AB832B2AB44AFF8134; // 0xAF0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_FNFAL_LB_01_123_64EAD2C74AB48DEEF8C90F95016B4E94; // 0xB00(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_FNFAL_MB_01_185_21B7EF134596297D50A0ACA7A27F9684; // 0xB10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_FNFAL_SB_01_187_45C57BAB4C8EDAB591FE74A5BFA23222; // 0xB20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_MCX_Spear_01_141_27D378EE4639F3A463A6E1B2AC2BC41B; // 0xB30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_MCX_Virtus_01_153_EE41ED2B4EF857931508C68DB65372F8; // 0xB40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_AK203_01_368_5AAB6D87404D6D19D84B03B4306C9D51; // 0xB50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_AKM_01_369_AE02B9604BC82FB963D86C90F526AAB8; // 0xB60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_HK_G36_L_01_370_5F423B4E403C9F899CAF0FA58CFDEDEC; // 0xB70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_HK_G36_S_01_371_92F18E754B94901D6709E2908930E9D2; // 0xB80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_HK_G3_01_372_E87A75454658CC03E476EFAF574C90C5; // 0xB90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_KrissVector_L_01_373_52088E9F4A56306A7D00FB910174C8AF; // 0xBA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_KrissVector_M_01_374_5EC0112A49BEF2E6715FCE85FD5BCD6B; // 0xBB0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_KrissVector_S_01_375_591EFE7C4FABF12A003C9D996CBE5B77; // 0xBC0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_M14_L_01_376_A9C49F8D443E77E6FB04C7803469295E; // 0xBD0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_M14_S_01_377_1E595F794D94139C519DEA92C727270A; // 0xBE0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_SIG_MPX_SBR_01_378_67DFC5D444A44441EF6CBEA27D5191CC; // 0xBF0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_Springfield_PDW_01_379_CCF8A59541BBA406EC7D5D9C437C719F; // 0xC00(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Barrel_UMP45_01_380_0354E7A54110554A0385CDBBB6974010; // 0xC10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_5_56_85_468CFCAA49CACF455E669F8D6BB406B4;   // 0xC20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_7_62_87_EFBADF1F4794B88153E4AEA4E4601C44;   // 0xC30(0x10)(Edit, BlueprintVisible)
};

}


