#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xCB (0xCB - 0x0)
// UserDefinedStruct AnaSilahWidget.AnaSilahWidget
struct FAnaSilahWidget
{
public:
	bool                                         Muz_Break_1_03AE8E18424CB2CA8D4522AAA04D2E9E;      // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Silen_3_344DB08B42BDD3C9F4B6A5905FE2FE2A;      // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Sup_B_37_685CB23D4789C668CEEB10A236E25C16;     // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_WCAr15_63_849D53D946CE5017A2A955934E4CB187;    // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SFWarComp_65_3D3CDE43428D29EB46E3E8B99381F0A2; // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_SFSocom_67_FF8230FC439B5FCCDA022A828C6A4E68;   // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Rampage4_69_640BDC4D4C88AAD8F7FE38AC03706BB8;  // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_PAM472_71_D2ED6E2E4568458384A78E8509D8AE92;    // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MultiportS_73_F755BD1C4BF7E234D5F55FA65D3643C2; // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MultiportL_75_A9DDD4F347186685AF9D7ABDC39AD773; // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Ak203_01_295_6DD4FC064CBEC1674F0338A07D4A4A6C; // 0xA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_01_297_2CC024C9491E7F60FD6697B76CA0DF41; // 0xB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_02_299_4F3977A34B3BA148859194AB74E5EE1D; // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_FNFAL_03_301_1D02F2394B377A926533359AB70C8241; // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Spear_01_303_9D0991CB437E85EDB413AFB31ACECDA5; // 0xE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Spear_02_305_8A6EE4694272A75501E14884F44AA75D; // 0xF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_MCX_Virtus_01_307_EE24411B4D6C6BA57F4EB6978CDA58FA; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_01_309_06483A524E53D5AD34BDB8A8FFD44A17;   // 0x11(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_02_311_E7CBC0CA4268F69E686DFD95EF4EE760;   // 0x12(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_03_313_9E7FFBBD45970700FA925CAC1677EADA;   // 0x13(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Muz_Mp5_04_315_D9996B224A352215E4B6488F17124687;   // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar_5_6C82658A4815CB75449BC3BD1F6E5D7A;         // 0x15(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Springfield_PDW_01_317_6FB41DE84F4DD559180927A634AE3D83; // 0x16(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_KrissVector_316_D53667D240B96C967470329C4395631D; // 0x17(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_01_142_1C963CF24DC291E12068369B8BBDE380;  // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_01_117_E25D136A4078950B546299B21EE2A7C3; // 0x19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MK18_01_319_2441F0D4491AA13746AEE6BD4D6DCF6C;  // 0x1A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_01_99_82B4D6C341F80AC0AC5D67955313081C;    // 0x1B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MCX_Spear_01_121_D21BBC79411F382494547DA4206A6196; // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_MCX_Virtus_01_133_2953A81848EAE1557A35B2B39113177E; // 0x1D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_03_141_7A78BC7A4F66782C7218E2BAD4D3CDEE;  // 0x1E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_02_144_7F6102154B80708ABEF71A9E76A5B0AD;  // 0x1F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_04_146_4BBC189E40EDDD740458859DA3CAC259;  // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ar15_05_339_2D836B68483F0EE16E3B90989BE47E48;  // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_02_148_32E353BB444AD96441034684479BC5FF; // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_03_150_65FD74D54E8D36040173C6BFDC469860; // 0x23(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_04_152_2AF6D5C84EFD990E75837DB1610ABDC3; // 0x24(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_FNFAL_05_341_E3CA858248CE4E108DC5BC8A1A41B1E8; // 0x25(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_02_154_B8CB89CA4C6174EF10958DAB10203846;   // 0x26(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_03_156_E80F38AA4DE33F14E214E38AE402B452;   // 0x27(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Mp5_04_343_073E9C2E402D033608DE60A9A04FD08E;   // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_Ak203_01_345_C0B81BCB48FB516FE64929A5C4B47BE6; // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_M4_Drum_02_377_4CFE402E4A59561C5B833E95BDE9C58D; // 0x2A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Mag_UMP45_01_379_60FA410E4B09EE1FC2F37D857B34B2C9; // 0x2B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ver_7_E2A9649949251729F9239194683C07D5;       // 0x2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ver_B_29_DECB2512481C4263ED3E05BF3076BFDF;    // 0x2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Hor_31_696CBFA6490D99A83940EC988413B229;      // 0x2E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Hor_A_35_082C7D064541BB6AEE3F1A9CA8321B66;    // 0x2F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_01_254_824F3AE74C6B5833A2F065A58406DF77; // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_02_256_D93FCA1E42C3E46B58CCBBA52E2A5150; // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Ar15_03_258_AEF1949D43BADF20EE25F5A088C10E16; // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_MCX_Virtus_01_261_051E13EA47FCF6196ABEAA9D624F4E5A; // 0x33(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_Mp_5_01_263_360607C6494730FB17E80B93549FA36D; // 0x34(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_MK18_381_C437A3A64FBF5E7AA27B0281AB4A766A;    // 0x35(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_SIG_MPX_SBR_383_55C4EC4A4E7AADFE5100D9B4EBC177DE; // 0x36(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Grip_UMP45_385_02D552264B11917F1C151FAD924B1EE0;   // 0x37(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_01_107_4BFE4EEA423DDF9D4AB98EB0748122CF;  // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_01_188_AF3E073748225820FCE996BEFA3F3B09; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_M4_138_385AEBEF49E88BBADB5C47A39F7D0D90;      // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Vector_137_CDF11AA643597D0F9A0122B1B74FBD9C;  // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Sponge_136_C641A0CF46C08A55C772F4968EAE5EBA;  // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_02_158_5A29237340C8F15A16E370BD2FCC022C;  // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_03_160_A53F52FC430BB62064F9CCBB9FACA914;  // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_04_162_DE27B8EA4ACF75D6818E06834AD2638F;  // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_05_164_74C89B444007777E84C42EA26B9E6819;  // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_Mp5_06_166_2A9E60EC463E0398C6FBC5864942EF51;  // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_02_169_DD52F3EF4D67F19014BB69B3B2F139EC; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_03_171_6BA26A2D4307F3F9897EB0836ADFE3CF; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_FNFAL_04_173_9475701242665632DCC7EEAA31A9FF16; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_AR15_BufferTube_175_245F42CF4258DA851F22249A6E5515BE; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_AR15_BottStock_01_177_DE49AD4649938841FD7579A6347C9847; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_AR15_BottStock_02_179_2CDF6EA14DBDDC05368C438368FD46D3; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_M4_02_181_F55573CE45C889EE301E75B9A9FFA69C;   // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MCX_Virtus_01_183_B8B20EAB41A7DE0199AF588AE1818F7A; // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MCX_Spear_01_185_E258EE8147940A77B563CEACD3379995; // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_SpringField_PDW_187_183679E74DCB215BAE1E3790E34DC698; // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_MK18_347_B1187BEA480586CD4D1864A0BB708AE8;    // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_UMP45_387_35B753EB47E897B8E8008BB5BDBAB3AD;   // 0x4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Stok_AK203_01_349_040580A04EE1D84F56595F834A2FC55B; // 0x4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Laser_292_4C635AD8409911CD86B4F7ABDE81987C; // 0x4F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Laser_01_293_8A96E7AE44D6C127C06856A7162B7672; // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_13_8DA9917749BF53712CCC7591043D3608;     // 0x51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Light_A_33_21C1AB844642F0353ED28FA519B5420B;   // 0x52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Peq_Laser_289_4C01CC28458FDFE6C2177EA89F619678; // 0x53(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Ar15_Light_265_C3C8C18742D55C7BADB4FB8CC53C8C0D; // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Soc_Mp5_Light_01_323_B9991476410C9C20DDA20589288A8D4C; // 0x55(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Long_01_438_0B33FB9B4B284DD866220185C7B2D123; // 0x56(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Ar_01_436_2C5832EA45EF068695618AB7D3FEE4A9; // 0x57(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_SLX3_434_0F62E4854A76C9B28CDEB1952413C5E6;    // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP7_Ironsight_F_01_325_EB51DF904511C052019FD194B703ABD1; // 0x59(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP5_Sight_02_443_0FC0FB9A466C2A301C7AECAD41751470; // 0x5A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Eotech_15_B35A38E94F7C9FD6BCAA8B9EFC01914E;   // 0x5B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Flip_39_6DF1B5D44554719206AFAD93E04E96E3;     // 0x5C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_ElcanM145_58_CD33A51D47B2218ACEF9969E99B8D6D2; // 0x5D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Reddot_A_17_1C3F4A194071F924A88A73BB32C619BC; // 0x5E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Front_Flip_A_41_BD9FF1F542B2F8B5D944CA9106329C71; // 0x5F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MK18_Sight_01_329_935ECF634A1CEA581FE473A234FF4A58; // 0x60(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_ZeniticoBelomoPK_331_0B09E59D4C278D24021A1A9EF303C3E9; // 0x61(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MP5_Sight_01_333_498FF38B49057956E6CC8AAB868C5A3C; // 0x62(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_MCX_Virtus_Sight_01_335_BE2423EA42EC4CBD56901CB9AA390E50; // 0x63(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_G36_Sight_01_444_F6D1521947FBECE025D1D4BD459DA765; // 0x64(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Ump45_Sight_01_446_F8401E4A406F2B689BD045B26E44B3EA; // 0x65(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_01_449_74E61691443D92ED3A4ADFB67A5D0594; // 0x66(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_02_451_8156DBEE4513CB6FFF653A8946F0374F; // 0x67(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Scop_Sight_Reflex_03_453_CE3F63124FD617A6FDF57F89133A6846; // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_AK203_HG_01_320_DC8865C6468C19FE7CE72197546DBEDA; // 0x69(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MK18_HG_01_321_9302822F4DEE3BD4D0E553AC5153626C; // 0x6A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_01_88_04F51FDA4670E2BA2529639F81672C07; // 0x6B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_01_97_BD543B3F4C170A9FA6E6E29BC74A0E14; // 0x6C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_01_111_B1A4CE104EFE2FF1B733F3AA7B0668BA; // 0x6D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MCX_Spear_HG_01_125_CA1BA4C14D215B85C9021E9230B4925F; // 0x6E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_MCX_Virtus_HG_01_131_FA2669934EC16D784053E29C0C3C2CFE; // 0x6F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_02_190_2A76B034410774CD9D28F7807AF9CEA6; // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_03_192_461A22464814E2DA366906A16357BD55; // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_LB_HG_04_194_5285A768413807C36B9C83A709D20B20; // 0x72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_02_196_47611ED14A13AB09E664A782312D400F; // 0x73(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_03_198_7EB6FA164E9C2A389CE4A6AF933A0FD9; // 0x74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_04_200_DE297FAF4A9269F05BA089B204629D40; // 0x75(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_05_202_1C72514F434B2E7D892EDBA575361067; // 0x76(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_M_HG_06_204_D03C914C49567109FFA14A8FC0CF053D; // 0x77(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_01_206_5C310CA8434B4E24CAE2CA8231D0425C; // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_02_208_10EF588346864B359B4870A28A26CA31; // 0x79(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Mp5_S_HG_03_210_D1E99E864601AB9A4D4E92936A3EE4BA; // 0x7A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_02_212_CB1330224D9F7E2FFE0A3C9977867784; // 0x7B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_03_214_1028918E43CD5841869DBCB7441DB7F9; // 0x7C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_FNFAL_HG_04_216_6E4AC9F84FC5693514F2F1997799862D; // 0x7D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_SB_HG_01_248_38D0BD534AEDC495193274B0F693E138; // 0x7E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Ar15_SB_HG_02_249_53E6EDF1427B5E48BB9C549E6E252584; // 0x7F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_KrissVector_HG_01_352_C854E93B433A042DC6B491B7704D4B25; // 0x80(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Springfield_PDW_HG_01_354_3554B7B64B8962455B8DE898B458CBE6; // 0x81(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_LB_01_115_27E151F4465D1472907973ADD09BD343; // 0x82(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_LB_02_271_5AA8746D46FA7C2258D760ABA877D59F; // 0x83(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_MB_01_275_77CD844E4422E1E142CB53B1A6D8D346; // 0x84(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_MB_02_273_55B5A6B94C8D029C2239258884B26AAF; // 0x85(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_SB_01_279_000ADFC54F12592E46D77FAC9B503010; // 0x86(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Ar15_SB_02_277_87CF374F463BF882BADBA7B183498B18; // 0x87(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_LB_01_114_5909824B47D5186A2763B896ECE3749E; // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_MB_01_282_B2F9DCD845FCB90DC80904BD21D3A386; // 0x89(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Mp5_SB_01_284_95AB0D9C4FB9C22ACF067BB16B0675FC; // 0x8A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNFAL_LB_01_113_700471214BFA7FB39E7C2C8FDE0D7A31; // 0x8B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNAFL_MB_01_286_721C969349C6134B535EB8A89D1F7F51; // 0x8C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_FNAFL_SB_01_288_B936CEA24F51F1FB426F7298FCE16534; // 0x8D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_MCX_Spear_01_123_CF1B06284B5E9739ED583A86F7CC1F3B; // 0x8E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_MCX_Virtus_01_129_F8E24E0C4F71F744C834B88986D2A868; // 0x8F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_AK203_01_356_E98724084583E58C3F1A14A26660D6A4; // 0x90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_L_01_358_650A86974AEDC0A877DA5EB07C9947B3; // 0x91(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_M_01_360_673C2F304021FCF782BC72BD4F451F27; // 0x92(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_KrissVector_S_01_362_2B9D4AD048241C7688C5058453DE55C8; // 0x93(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_Springfield_PDW_01_364_DAEC4D87433C7D2151CCF69566F2B8AB; // 0x94(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Barrel_UMP45_01_389_12DE03EC4E7C70D511C0F1A8010CB791; // 0x95(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_Ar15_01_79_59E82C344AD778D84B51B9A3DA62A13C; // 0x96(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_Springfield_PDW_224_CCA9715C45DB74187B1445A9AE2F053C; // 0x97(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MCX_Virtus_226_A18C7A4D478B875F280497A99072CA86; // 0x98(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MCX_Spear_228_4DFE0423444D8E26D08835A6A0E5BB33; // 0x99(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_M4_391_2929B67D4E54A73B7E447EB39EC55DA1;  // 0x9A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_M4_02_393_1ACA60E44976FDE109D6C581B6F19AFC; // 0x9B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_MK18_395_1ABA4F404F04AA3CB29614B4F80E10E2; // 0x9C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Charging_KrissVector_397_C82F7855463E301B70E1759279E2B0CC; // 0x9D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Ar15_01_81_4ED7715240D314BCC4313A878F890D93; // 0x9E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_FNFAL_01_222_BBC0B20247AB07026F7B2F8DAE9FE6B9; // 0x9F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MCX_Spear_01_231_64B4DB8548329626B3D9F5800A1EFDE3; // 0xA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MCX_Virtus_01_234_0A1772134763421E658BB89EF49D41F4; // 0xA1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Mp5_01_280_93BBE30D4870D7CA5021F196FE30CD37; // 0xA2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_AK203_366_8E91BFC1450BABA78D7599998C08E5FD; // 0xA3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_KrissVector_368_3E2A46C34C6E11DBB3B4189350880E44; // 0xA4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_M4_02_370_E531B3734177F5D27B022EA034FAFC0D; // 0xA5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_MK18_399_EBEBF9E0471003FDF70DEEBBE6B83745; // 0xA6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_Springfield_PDW_372_80DCF45541414CBC3CD89C83C09BE1DA; // 0xA7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Trigger_UMP45_374_E32B2DC4473253ADC1F84B8A5254045A; // 0xA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_Ar15_01_83_8D8CABAA4D1B7BC7216DABB23A27BCF5; // 0xA9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_01_238_2C49E68042A1CBC284D2A496225C328A; // 0xAA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_02_240_C6C748BA4F40820FB1370786DEF7DB2C; // 0xAB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_FNFAL_03_242_3AF1BC674CB2A84573635CAB38C370D2; // 0xAC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MCX_Virtus_01_247_BA6E57C345893F08A29F3AAB94861695; // 0xAD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MCX_Spear_01_245_EB2EF7474377378B35A74A9FC16B0F52; // 0xAE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_AK203_401_8D5343CC4E6E60C3BB1B9A961E9019C7; // 0xAF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_M4_02_403_FF41ADB54C75A0F62124F086877F78B5; // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_MK18_405_F5F7949F419DAD92A8DC8786FC8D27BF; // 0xB1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HandGrip_Springfield_PDW_407_075EF8214CD710A39F40EDB506416D2B; // 0xB2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Ar15_86_E4866C83481CBCB8857AF8BAC98853DE; // 0xB3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_M4_101_59D3322D45DB46DCE87A1CAF7AE294BF;  // 0xB4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_FNFAL_105_8872DE9B41E6BD5440E802B5762587F7; // 0xB5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_FNFAL_02_426_3BD785D5403FF803D909368E778B1BA5; // 0xB6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_MCX_Spear_119_D44A14B44C69ABE0CB6A7D8C7427A11C; // 0xB7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_MCX_Virtus_127_315CDA214A8E04968950E8B1CA82156A; // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Springfield_PDW_135_0E4F82D04224B67068AF4FA4CF4BD2D6; // 0xB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_AK203_413_25D808024D073361853012AA994A4174; // 0xBA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_MK18_412_E075A33349619F8659781AA2F4CA844C; // 0xBB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Mp5_103_15449B4D4CA20A1BACD73E9E5A9AA336; // 0xBC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Mp5_01_428_C25D1FCB4AC14A397535B6BBA68BD81B; // 0xBD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Mp5_03_430_956839674419ED3CED41CAA28ECB737A; // 0xBE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_Mp5_04_432_10002AA044F1B209886ECA9BE23036C6; // 0xBF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_KrissVector_414_048D56E5427800CE716ED3814C580FC1; // 0xC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reciever_UMP45_418_12CC4FA1483724EE87E9F79B46470168; // 0xC1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_5_56_90_D236DD314646CA018B43B9ACF85A5FF0;   // 0xC2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_5_56_Red_440_CB266B9240ECE0C81D143C8E18F52F5C; // 0xC3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_422_F38630AF49E99C62E0DBA8899ADD91BC;  // 0xC4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_Red_442_F5CF29D14B09FDBB87238B9A3C4AA4A7; // 0xC5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_10m_423_64EC4C3A438BA702E4D10EB64BA7F237;   // 0xC6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_9m_424_6AED16474BC3EADB6252A4A0D8202132;    // 0xC7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_39_455_61F7226D44C02BEDBC942490FF57CBD5; // 0xC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bullet_7_62_39_Red_457_9EB5E78F4796EA6DCAB0F59402C1F417; // 0xC9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Rail_Picatinny_45_92_6B669AF94CE8F3B7C40CA9837095F711; // 0xCA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


