#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x120 (0x120 - 0x0)
// UserDefinedStruct AnaSilahStatlari_1.AnaSilahStatlari_1
struct FAnaSilahStatlari_1
{
public:
	TArray<double>                               Ar_FNFAL_02_107_EC6695BC4A116D2FAEB646A8E0361771;  // 0x0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_Mp5_01_112_3B8A43424C3D1C00E7657991EF7DE3AF;   // 0x10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_Mp5_03_114_3BB86C9144805BF66E42E290CCCC72B9;   // 0x20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smg_Mp5_04_116_A2A03A9342D89D88329D7FAD536ACB31;   // 0x30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Sight_Long_01_137_0EFB27974A26E7AD486C1696BC5C5794; // 0x40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Sight_Ar_01_132_8EF16B36471154795A85A1B6A4BE997E; // 0x50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_SLX3_128_BF0EAEBB40007CCFFDA330B2F5BBCEC9;    // 0x60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_ElcanM145_135_F3C21D7E4736CD2FCFEB77A7351C61A3; // 0x70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Ump45_Sight_01_147_8A0548D14DD50159995168998CF58D7D; // 0x80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Sight_Reflex_01_149_DF37824E45D6567234496EBAD00B283F; // 0x90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Sight_Reflex_02_151_7B956B574A7FDC065BE335B44573A6DE; // 0xA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Scop_Sight_Reflex_03_153_3D6C1D8E490A273FAC95FEBE44657B2B; // 0xB0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_9mm_122_FD0A0AB94B7861D63159A9B6F4A51F8B;   // 0xC0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_10mm_124_6526050847E273D455731DA10467DB13;  // 0xD0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_5_56_Red_141_101E8D0141EFAA23D770219BF6BAF236; // 0xE0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_7_62_Red_143_56F35D054B94937E69EBC89EBDDD0080; // 0xF0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_7_62_39_157_92BDC98B428271EC93417887B7C394AF; // 0x100(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Bullet_7_62_39_Red_159_1109D83948401757A17040B178E60AD2; // 0x110(0x10)(Edit, BlueprintVisible)
};

}


