#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x80 - 0x0)
// UserDefinedStruct AnaSilah.AnaSilah
struct FAnaSilah
{
public:
	double                                       Color_26_20B6977040D7D685122B6895EDFF57BB;         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Damage_56_477F21C840A8112925E9D9A039FFC754;        // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FireRate_54_D46056B749334F63B57910A20A5670B8;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MoveSpeed_30_6CE5FAEC4DD378DC7747DC9E158795D2;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HorizontalRecoil_34_ACFA5245491C10E6FD8658A972F3D004; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VerticalRecoil_36_B9FBC3584A61855F4B65068E28D82606; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SwitchOpticSpeed_44_4CA5AE3F44E2415EAB25FEA3F1F056B3; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gravity_38_0F2B49434F29455361B872B94CAC98AC;       // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Acuracy_40_AF03A322425F8CE4F857BCB111F255E8;       // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ADSSpeed_42_D9E2378D4128205E133135A70CD71B77;      // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EqUnEqSpeed_46_3001DE1242A3278FE03025BE410BF1AA;   // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReloadSpeed_48_38DFCFB946A95038AE999487E92EC168;   // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Velocity_51_0702972A442121FC9B138CB2C5F1AD0B;      // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoundDistance_65_A8524A4A44890B74EFE43C8403ADE5B1; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_M4_27_145517054F110B0A1D8AA399DD4E44ED;         // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_Ar15_5_DCB6FA5546CFF88A4C4FA882C6AFC87B;        // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_FNFAL_57_86646C684FC311EF91CED98EA4E10FE2;      // 0x72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_FNFAL_02_82_877D3BD54D656932A9AC2A866A13AB1D;   // 0x73(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_MCX_Spear_58_74DE2918432C161D94F80BA421981F1C;  // 0x74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_MCX_Virtus_60_BBDDBA2C423BA2033B1C64B72B080157; // 0x75(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_Springfield_PDW_62_A6817B424EFEBBC408DC89B9D993120F; // 0x76(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_AK203_67_92F5E01A4D3BBE5EEB66B88D0237EAFD;      // 0x77(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_AKM_69_5FF2FDC54C405D60D80206BCBBCA7D9F;        // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ar_MK18_72_180F96454969AE32F7AA47A562E82ECD;       // 0x79(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_Mp5_11_0FF887744EE7F0970509E8825CC023AE;       // 0x7A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_Mp5_01_76_BE2C45FE4E18ABE5E08514BB0333E59E;    // 0x7B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_Mp5_03_78_EF300D2243B4A5B59CB92D80B2FF5F0B;    // 0x7C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_Mp5_04_80_20F8ED924F30F69AA4505F8D3CCA2128;    // 0x7D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_KrissVector_71_CA501CCA4C0BB43252BB659CE9E2FFEB; // 0x7E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smg_UMP45_75_DFF25F924A7B88BEC93BD58FC117CB38;     // 0x7F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


