#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD8 (0x368 - 0x290)
// BlueprintGeneratedClass BP_FirstAidKit3_01.BP_FirstAidKit3_01_C
class UBP_FirstAidKit3_01_C : public UActor
{
public:
	class UBillboardComponent*                   Billboard;                                         // 0x290(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent020;                            // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent019;                            // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent018;                            // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent017;                            // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent016;                            // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent015;                            // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent014;                            // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent013;                            // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent012;                            // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent011;                            // 0x2E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent010;                            // 0x2E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent09;                             // 0x2F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent08;                             // 0x2F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent07;                             // 0x300(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent06;                             // 0x308(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent05;                             // 0x310(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent04;                             // 0x318(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent03;                             // 0x320(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent02;                             // 0x328(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent01;                             // 0x330(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent0;                              // 0x338(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       SharedRoot;                                        // 0x340(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                         Energy_Syringe_1_Visible;                          // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Health_Syringe_Visible;                            // 0x349(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Energy_Syringe_2_Visible;                          // 0x34A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aid_Package_1_Visible;                             // 0x34B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AidPackage_2_Visible;                              // 0x34C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Painkiller_1_Visible;                              // 0x34D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Painkiller_2_Visible;                              // 0x34E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_1_Visible;                                   // 0x34F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_2_Visible;                                   // 0x350(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_3_Visible;                                   // 0x351(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_4_Visible;                                   // 0x352(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_5_Visible;                                   // 0x353(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_6_Visible;                                   // 0x354(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_7_Visible;                                   // 0x355(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Gauze_Bandage_Visible;                             // 0x356(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Gauze_Bandage_2_Visible;                           // 0x357(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Packed_Bandage_Visible;                            // 0x358(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aid_Pot_1_Visible;                                 // 0x359(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aid_Pot_2_Visible;                                 // 0x35A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Energy_Pot_Visible;                                // 0x35B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_976[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Draw_Distance__0_Minus_Infinity_;                  // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_FirstAidKit3_01_C* GetDefaultObj();

	void UserConstructionScript(enum class ECollisionEnabled Temp_byte_Variable, enum class ECollisionEnabled Temp_byte_Variable_1, bool Temp_bool_Variable, enum class ECollisionEnabled Temp_byte_Variable_2, enum class ECollisionEnabled Temp_byte_Variable_3, bool Temp_bool_Variable_1, enum class ECollisionEnabled Temp_byte_Variable_4, enum class ECollisionEnabled Temp_byte_Variable_5, bool Temp_bool_Variable_2, enum class ECollisionEnabled Temp_byte_Variable_6, enum class ECollisionEnabled Temp_byte_Variable_7, bool Temp_bool_Variable_3, enum class ECollisionEnabled Temp_byte_Variable_8, enum class ECollisionEnabled Temp_byte_Variable_9, bool Temp_bool_Variable_4, enum class ECollisionEnabled Temp_byte_Variable_10, enum class ECollisionEnabled Temp_byte_Variable_11, bool Temp_bool_Variable_5, enum class ECollisionEnabled Temp_byte_Variable_12, enum class ECollisionEnabled Temp_byte_Variable_13, bool Temp_bool_Variable_6, enum class ECollisionEnabled Temp_byte_Variable_14, bool Temp_bool_Variable_7, enum class ECollisionEnabled Temp_byte_Variable_15, bool Temp_bool_Variable_8, enum class ECollisionEnabled Temp_byte_Variable_16, enum class ECollisionEnabled Temp_byte_Variable_17, enum class ECollisionEnabled Temp_byte_Variable_18, enum class ECollisionEnabled Temp_byte_Variable_19, bool Temp_bool_Variable_9, enum class ECollisionEnabled Temp_byte_Variable_20, enum class ECollisionEnabled Temp_byte_Variable_21, bool Temp_bool_Variable_10, bool Temp_bool_Variable_11, enum class ECollisionEnabled Temp_byte_Variable_22, enum class ECollisionEnabled Temp_byte_Variable_23, bool Temp_bool_Variable_12, enum class ECollisionEnabled Temp_byte_Variable_24, enum class ECollisionEnabled Temp_byte_Variable_25, enum class ECollisionEnabled Temp_byte_Variable_26, bool Temp_bool_Variable_13, enum class ECollisionEnabled Temp_byte_Variable_27, enum class ECollisionEnabled Temp_byte_Variable_28, enum class ECollisionEnabled Temp_byte_Variable_29, bool Temp_bool_Variable_14, bool Temp_bool_Variable_15, enum class ECollisionEnabled Temp_byte_Variable_30, enum class ECollisionEnabled Temp_byte_Variable_31, bool Temp_bool_Variable_16, enum class ECollisionEnabled Temp_byte_Variable_32, enum class ECollisionEnabled Temp_byte_Variable_33, enum class ECollisionEnabled Temp_byte_Variable_34, bool Temp_bool_Variable_17, enum class ECollisionEnabled Temp_byte_Variable_35, enum class ECollisionEnabled Temp_byte_Variable_36, enum class ECollisionEnabled Temp_byte_Variable_37, enum class ECollisionEnabled K2Node_Select_Default, enum class ECollisionEnabled K2Node_Select_Default_1, enum class ECollisionEnabled K2Node_Select_Default_2, enum class ECollisionEnabled K2Node_Select_Default_3, enum class ECollisionEnabled K2Node_Select_Default_4, enum class ECollisionEnabled K2Node_Select_Default_5, enum class ECollisionEnabled K2Node_Select_Default_6, enum class ECollisionEnabled K2Node_Select_Default_7, enum class ECollisionEnabled K2Node_Select_Default_8, enum class ECollisionEnabled K2Node_Select_Default_9, enum class ECollisionEnabled K2Node_Select_Default_10, enum class ECollisionEnabled K2Node_Select_Default_11, enum class ECollisionEnabled K2Node_Select_Default_12, enum class ECollisionEnabled K2Node_Select_Default_13, enum class ECollisionEnabled K2Node_Select_Default_14, enum class ECollisionEnabled K2Node_Select_Default_15, enum class ECollisionEnabled K2Node_Select_Default_16, bool Temp_bool_Variable_18, enum class ECollisionEnabled K2Node_Select_Default_17, enum class ECollisionEnabled Temp_byte_Variable_38, bool Temp_bool_Variable_19, enum class ECollisionEnabled K2Node_Select_Default_18, enum class ECollisionEnabled Temp_byte_Variable_39, enum class ECollisionEnabled K2Node_Select_Default_19, float CallFunc_SetCullDistance_NewCullDistance_ImplicitCast);
};

}


