#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x60 (0x2F0 - 0x290)
// BlueprintGeneratedClass BP_FirstAidKit3_03.BP_FirstAidKit3_03_C
class UBP_FirstAidKit3_03_C : public UActor
{
public:
	class UBillboardComponent*                   Billboard;                                         // 0x290(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent07;                             // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent06;                             // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent05;                             // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent04;                             // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent03;                             // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent02;                             // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent01;                             // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StaticMeshComponent0;                              // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       SharedRoot;                                        // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                         Aid_Package_Visible;                               // 0x2E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Gauze_Bandage_Visible;                             // 0x2E1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Packed_Bandage_Visible;                            // 0x2E2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Health_Syringe_Visible;                            // 0x2E3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Painkiller_Box_Visible;                            // 0x2E4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_1_Visible;                                   // 0x2E5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pills_2_Visible;                                   // 0x2E6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4346[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Draw_Distance__0_Minus_Infinity_;                  // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_FirstAidKit3_03_C* GetDefaultObj();

	void UserConstructionScript(enum class ECollisionEnabled Temp_byte_Variable, bool Temp_bool_Variable, enum class ECollisionEnabled Temp_byte_Variable_1, enum class ECollisionEnabled Temp_byte_Variable_2, bool Temp_bool_Variable_1, enum class ECollisionEnabled Temp_byte_Variable_3, enum class ECollisionEnabled Temp_byte_Variable_4, enum class ECollisionEnabled Temp_byte_Variable_5, bool Temp_bool_Variable_2, enum class ECollisionEnabled Temp_byte_Variable_6, enum class ECollisionEnabled Temp_byte_Variable_7, enum class ECollisionEnabled Temp_byte_Variable_8, bool Temp_bool_Variable_3, enum class ECollisionEnabled Temp_byte_Variable_9, enum class ECollisionEnabled Temp_byte_Variable_10, enum class ECollisionEnabled Temp_byte_Variable_11, bool Temp_bool_Variable_4, bool Temp_bool_Variable_5, enum class ECollisionEnabled Temp_byte_Variable_12, enum class ECollisionEnabled K2Node_Select_Default, enum class ECollisionEnabled K2Node_Select_Default_1, enum class ECollisionEnabled K2Node_Select_Default_2, enum class ECollisionEnabled K2Node_Select_Default_3, enum class ECollisionEnabled K2Node_Select_Default_4, enum class ECollisionEnabled K2Node_Select_Default_5, enum class ECollisionEnabled Temp_byte_Variable_13, bool Temp_bool_Variable_6, enum class ECollisionEnabled K2Node_Select_Default_6, float CallFunc_SetCullDistance_NewCullDistance_ImplicitCast);
};

}


