#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x88 (0x6A0 - 0x618)
// BlueprintGeneratedClass BP_ThirdPersonCharacter.BP_ThirdPersonCharacter_C
class UBP_ThirdPersonCharacter_C : public UCharacter
{
public:
	uint8                                        Pad_2BD9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x620(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                       SC_Shoot;                                          // 0x628(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                Weapon;                                            // 0x630(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                      PlayerCamera;                                      // 0x638(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                   CameraBoom;                                        // 0x640(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_1_Arm_Length_826362CF43A39B526CF4A5A5C0DAF97F; // 0x648(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_1__Direction_826362CF43A39B526CF4A5A5C0DAF97F; // 0x64C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_1;                                        // 0x650(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_Field_Of_View_1859268F42F5811EDE1105BEC885746E; // 0x658(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_0__Direction_1859268F42F5811EDE1105BEC885746E; // 0x65C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_0;                                        // 0x660(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         Sprinting;                                         // 0x668(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aiming_Down_Sight;                                 // 0x669(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Health;                                            // 0x670(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RenderSetting;                                     // 0x678(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnemiesClose;                                      // 0x67C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Combat;                                            // 0x67D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Dead;                                              // 0x67E(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDD[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Location;                                          // 0x680(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       ShootSound;                                        // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         PlaceCheck;                                        // 0x690(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2BDF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UB_DemoCharacter_C*                    Player_Character;                                  // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_ThirdPersonCharacter_C* GetDefaultObj();

	class UBP_ThirdPersonCharacter_C* SpawnANewPlayerCharacter(TArray<class UBP_PlayerRespawn_Point_C*>& CallFunc_GetAllActorsOfClass_OutActors, class UBP_PlayerRespawn_Point_C* CallFunc_Array_Get_Item, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation, bool CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, class UBP_ThirdPersonCharacter_C* CallFunc_FinishSpawningActor_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, class UBP_PlayerRespawn_Point_C* CallFunc_Array_Get_Item_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, const struct FRotator& CallFunc_K2_GetComponentRotation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class UActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class UBP_ThirdPersonCharacter_C* CallFunc_FinishSpawningActor_ReturnValue_1);
	void ChangeRenderQuality(bool CallFunc_EqualEqual_IntInt_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess, int32 CallFunc_Add_IntInt_ReturnValue);
	void Shoot_ParticlePlusSound(class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue);
	void AlarmEnemies(const struct FVector& ScanLocation, double SphereRadius, int32 Temp_int_Array_Index_Variable, TArray<class UActor*>& Temp_object_Variable, int32 Temp_int_Loop_Counter_Variable, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, TArray<class UActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UActor* CallFunc_Array_Get_Item, class UBP_Ai_Demo_C* K2Node_DynamicCast_AsBP_Ai_Demo, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, float CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void InpActEvt_Two_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_U_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_Q_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_Jump_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_Jump_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_C_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void CheckCombat();
	void InpAxisEvt_MoveForward_K2Node_InputAxisEvent_180(float AxisValue);
	void InpAxisEvt_MoveRight_K2Node_InputAxisEvent_243(float AxisValue);
	void InpAxisEvt_Turn_K2Node_InputAxisEvent_256(float AxisValue);
	void InpAxisEvt_LookUp_K2Node_InputAxisEvent_268(float AxisValue);
	void ServerUpdateMovementSpeed(double MaxWalkSpeed);
	void ServerAimDownSight(bool Aiming_Down_Sight);
	void MulticastAimDownSight(bool Aiming_Down_Sight);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class UController* InstigatedBy, class UActor* DamageCauser, struct FHitResult& HitInfo);
	void ShootEffectsOnServer(struct FHitResult& Hit);
	void ShootEffectMulticast(struct FHitResult& Hit);
	void MultiCastDeath();
	void MulticastShootEffects();
	void ServerShootEffects();
	void ServerWarnAI(const struct FVector& ScanLocation, double SphereRadius);
	void MultiUpdateMovementSpeed(double MaxWalkSpeed);
	void LocalUpdateAudioManagerReference();
	void RespawnBeginPlay();
	void ExecuteUbergraph_BP_ThirdPersonCharacter(int32 EntryPoint, const struct FKey& K2Node_InputKeyEvent_Key, const struct FKey& Temp_struct_Variable, double CallFunc_Lerp_ReturnValue, double CallFunc_Lerp_ReturnValue_1, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FKey& K2Node_InputKeyEvent_Key_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable, bool Temp_bool_IsClosed_Variable, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Array_Index_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<class UActor*>& Temp_object_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FKey& K2Node_InputKeyEvent_Key_6, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, TArray<class UActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, TArray<class UActor*>& Temp_object_Variable_1, const struct FKey& K2Node_InputKeyEvent_Key_2, bool Temp_bool_Has_Been_Initd_Variable_1, TArray<class UActor*>& CallFunc_GetAllActorsWithInterface_OutActors, class UActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, TScriptInterface<class UBPI_AudioManager_C> K2Node_DynamicCast_AsBPI_Audio_Manager, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FKey& K2Node_InputKeyEvent_Key_7, TArray<class UActor*>& CallFunc_GetAllActorsWithInterface_OutActors_1, const struct FKey& K2Node_InputKeyEvent_Key_8, class UActor* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_2, TScriptInterface<class UBPI_AudioManager_C> K2Node_DynamicCast_AsBPI_Audio_Manager_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_IsLocallyControlled_ReturnValue, float K2Node_InputAxisEvent_AxisValue_3, const struct FRotator& CallFunc_GetControlRotation_ReturnValue, float K2Node_InputAxisEvent_AxisValue_2, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float K2Node_InputAxisEvent_AxisValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_GetRightVector_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, float K2Node_InputAxisEvent_AxisValue, const struct FKey& Temp_struct_Variable_1, const struct FKey& K2Node_InputKeyEvent_Key_3, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, const struct FVector& CallFunc_GetForwardVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class UActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const struct FKey& K2Node_InputKeyEvent_Key_4, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_2, double K2Node_CustomEvent_MaxWalkSpeed_1, bool Temp_bool_IsClosed_Variable_1, bool K2Node_CustomEvent_Aiming_Down_Sight_1, bool K2Node_CustomEvent_Aiming_Down_Sight, float K2Node_Event_Damage, class UDamageType* K2Node_Event_DamageType, const struct FVector& K2Node_Event_HitLocation, const struct FVector& K2Node_Event_HitNormal, class UPrimitiveComponent* K2Node_Event_HitComponent, class FName K2Node_Event_BoneName, const struct FVector& K2Node_Event_ShotFromDirection, class UController* K2Node_Event_InstigatedBy, class UActor* K2Node_Event_DamageCauser, const struct FHitResult& K2Node_Event_HitInfo, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FHitResult& K2Node_CustomEvent_Hit_1, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class UActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, class FName CallFunc_BreakHitResult_BoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, const struct FHitResult& K2Node_CustomEvent_Hit, bool CallFunc_BreakHitResult_bBlockingHit_2, bool CallFunc_BreakHitResult_bInitialOverlap_2, float CallFunc_BreakHitResult_Time_2, float CallFunc_BreakHitResult_Distance_2, const struct FVector& CallFunc_BreakHitResult_Location_2, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_2, const struct FVector& CallFunc_BreakHitResult_Normal_2, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_2, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2, class UActor* CallFunc_BreakHitResult_HitActor_2, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2, class FName CallFunc_BreakHitResult_HitBoneName_2, class FName CallFunc_BreakHitResult_BoneName_2, int32 CallFunc_BreakHitResult_HitItem_2, int32 CallFunc_BreakHitResult_ElementIndex_2, int32 CallFunc_BreakHitResult_FaceIndex_2, const struct FVector& CallFunc_BreakHitResult_TraceStart_2, const struct FVector& CallFunc_BreakHitResult_TraceEnd_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, const struct FVector& K2Node_CustomEvent_ScanLocation, double K2Node_CustomEvent_SphereRadius, class UController* CallFunc_GetController_ReturnValue, double K2Node_CustomEvent_MaxWalkSpeed, bool Temp_bool_True_if_break_was_hit_Variable, class UBP_ThirdPersonCharacter_C* CallFunc_SpawnANewPlayerCharacter_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue, float CallFunc_ApplyPointDamage_ReturnValue, TArray<class UActor*>& CallFunc_GetAllActorsWithInterface_OutActors_2, const struct FKey& K2Node_InputKeyEvent_Key_5, class UActor* CallFunc_Array_Get_Item_2, class UBP_Audio_Manager_C* K2Node_DynamicCast_AsBP_Audio_Manager, bool K2Node_DynamicCast_bSuccess_2, const struct FKey& Temp_struct_Variable_2, const struct FKey& K2Node_InputActionEvent_Key, const struct FKey& K2Node_InputActionEvent_Key_1, bool Temp_bool_Has_Been_Initd_Variable_2, bool Temp_bool_IsClosed_Variable_2, int32 Temp_int_Array_Index_Variable_2, class UActor* CallFunc_Array_Get_Item_3, class UBP_Ai_Demo_C* K2Node_DynamicCast_AsBP_Ai_Demo, bool K2Node_DynamicCast_bSuccess_3, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_SetFieldOfView_InFieldOfView_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast_1, float K2Node_VariableSet_TargetArmLength_ImplicitCast, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast, float K2Node_VariableSet_MaxWalkSpeed_ImplicitCast, float CallFunc_ApplyPointDamage_BaseDamage_ImplicitCast);
};

}


