#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x180 (0x180 - 0x0)
// Function CharacterStat.CharacterStat_C.Stat
struct UCharacterStat_C_Stat_Params
{
public:
	bool                                         Heavy0;                                            // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  HeavyText;                                         // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         Resistance1;                                       // 0x20(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ResistanceText;                                    // 0x28(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         Protection2;                                       // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ProtectionText;                                    // 0x48(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         Magazine3;                                         // 0x60(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  MagazineText;                                      // 0x68(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         StimPack4;                                         // 0x80(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  StimPackText;                                      // 0x88(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<bool>                                 Renkler;                                           // 0xA0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0xB0(0x14)(None)
	bool                                         CallFunc_Array_Get_Item;                           // 0xC4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Array_Get_Item_1;                         // 0xC5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Array_Get_Item_2;                         // 0xC6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Array_Get_Item_3;                         // 0xC7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Array_Get_Item_4;                         // 0xC8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_366F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_1;                    // 0xCC(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_2;                    // 0xE0(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_3;                    // 0xF4(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_4;                    // 0x108(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_5;                    // 0x11C(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_6;                    // 0x130(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_7;                    // 0x144(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_8;                    // 0x158(0x14)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_9;                    // 0x16C(0x14)(None)
};

}
}


