#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xEC8 (0x1140 - 0x278)
// WidgetBlueprintGeneratedClass CharacterPreSet.CharacterPreSet_C
class UCharacterPreSet_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                               Button_4;                                          // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_5;                                          // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_6;                                          // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_7;                                          // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_8;                                          // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_9;                                          // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_10;                                         // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_11;                                         // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_12;                                         // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_13;                                         // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_14;                                         // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_15;                                         // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_16;                                         // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_17;                                         // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button_118;                                        // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_0;                                     // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_78;                                    // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image;                                             // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                             Throbber_0;                                        // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         AlphaAktif;                                        // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BetaAktif;                                         // 0x319(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CharlieAktif;                                      // 0x31A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DeltaAktif;                                        // 0x31B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EchoAktif;                                         // 0x31C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1442[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnaSilahStatlari                     AnaSilahStatlari;                                  // 0x320(0xC40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FAnaSilahStatlari_1                   AnaSilahStatlari_1;                                // 0xF60(0x120)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FAltSilahStatlari                     AltSilahStatlari;                                  // 0x1080(0xC0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCharacterPreSet_C* GetDefaultObj();

	void Completed_DE44384A4A58FB97577D1A9E52ABAFCF(class USaveGame* SaveGame, bool bSuccess);
	void Completed_4BDC3CC14FA7431E7074B0859BE05FB4(class USaveGame* SaveGame, bool bSuccess);
	void Completed_6174A9504D698F4B47AFF9BE995FE67F(class USaveGame* SaveGame, bool bSuccess);
	void Completed_B543D7384B0D90F1756282A7E68E53A2(class USaveGame* SaveGame, bool bSuccess);
	void Completed_DBB2518A4FF4D4650FB5DEA7161C02F3(class USaveGame* SaveGame, bool bSuccess);
	void Completed_5D64E962475D9F8635896492C0363730(class USaveGame* SaveGame, bool bSuccess);
	void Completed_825AC52D408E2C95B0C76EAA27DFCBFF(class USaveGame* SaveGame, bool bSuccess);
	void Completed_87452A0E442A89C09D8C419A12D3CF44(class USaveGame* SaveGame, bool bSuccess);
	void Completed_C25DDCA54FD1B3A4A18AEC89AD16449B(class USaveGame* SaveGame, bool bSuccess);
	void Completed_0139258D455ED0DE9DE334A422E8D544(class USaveGame* SaveGame, bool bSuccess);
	void Completed_F8E6C67B484B04B6C8DBAE92B474571A(class USaveGame* SaveGame, bool bSuccess);
	void Completed_893361E54FF37D2966B0D7869E502884(class USaveGame* SaveGame, bool bSuccess);
	void Completed_C02CDF854D0A54E80B5C7AA8EAAC6DA1(class USaveGame* SaveGame, bool bSuccess);
	void Completed_A22B4AA54E1FF3E948C352803918C321(class USaveGame* SaveGame, bool bSuccess);
	void Completed_EB15226B4BE4636A7A3D8C8241D9550C(class USaveGame* SaveGame, bool bSuccess);
	void Completed_02E7E37541C407251C4ED8AEA2407E6C(class USaveGame* SaveGame, bool bSuccess);
	void Completed_1334D2664D341038444D82AA57E3FC0D(class USaveGame* SaveGame, bool bSuccess);
	void Completed_48FE5209463D57B0F79E8C8778454EBB(class USaveGame* SaveGame, bool bSuccess);
	void Completed_C9C9092A493373482B716FB9378EF38A(class USaveGame* SaveGame, bool bSuccess);
	void Completed_FB99E8EC44A55B2013B25C8B58A7910B(class USaveGame* SaveGame, bool bSuccess);
	void BndEvt__SilahPreSet_Button_4_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__SilahPreSet_Button_118_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_5_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_6_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_7_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_8_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_9_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_10_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_11_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_12_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_13_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_14_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_15_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_16_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SilahPreSet_Button_17_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_CharacterPreSet(int32 EntryPoint, class USaveGame* K2Node_CustomEvent_SaveGame_14, bool K2Node_CustomEvent_bSuccess_14, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Variable, class USaveGame* Temp_object_Variable, class UCharacter_Charlie_C* K2Node_DynamicCast_AsCharacter_Charlie, bool K2Node_DynamicCast_bSuccess, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class USaveGame* K2Node_CustomEvent_SaveGame_13, bool K2Node_CustomEvent_bSuccess_13, bool Temp_bool_Variable_1, class USaveGame* Temp_object_Variable_1, class UCharacter_Delta_C* K2Node_DynamicCast_AsCharacter_Delta, bool K2Node_DynamicCast_bSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class USaveGame* K2Node_CustomEvent_SaveGame_12, bool K2Node_CustomEvent_bSuccess_12, bool Temp_bool_Variable_2, class USaveGame* Temp_object_Variable_2, class UCharacter_Echo_C* K2Node_DynamicCast_AsCharacter_Echo, bool K2Node_DynamicCast_bSuccess_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class USaveGame* K2Node_CustomEvent_SaveGame_11, bool K2Node_CustomEvent_bSuccess_11, bool Temp_bool_Variable_3, class USaveGame* Temp_object_Variable_3, class UCharacter_Beta_C* K2Node_DynamicCast_AsCharacter_Beta, bool K2Node_DynamicCast_bSuccess_3, class USaveGame* K2Node_CustomEvent_SaveGame_10, bool K2Node_CustomEvent_bSuccess_10, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, bool Temp_bool_Variable_4, class USaveGame* Temp_object_Variable_4, class USaveGame* K2Node_CustomEvent_SaveGame_9, bool K2Node_CustomEvent_bSuccess_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, bool Temp_bool_Variable_5, class USaveGame* Temp_object_Variable_5, class USaveGame* K2Node_CustomEvent_SaveGame_8, bool K2Node_CustomEvent_bSuccess_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, bool Temp_bool_Variable_6, class USaveGame* Temp_object_Variable_6, class UCharacter_Charlie_C* K2Node_DynamicCast_AsCharacter_Charlie_1, bool K2Node_DynamicCast_bSuccess_4, class USaveGame* K2Node_CustomEvent_SaveGame_7, bool K2Node_CustomEvent_bSuccess_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, bool Temp_bool_Variable_7, class USaveGame* Temp_object_Variable_7, class USaveGame* K2Node_CustomEvent_SaveGame_6, bool K2Node_CustomEvent_bSuccess_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, bool Temp_bool_Variable_8, class USaveGame* Temp_object_Variable_8, class USaveGame* K2Node_CustomEvent_SaveGame_5, bool K2Node_CustomEvent_bSuccess_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, bool Temp_bool_Variable_9, class USaveGame* Temp_object_Variable_9, class UCharacter_Delta_C* K2Node_DynamicCast_AsCharacter_Delta_1, bool K2Node_DynamicCast_bSuccess_5, class USaveGame* K2Node_CustomEvent_SaveGame_4, bool K2Node_CustomEvent_bSuccess_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, bool Temp_bool_Variable_10, class USaveGame* Temp_object_Variable_10, class USaveGame* K2Node_CustomEvent_SaveGame_3, bool K2Node_CustomEvent_bSuccess_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, bool Temp_bool_Variable_11, class USaveGame* Temp_object_Variable_11, class USaveGame* K2Node_CustomEvent_SaveGame_2, bool K2Node_CustomEvent_bSuccess_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, bool Temp_bool_Variable_12, class USaveGame* Temp_object_Variable_12, class UCharacter_Echo_C* K2Node_DynamicCast_AsCharacter_Echo_1, bool K2Node_DynamicCast_bSuccess_6, class USaveGame* K2Node_CustomEvent_SaveGame_1, bool K2Node_CustomEvent_bSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, bool Temp_bool_Variable_13, class USaveGame* Temp_object_Variable_13, class USaveGame* K2Node_CustomEvent_SaveGame, bool K2Node_CustomEvent_bSuccess, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, bool Temp_bool_Variable_14, class USaveGame* Temp_object_Variable_14, class USaveGame* Temp_object_Variable_15, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, bool Temp_bool_Variable_15, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character, bool K2Node_DynamicCast_bSuccess_7, class USaveGame* K2Node_CustomEvent_SaveGame_17, bool K2Node_CustomEvent_bSuccess_17, class UCharacter_Alpha_C* CallFunc_CreateSaveGameObject_ReturnValue, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, class UCharacter_Alpha_C* CallFunc_CreateSaveGameObject_ReturnValue_1, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class UCharacter_Alpha_C* CallFunc_CreateSaveGameObject_ReturnValue_2, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, class USaveGame* Temp_object_Variable_16, bool Temp_bool_Variable_16, class UCharacter_Beta_C* K2Node_DynamicCast_AsCharacter_Beta_1, bool K2Node_DynamicCast_bSuccess_8, class UCharacter_Alpha_C* CallFunc_CreateSaveGameObject_ReturnValue_3, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_7, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_1, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_1, bool K2Node_DynamicCast_bSuccess_9, double CallFunc_RandomFloatInRange_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue_1, double CallFunc_RandomFloatInRange_ReturnValue_2, double CallFunc_RandomFloatInRange_ReturnValue_3, double CallFunc_RandomFloatInRange_ReturnValue_4, class USaveGame* Temp_object_Variable_17, class UCharacter_Alpha_C* K2Node_DynamicCast_AsCharacter_Alpha, bool K2Node_DynamicCast_bSuccess_10, class UCharacter_Beta_C* CallFunc_CreateSaveGameObject_ReturnValue_4, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_8, bool CallFunc_IsValid_ReturnValue_9, bool Temp_bool_Variable_17, class UCharacter_Charlie_C* CallFunc_CreateSaveGameObject_ReturnValue_5, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_10, bool CallFunc_IsValid_ReturnValue_11, class USaveGame* K2Node_CustomEvent_SaveGame_18, bool K2Node_CustomEvent_bSuccess_18, class UCharacter_Delta_C* CallFunc_CreateSaveGameObject_ReturnValue_6, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_12, bool CallFunc_IsValid_ReturnValue_13, class UCharacter_Echo_C* CallFunc_CreateSaveGameObject_ReturnValue_7, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_14, bool CallFunc_IsValid_ReturnValue_15, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_2, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_2, bool K2Node_DynamicCast_bSuccess_11, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_17, class UCharacter_Beta_C* CallFunc_CreateSaveGameObject_ReturnValue_8, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_16, bool CallFunc_IsValid_ReturnValue_17, double CallFunc_RandomFloatInRange_ReturnValue_5, class UCharacter_Beta_C* CallFunc_CreateSaveGameObject_ReturnValue_9, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_18, bool CallFunc_IsValid_ReturnValue_19, class USaveGame* K2Node_CustomEvent_SaveGame_15, bool K2Node_CustomEvent_bSuccess_15, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_3, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_3, bool K2Node_DynamicCast_bSuccess_12, double CallFunc_RandomFloatInRange_ReturnValue_6, double CallFunc_RandomFloatInRange_ReturnValue_7, class UCharacter_Beta_C* CallFunc_CreateSaveGameObject_ReturnValue_10, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_20, bool CallFunc_IsValid_ReturnValue_21, double CallFunc_RandomFloatInRange_ReturnValue_8, double CallFunc_RandomFloatInRange_ReturnValue_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_18, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_4, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_4, bool K2Node_DynamicCast_bSuccess_13, class UCharacter_Charlie_C* CallFunc_CreateSaveGameObject_ReturnValue_11, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_7, bool CallFunc_IsValid_ReturnValue_22, bool CallFunc_IsValid_ReturnValue_23, double CallFunc_RandomFloatInRange_ReturnValue_10, class UCharacter_Charlie_C* CallFunc_CreateSaveGameObject_ReturnValue_12, bool Temp_bool_Has_Been_Initd_Variable, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_24, bool CallFunc_IsValid_ReturnValue_25, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_5, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_5, bool K2Node_DynamicCast_bSuccess_14, double CallFunc_RandomFloatInRange_ReturnValue_11, double CallFunc_RandomFloatInRange_ReturnValue_12, class UCharacter_Charlie_C* CallFunc_CreateSaveGameObject_ReturnValue_13, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_26, bool CallFunc_IsValid_ReturnValue_27, class USaveGame* Temp_object_Variable_18, class UCharacter_Alpha_C* K2Node_DynamicCast_AsCharacter_Alpha_1, bool K2Node_DynamicCast_bSuccess_15, double CallFunc_RandomFloatInRange_ReturnValue_13, double CallFunc_RandomFloatInRange_ReturnValue_14, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_6, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_6, bool K2Node_DynamicCast_bSuccess_16, bool Temp_bool_Variable_18, class UCharacter_Delta_C* CallFunc_CreateSaveGameObject_ReturnValue_14, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_8, bool CallFunc_IsValid_ReturnValue_28, bool CallFunc_IsValid_ReturnValue_29, double CallFunc_RandomFloatInRange_ReturnValue_15, class UCharacter_Delta_C* CallFunc_CreateSaveGameObject_ReturnValue_15, bool Temp_bool_IsClosed_Variable, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_30, bool CallFunc_IsValid_ReturnValue_31, class USaveGame* Temp_object_Variable_19, bool Temp_bool_Variable_19, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_7, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_7, bool K2Node_DynamicCast_bSuccess_17, double CallFunc_RandomFloatInRange_ReturnValue_16, double CallFunc_RandomFloatInRange_ReturnValue_17, class UCharacter_Delta_C* CallFunc_CreateSaveGameObject_ReturnValue_16, class USaveGame* K2Node_CustomEvent_SaveGame_19, bool K2Node_CustomEvent_bSuccess_19, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_7, bool CallFunc_IsValid_ReturnValue_32, bool CallFunc_IsValid_ReturnValue_33, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_19, double CallFunc_RandomFloatInRange_ReturnValue_18, double CallFunc_RandomFloatInRange_ReturnValue_19, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_8, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_8, bool K2Node_DynamicCast_bSuccess_18, class UCharacter_Echo_C* CallFunc_CreateSaveGameObject_ReturnValue_17, class UAsyncActionHandleSaveGame* CallFunc_AsyncLoadGameFromSlot_ReturnValue_9, bool CallFunc_IsValid_ReturnValue_34, bool CallFunc_IsValid_ReturnValue_35, double CallFunc_RandomFloatInRange_ReturnValue_20, class UCharacter_Echo_C* CallFunc_CreateSaveGameObject_ReturnValue_18, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_8, bool CallFunc_IsValid_ReturnValue_36, bool CallFunc_IsValid_ReturnValue_37, class USaveGame* K2Node_CustomEvent_SaveGame_16, bool K2Node_CustomEvent_bSuccess_16, class UCharacter* CallFunc_GetPlayerCharacter_ReturnValue_9, class UB_DemoCharacter_C* K2Node_DynamicCast_AsB_Demo_Character_9, bool K2Node_DynamicCast_bSuccess_19, double CallFunc_RandomFloatInRange_ReturnValue_21, double CallFunc_RandomFloatInRange_ReturnValue_22, class UCharacter_Echo_C* CallFunc_CreateSaveGameObject_ReturnValue_19, class UAsyncActionHandleSaveGame* CallFunc_AsyncSaveGameToSlot_ReturnValue_9, bool CallFunc_IsValid_ReturnValue_38, bool CallFunc_IsValid_ReturnValue_39, double CallFunc_RandomFloatInRange_ReturnValue_23, double CallFunc_RandomFloatInRange_ReturnValue_24, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast_2, float CallFunc_Delay_Duration_ImplicitCast_3, float CallFunc_Delay_Duration_ImplicitCast_4, float CallFunc_Delay_Duration_ImplicitCast_5, float CallFunc_Delay_Duration_ImplicitCast_6, float CallFunc_Delay_Duration_ImplicitCast_7, float CallFunc_Delay_Duration_ImplicitCast_8, float CallFunc_Delay_Duration_ImplicitCast_9, float CallFunc_Delay_Duration_ImplicitCast_10, float CallFunc_Delay_Duration_ImplicitCast_11, float CallFunc_Delay_Duration_ImplicitCast_12, float CallFunc_Delay_Duration_ImplicitCast_13, float CallFunc_Delay_Duration_ImplicitCast_14, float CallFunc_Delay_Duration_ImplicitCast_15, float CallFunc_Delay_Duration_ImplicitCast_16, float CallFunc_Delay_Duration_ImplicitCast_17, float CallFunc_Delay_Duration_ImplicitCast_18, float CallFunc_Delay_Duration_ImplicitCast_19, float CallFunc_Delay_Duration_ImplicitCast_20, float CallFunc_Delay_Duration_ImplicitCast_21, float CallFunc_Delay_Duration_ImplicitCast_22, float CallFunc_Delay_Duration_ImplicitCast_23, float CallFunc_Delay_Duration_ImplicitCast_24);
};

}


