#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x388 (0x618 - 0x290)
// BlueprintGeneratedClass Cubit_ImpactFX_Spawner.Cubit_ImpactFX_Spawner_C
class UCubit_ImpactFX_Spawner_C : public UActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            HitResult;                                         // 0x2A0(0xE8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, ExposeOnSpawn)
	class UMaterialInterface*                    SplasherDecalMat;                                  // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFXMaterialData                       MaterialValues;                                    // 0x390(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class EPhysicalSurface                  SurfaceTypeFeed;                                   // 0x428(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3FF4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    ImpactDecalMat;                                    // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               RicochetVector;                                    // 0x438(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Decals_Attached_;                                  // 0x450(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3FF6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              Main_FX_Emitter;                                   // 0x458(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Location;                                          // 0x460(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Impact_Normal;                                     // 0x478(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                   Hit_Component;                                     // 0x490(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	enum class EProjectile_Size                  FXSize;                                            // 0x498(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         ParticleDecalSpawnerON_;                           // 0x499(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3FF8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       RicochetSoundComponent;                            // 0x4A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UParticleSystemComponent*              RicochetParticleComponent;                         // 0x4A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                               Impact_Point;                                      // 0x4B0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Impact_Speed;                                      // 0x4C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       NormalisedRangeMin;                                // 0x4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NormalisedRangeMax;                                // 0x4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ImpactForceMultiplier;                             // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RicochetExitVelocity;                              // 0x4E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                  Hit_Bone;                                          // 0x4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Decal_Life;                                        // 0x4F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	enum class EFXTypes                          FX_Type;                                           // 0x500(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4001[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ParticleCollisionLocation;                         // 0x508(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EPhysicalSurface                  CollisionSurface;                                  // 0x520(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ParticleCollisionSoundsON;                         // 0x521(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4002[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ParticleCollisionVelocity;                         // 0x528(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ParticleCollisionNormal;                           // 0x540(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialProperties                   MaterialProperties;                                // 0x558(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMaterialProperties                   ParticleCollisionMaterialProperties;               // 0x564(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EImpactType                       Impact_Type;                                       // 0x570(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_400A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SurfaceName;                                       // 0x574(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FirePropagationON;                                 // 0x57C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_400E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ParticleCollisonHitBone;                           // 0x580(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseLineTraceParticleCollisions;                    // 0x588(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4011[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   ParticleCollisionLineCheckComponent;               // 0x590(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         CanvasTargetDecals;                                // 0x598(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BacksplatterDecalsON;                              // 0x599(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4013[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ProjectilesVector;                                 // 0x5A0(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UActor*                                HitActor;                                          // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       BacksplatterChance;                                // 0x608(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              BacksplatterDecalMat;                              // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UCubit_ImpactFX_Spawner_C* GetDefaultObj();

	void ReceiveBeginPlay();
	void Get_FX_Type();
	void ParticleCollisionSounds();
	void WetSplash();
	void DrySplash();
	void SizzleDry();
	void SizzleWet();
	void SpawnParticleDecals();
	void Sizzle_Liquid_FX();
	void SpawnParticleCollisionFX();
	void Debris_FX_Spawn();
	void Sizzle_Dry_FX();
	void FX_Type_Chosen();
	void DebrisFXInitialise();
	void Penetration_Event();
	void InitiateFXTasks();
	void FirePropagation();
	void BACKSPLATTER();
	void OnParticleCollide_Event(class FName EventName, float EmitterTime, int32 ParticleTime, const struct FVector& Location, const struct FVector& Velocity, const struct FVector& Direction, const struct FVector& Normal, class FName BoneName, class UPhysicalMaterial* PhysMat);
	void DestroyFXSpawner();
	void SpawnDecals();
	void SpawnSounds();
	void Ricochet_Event();
	void Impact_Event();
	void ExecuteUbergraph_Cubit_ImpactFX_Spawner(int32 EntryPoint, class FName CallFunc_GetEnumeratorName_ReturnValue, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_1, bool CallFunc_GetDataTableRowFromName_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class UActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsActive_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue, class FName CallFunc_GetEnumeratorName_ReturnValue_1, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_2, bool CallFunc_GetDataTableRowFromName_ReturnValue_2, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_3, bool CallFunc_GetDataTableRowFromName_ReturnValue_3, double CallFunc_RandomFloatInRange_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class FName CallFunc_GetEnumeratorName_ReturnValue_2, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_4, bool CallFunc_GetDataTableRowFromName_ReturnValue_4, double CallFunc_BreakVector_X_2, double CallFunc_BreakVector_Y_2, double CallFunc_BreakVector_Z_2, const struct FVector& CallFunc_MakeVector_ReturnValue_2, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_5, bool CallFunc_GetDataTableRowFromName_ReturnValue_5, double CallFunc_RandomFloatInRange_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, class FName CallFunc_GetEnumeratorName_ReturnValue_3, float CallFunc_GetGlobalTimeDilation_ReturnValue, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_6, bool CallFunc_GetDataTableRowFromName_ReturnValue_6, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue, float CallFunc_GetGlobalTimeDilation_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_1, float CallFunc_GetGlobalTimeDilation_ReturnValue_2, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_2, float CallFunc_GetGlobalTimeDilation_ReturnValue_3, float CallFunc_GetGlobalTimeDilation_ReturnValue_4, float CallFunc_GetGlobalTimeDilation_ReturnValue_5, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_3, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_4, const struct FVector& CallFunc_Multiply_VectorInt_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FVector& CallFunc_Multiply_VectorInt_ReturnValue_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_1, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue_3, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class FName CallFunc_GetEnumeratorName_ReturnValue_4, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_7, bool CallFunc_GetDataTableRowFromName_ReturnValue_7, const struct FVector& CallFunc_Multiply_VectorInt_ReturnValue_2, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FVector& Temp_struct_Variable, class FName CallFunc_GetEnumeratorName_ReturnValue_5, const struct FMaterialProperties& CallFunc_GetDataTableRowFromName_OutRow_8, bool CallFunc_GetDataTableRowFromName_ReturnValue_8, const struct FVector& Temp_struct_Variable_1, const struct FVector& Temp_struct_Variable_2, double CallFunc_RandomFloatInRange_ReturnValue_4, const struct FRotator& CallFunc_MakeRotator_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue, class FName CallFunc_GetEnumeratorName_ReturnValue_6, const struct FMaterialProperties& CallFunc_GetDataTableRowFromName_OutRow_9, bool CallFunc_GetDataTableRowFromName_ReturnValue_9, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, enum class EProjectile_Size Temp_byte_Variable, bool K2Node_SwitchEnum_CmpSuccess_2, bool CallFunc_IsValid_ReturnValue_2, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, const struct FVector& Temp_struct_Variable_3, const struct FVector& Temp_struct_Variable_4, double CallFunc_RandomFloatInRange_ReturnValue_5, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& Temp_struct_Variable_5, enum class EProjectile_Size Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess_3, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_2, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_3, TArray<class UActor*>& Temp_object_Variable, bool CallFunc_IsValid_ReturnValue_4, const struct FVector& Temp_struct_Variable_6, const struct FVector& Temp_struct_Variable_7, const struct FVector& Temp_struct_Variable_8, enum class EProjectile_Size Temp_byte_Variable_2, const struct FVector& K2Node_Select_Default, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_5, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, TArray<class UActor*>& K2Node_MakeArray_Array, const struct FVector& CallFunc_GetForwardVector_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue_6, const struct FVector& CallFunc_RandomUnitVectorInEllipticalConeInDegrees_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_3, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, double CallFunc_RandomFloatInRange_ReturnValue_7, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class UActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, class FName CallFunc_BreakHitResult_BoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, const struct FVector& CallFunc_Multiply_VectorInt_ReturnValue_3, class FName CallFunc_GetEnumeratorName_ReturnValue_7, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_3, const struct FFXMaterialData& CallFunc_GetDataTableRowFromName_OutRow_10, bool CallFunc_GetDataTableRowFromName_ReturnValue_10, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_3, double CallFunc_RandomFloatInRange_ReturnValue_8, const struct FVector& Temp_struct_Variable_9, const struct FVector& K2Node_Select_Default_1, double CallFunc_RandomFloatInRange_ReturnValue_9, double CallFunc_BreakVector_X_3, double CallFunc_BreakVector_Y_3, double CallFunc_BreakVector_Z_3, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_3, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_4, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, class UDecalComponent* CallFunc_SpawnDecalAttached_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_7, bool CallFunc_IsValid_ReturnValue_8, const struct FVector& Temp_struct_Variable_10, const struct FVector& Temp_struct_Variable_11, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_5, enum class EProjectile_Size Temp_byte_Variable_3, double CallFunc_RandomFloatInRange_ReturnValue_10, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_5, const struct FVector& K2Node_Select_Default_2, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue_2, double CallFunc_MakeLiteralDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, const struct FVector& K2Node_Select_Default_3, class FName K2Node_CustomEvent_EventName, float K2Node_CustomEvent_EmitterTime, int32 K2Node_CustomEvent_ParticleTime, const struct FVector& K2Node_CustomEvent_Location, const struct FVector& K2Node_CustomEvent_Velocity, const struct FVector& K2Node_CustomEvent_Direction, const struct FVector& K2Node_CustomEvent_Normal, class FName K2Node_CustomEvent_BoneName, class UPhysicalMaterial* K2Node_CustomEvent_PhysMat, double CallFunc_BreakVector_X_4, double CallFunc_BreakVector_Y_4, double CallFunc_BreakVector_Z_4, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, const struct FVector& CallFunc_MakeVector_ReturnValue_4, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FHitResult& CallFunc_LineTraceSingle_OutHit_1, bool CallFunc_LineTraceSingle_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit_2, bool CallFunc_BreakHitResult_bInitialOverlap_2, float CallFunc_BreakHitResult_Time_2, float CallFunc_BreakHitResult_Distance_2, const struct FVector& CallFunc_BreakHitResult_Location_2, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_2, const struct FVector& CallFunc_BreakHitResult_Normal_2, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_2, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2, class UActor* CallFunc_BreakHitResult_HitActor_2, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2, class FName CallFunc_BreakHitResult_HitBoneName_2, class FName CallFunc_BreakHitResult_BoneName_2, int32 CallFunc_BreakHitResult_HitItem_2, int32 CallFunc_BreakHitResult_ElementIndex_2, int32 CallFunc_BreakHitResult_FaceIndex_2, const struct FVector& CallFunc_BreakHitResult_TraceStart_2, const struct FVector& CallFunc_BreakHitResult_TraceEnd_2, float CallFunc_GetGlobalTimeDilation_ReturnValue_6, const struct FVector& Temp_struct_Variable_12, const struct FVector& Temp_struct_Variable_13, const struct FVector& Temp_struct_Variable_14, const struct FVector& Temp_struct_Variable_15, enum class EProjectile_Size Temp_byte_Variable_4, const struct FVector& K2Node_Select_Default_4, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorInt_ReturnValue_4, class UDecalComponent* CallFunc_SpawnDecalAttached_ReturnValue_1, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_9, float CallFunc_BreakRotator_Roll_2, float CallFunc_BreakRotator_Pitch_2, float CallFunc_BreakRotator_Yaw_2, class UDecalComponent* CallFunc_SpawnDecalAtLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, float CallFunc_GetGlobalTimeDilation_ReturnValue_7, const struct FRotator& CallFunc_MakeRotFromZ_ReturnValue_2, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue_6, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue_4, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, const struct FVector& Temp_struct_Variable_16, double CallFunc_RandomFloatInRange_ReturnValue_11, const struct FVector& Temp_struct_Variable_17, const struct FRotator& CallFunc_MakeRotator_ReturnValue_2, class UDecalComponent* CallFunc_SpawnDecalAttached_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_11, class UDecalComponent* CallFunc_SpawnDecalAtLocation_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_12, const struct FVector& Temp_struct_Variable_18, enum class EProjectile_Size Temp_byte_Variable_5, const struct FVector& K2Node_Select_Default_5, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_6, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_3, int32 CallFunc_RandomIntegerInRange_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue_5, float CallFunc_BreakRotator_Roll_3, float CallFunc_BreakRotator_Pitch_3, float CallFunc_BreakRotator_Yaw_3, const struct FVector& CallFunc_Normal_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_3, double CallFunc_BreakVector_X_5, double CallFunc_BreakVector_Y_5, double CallFunc_BreakVector_Z_5, const struct FVector& CallFunc_GreaterGreater_VectorRotator_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_3, double CallFunc_Add_DoubleDouble_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_7, double CallFunc_SignOfFloat_ReturnValue, double CallFunc_BreakVector_X_6, double CallFunc_BreakVector_Y_6, double CallFunc_BreakVector_Z_6, double CallFunc_Dot_VectorVector_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_2, double CallFunc_DegAcos_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, double CallFunc_SignOfFloat_ReturnValue_1, const struct FVector& Temp_struct_Variable_19, double CallFunc_Multiply_DoubleDouble_ReturnValue_6, const struct FRotator& CallFunc_MakeRotator_ReturnValue_4, const struct FVector& Temp_struct_Variable_20, class UDecalComponent* CallFunc_SpawnDecalAttached_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_13, enum class EProjectile_Size Temp_byte_Variable_6, const struct FVector& K2Node_Select_Default_6, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_8, float CallFunc_SpawnDecalAttached_LifeSpan_ImplicitCast, float CallFunc_SetFadeOut_StartDelay_ImplicitCast, float CallFunc_SpawnDecalAttached_LifeSpan_ImplicitCast_1, float CallFunc_SetFadeOut_StartDelay_ImplicitCast_1, float CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast, float CallFunc_SetFadeOut_StartDelay_ImplicitCast_2, float CallFunc_SpawnDecalAtLocation_LifeSpan_ImplicitCast_1, float CallFunc_SetFadeOut_StartDelay_ImplicitCast_3, float CallFunc_SpawnDecalAttached_LifeSpan_ImplicitCast_2, float CallFunc_SetFadeOut_StartDelay_ImplicitCast_4, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_MakeRotator_Roll_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1, float CallFunc_SpawnDecalAttached_LifeSpan_ImplicitCast_3, float CallFunc_MakeRotator_Roll_ImplicitCast_1, float CallFunc_SetFadeOut_StartDelay_ImplicitCast_5, float CallFunc_MakeRotator_Roll_ImplicitCast_2, float CallFunc_MakeRotator_Roll_ImplicitCast_3);
};

}


