#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x90 (0x320 - 0x290)
// BlueprintGeneratedClass DuranArabaSeqSubway.DuranArabaSeqSubway_C
class UDuranArabaSeqSubway_C : public UActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                   SpotLight1;                                        // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   SpotLight;                                         // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Plane;                                             // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  MotionWarpingPlayer5;                              // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  MotionWarpingPlayer4;                              // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  MotionWarpingPlayer3;                              // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  MotionWarpingPlayer2;                              // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                  MotionWarpingPlayer1;                              // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                SkeletalMesh1;                                     // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                SkeletalMesh;                                      // 0x2E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                  Sequence_Player;                                   // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         Basladi;                                           // 0x2F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_33D3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OyuncularIndiFrame;                                // 0x2FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player1Rot;                                        // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player2Rot;                                        // 0x304(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player3Rot;                                        // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player4Rot;                                        // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player5Rot;                                        // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_33D4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GecenZaman;                                        // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UDuranArabaSeqSubway_C* GetDefaultObj();

	void ReceiveTick(float DeltaSeconds);
	void ServerArabaSeq();
	void MultiArabaSeq();
	void ExecuteUbergraph_DuranArabaSeqSubway(int32 EntryPoint, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAtLocation_ReturnValue, float K2Node_Event_DeltaSeconds, TArray<class UB_DemoCharacter_Child_C*>& CallFunc_GetAllActorsOfClass_OutActors, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue, class UController* CallFunc_GetController_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UController* CallFunc_GetController_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_2, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_3, bool CallFunc_IsValid_ReturnValue_2, class UController* CallFunc_GetController_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class UController* CallFunc_GetController_ReturnValue_3, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_4, TArray<class UB_DemoCharacter_Child_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_5, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_6, bool CallFunc_IsValid_ReturnValue_4, class UPlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, bool CallFunc_K2_AttachToComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, class UPlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_2, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult_1, bool CallFunc_K2_AttachToComponent_ReturnValue_1, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_7, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_8, bool CallFunc_IsValid_ReturnValue_6, class UPlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_2, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_3, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult_2, bool CallFunc_K2_AttachToComponent_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_7, class UPlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_3, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_4, bool CallFunc_K2_AttachToComponent_ReturnValue_3, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult_3, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_4, class UB_DemoCharacter_Child_C* CallFunc_Array_Get_Item_9, bool CallFunc_IsValid_ReturnValue_8, class UPlayerController* CallFunc_GetLocalViewingPlayerController_ReturnValue_4, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_5, const struct FHitResult& CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_5, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult_4, bool CallFunc_K2_AttachToComponent_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_9, class UController* CallFunc_GetController_ReturnValue_4, bool CallFunc_K2_AttachToComponent_ReturnValue_5, bool CallFunc_K2_AttachToComponent_ReturnValue_6, class UAracGecisWidget_C* CallFunc_Create_ReturnValue, bool CallFunc_K2_AttachToComponent_ReturnValue_7, bool CallFunc_K2_AttachToComponent_ReturnValue_8, bool CallFunc_K2_AttachToComponent_ReturnValue_9, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue_2, const struct FRotator& CallFunc_MakeRotator_ReturnValue_3, const struct FRotator& CallFunc_MakeRotator_ReturnValue_4, const struct FMovieSceneSequencePlaybackSettings& K2Node_MakeStruct_MovieSceneSequencePlaybackSettings, class ULevelSequenceActor* CallFunc_CreateLevelSequencePlayer_OutActor, class ULevelSequencePlayer* CallFunc_CreateLevelSequencePlayer_ReturnValue, class ULevelSequencePlayer* CallFunc_GetSequencePlayer_ReturnValue, const struct FQualifiedFrameTime& CallFunc_GetCurrentTime_ReturnValue, const struct FFrameNumber& CallFunc_BreakQualifiedFrameTime_Frame, const struct FFrameRate& CallFunc_BreakQualifiedFrameTime_FrameRate, float CallFunc_BreakQualifiedFrameTime_SubFrame, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, class UMotionWarping_C* K2Node_DynamicCast_AsMotion_Warping, bool K2Node_DynamicCast_bSuccess, class UMotionWarping_C* K2Node_DynamicCast_AsMotion_Warping_1, bool K2Node_DynamicCast_bSuccess_1, class UMotionWarping_C* K2Node_DynamicCast_AsMotion_Warping_2, bool K2Node_DynamicCast_bSuccess_2, class UMotionWarping_C* K2Node_DynamicCast_AsMotion_Warping_3, bool K2Node_DynamicCast_bSuccess_3, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_6, class UMotionWarping_C* K2Node_DynamicCast_AsMotion_Warping_4, bool K2Node_DynamicCast_bSuccess_4, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class USK_DuranArac_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsSK_Duran_Arac_Skeleton_Anim_Blueprint, bool K2Node_DynamicCast_bSuccess_5);
};

}


