#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x78 (0x78 - 0x0)
// UserDefinedStruct F_Generated_Instance_Data.F_Generated_Instance_Data
struct FF_Generated_Instance_Data
{
public:
	struct FTransform                            InstanceTransform_2_337566744D6B2B3E61C7C3A104B8294E; // 0x0(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                           StaticMesh_11_B3E6FEBA4D2F212830724B91425B877A;    // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         InstanceToWorldSpace_15_975301DC4F65643B2035B8A44A535AF7; // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3ADE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActorIndex_18_B1DB3E794414874620E8759F8480DD7D;    // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsHISM_21_7D0F5CA34CEAA1087587C4B2EFFB4263;        // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CastShadows_23_75BC744144B58FC82C961296CEA17C29;   // 0x71(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ECollisionEnabled                 Collision_28_63AE670A42335F85D7314382AB59F492;     // 0x72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3ADF[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CullingDistance_31_DB599EFD4BA4E1F8E2FF42B07D052743; // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


