#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1A0 (0x1A0 - 0x0)
// UserDefinedStruct KarakterStatlari.KarakterStatlari
struct FKarakterStatlari
{
public:
	TArray<double>                               Cap_A_96_EC6695BC4A116D2FAEB646A8E0361771;         // 0x0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Cap_A_Alt1_98_BF5EC38B45FAB1C29A3EF2A9CBC58D34;    // 0x10(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Helmet_A_Alt1_68_EF05305F443C51A2C207988062684AEE; // 0x20(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Helmet_B_69_80EDF4B7415E44841DD3F6AD94018500;      // 0x30(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Vest_A_70_E4B126924F8EDC324DD44B9D7116ABA1;        // 0x40(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Koruyucu_Omuz_A_71_AD4A8E4B4AFE599FC372A8BC130581BF; // 0x50(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Koruyucu_Pelvis_A_72_6FB5B7E34B781C8E98183685E32FFA92; // 0x60(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Kevlar_73_E8782FF141785C69B16780A7A063C227;        // 0x70(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Steel_74_CDCFF1AD4215007998659F8E50A8C80A;         // 0x80(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Ceramic_75_1A3590814D830CBB0BFE55AA6CC04C69;       // 0x90(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AnaMag_A_76_2282450F4D7C288F4CD8E09B124C0132;      // 0xA0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AnaMag_A_Alt1_77_81131F3C4A99E5A2859A68B1605ECCAF; // 0xB0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AnaMag_A_Alt2_78_1AD34F3141881C4620A8EA8D30C9E91D; // 0xC0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AnaMag_B_79_6F51EEA24AC9D031DA6D9B91A8D71E36;      // 0xD0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AnaMag_B_Alt1_80_1EA7D91A4FA83B1D2D0A4A9649F69286; // 0xE0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               AltMag_A_81_D9EF3BFF4CDCC0E0EDB84FB18DAF0FCC;      // 0xF0(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Telsiz_A_82_149D9660453281053B89F9972CF6BEC0;      // 0x100(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Telsiz_C_83_40AB578041E4E51E3DE3DF911EB6753C;      // 0x110(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Telsiz_D_84_195CCDB74F757C763A93A899CE33C214;      // 0x120(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Torba_Yatay_A_86_AF8F9ACF4C1797170DE32F98BA2145C7; // 0x130(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Torba_Yatay_F_85_DA3849734BCCAC3714FA848C2FC23723; // 0x140(0x10)(Edit, BlueprintVisible)
	TArray<double>                               NightVision_A_93_69613D3843E6DC4B7D1EA0A7D72CEBF1; // 0x150(0x10)(Edit, BlueprintVisible)
	TArray<double>                               NightVision_GP_94_13E9288D4B3EA2ED670D389AD73AA9CE; // 0x160(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Flash_Grenade_01_102_C468783047DBCC2F00FA52B8B83658AF; // 0x170(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Hand_Grenade_01_104_A36768F9402F3DC7870E34A28DC39E17; // 0x180(0x10)(Edit, BlueprintVisible)
	TArray<double>                               Smoke_Grenade_01_106_FA01301041FC050D64DC7AB0EC868326; // 0x190(0x10)(Edit, BlueprintVisible)
};

}


