#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x48 (0x48 - 0x0)
// UserDefinedStruct KemerSagAttach2.KemerSagAttach2
struct FKemerSagAttach2
{
public:
	double                                       MoveSpeed_89_8021EB0E456C0574E3F9908ACF415A0B;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnaSilahAmmo_91_2B97574547A6785C60F170A13C86AA5E;  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AltSilahAmmo_93_3EDEFD7F41ADF90693BC09A28D0D1282;  // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlashAmmo_96_4D49ECAD40E477B8674144BE172E51EC;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HandAmmo_98_1239B6E04174AF22BE60CA824BD41672;      // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmokeAmmo_100_1EB4CFE04CDCBC710AA18DB705FBB9D5;    // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StimPackAmmo_110_49BA0B3D4BA6493F585B99B831E7F7C9; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_82_E436411D4B620D08BCE8C5A75A7DFFA8;     // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_1_83_622ECAD543657D4CFD218080A5485B36; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_2_84_BEADFB4C43D3ED4F5E07D69E467E51DD; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_85_3F56600349BBA435A91535982DDD5F72;     // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_Alt_1_86_F6C093464D9D7F581F63CB91B7A8F6A7; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_A_66_E179F5564F9C74B6C0ABB0918AE8B54A;     // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_B_68_6D0518D241EBA97E66B60CADD52D104A;     // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_A_70_8105DAD54BFDAF835C7F5291B51DD3E2;      // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_B_72_B56C96854307A05957994BBA35C1050A;      // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_74_64F404EF4EDB522E9385E09B515DFDB7;   // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_Alt1_76_D66A44214474C95634E28DBB1E667F7B; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_F_79_C758B9554D9B0AC34C7428BCE8C19CAD; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_A_81_18FDC56C4FCC8F2188C66C8DD179A032; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flash_Grenade_01_102_650614BD47B5D4A5DB9F65BC9E6CEFDB; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Grenade_01_104_FEF7040B4B36F44BC5E0839589E21FE6; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smoke_Grenade_01_106_E20551DD45F90700E8AD6BB1E68DD04B; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


