#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x48 (0x48 - 0x0)
// UserDefinedStruct KemerSolAttach1.KemerSolAttach1
struct FKemerSolAttach1
{
public:
	double                                       MoveSpeed_89_B60192374357324D944DDA8719077648;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnaSilahAmmo_91_CBFE805A4F2798B74681229EFA116756;  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AltSilahAmmo_93_2302423044FDC3F440BA00A932A81302;  // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlashAmmo_96_80EA16A944F0965FED3C78B6E1B8C27B;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HandAmmo_98_B09B6B24478A3AFA7AF84498F80822C2;      // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmokeAmmo_100_FB91567841FDE0A1BF24DBB6E2CA9972;    // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StimPackAmmo_109_E9C0884649F8C7CEBB67268FDBDE361B; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_82_E436411D4B620D08BCE8C5A75A7DFFA8;     // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_1_83_622ECAD543657D4CFD218080A5485B36; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_2_84_BEADFB4C43D3ED4F5E07D69E467E51DD; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_85_3F56600349BBA435A91535982DDD5F72;     // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_Alt_1_86_F6C093464D9D7F581F63CB91B7A8F6A7; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_A_66_E179F5564F9C74B6C0ABB0918AE8B54A;     // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_B_68_6D0518D241EBA97E66B60CADD52D104A;     // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_A_70_8105DAD54BFDAF835C7F5291B51DD3E2;      // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_B_72_B56C96854307A05957994BBA35C1050A;      // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_74_64F404EF4EDB522E9385E09B515DFDB7;   // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_Alt1_76_D66A44214474C95634E28DBB1E667F7B; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_F_79_C758B9554D9B0AC34C7428BCE8C19CAD; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_A_81_18FDC56C4FCC8F2188C66C8DD179A032; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flash_Grenade_01_102_4C5856654F10406555C722A20EF6B328; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Grenade_01_104_D83A9C854E43A70CC2B5A39B958C887C; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smoke_Grenade_01_106_B0C642704C3F08AEE3CC588B9B1A3B3F; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


