#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x40 - 0x0)
// UserDefinedStruct KemerAttachWidget.KemerAttachWidget
struct FKemerAttachWidget
{
public:
	double                                       MoveSpeed_75_A8D8313A449DFC81B1F3839795EDC7D5;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnaSilahAmmo_77_9CF9F70E4516EE7227EDE1AC076BB615;  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AltSilahAmmo_79_1B1B6FC348399F783AB51A812D9150B7;  // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlashAmmo_88_31EE1C704081B1945B1A64BE9273BBC2;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HandAmmo_90_11E5BB5148B30CE6B4CC268330A6AC65;      // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmokeAmmo_92_C460AA904A07108BA561DD8D1B209270;     // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_60_EFFF04E7472E9F2E70AA7381E6AA7387;      // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_Alt1_61_039821FC4F7F053C256251A0827F42CC; // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_Alt2_62_3973EE7640C45B5035C7FB80A23EBF0C; // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_B_63_45FF201B408021E32BA0578A74702FC4;      // 0x33(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_B_Alt1_64_0BF824054310391B0466EDA30E06A684; // 0x34(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_A_65_3732CEFA4EF7B7656FF70DA73E6B317E;     // 0x35(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_B_66_C1AA967940C244539F749EBA792B62BD;     // 0x36(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_A_67_5D1C37FD41775344E529C1A3CBEAE072;      // 0x37(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_B_68_57F8CAB9406E81AAB5751F85C11BD8D9;      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_69_DC35BF524C4C335A3B88FDA6D5DC3FDD;   // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_Alt1_70_219FA00F4E3719556BBDF38F119B7EF1; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TorbaYatay_F_71_3651C34A4629B8768B947FA493E3912B;  // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TorbaYatay_A_72_776C813D48CBB2210CD52090FECABC4F;  // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flash_Grenade_01_81_2BC365794645E782D078B49706186662; // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Grenade_01_83_C6E48D9B42D9D66788F30DAA6D931BB0; // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smoke_Grenade_01_85_C87B54A248755D5DECFED1B1CD54D6FA; // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


