#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1E0 (0x1E0 - 0x0)
// UserDefinedStruct KemerAttach.KemerAttach
struct FKemerAttach
{
public:
	struct FKemerSagAttach1                      KemerSag1_84_18FDC56C4FCC8F2188C66C8DD179A032;     // 0x0(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerSagAttach2                      KemerSag2_87_C1528C6C47414415A5B59EB96A58A111;     // 0x48(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerSagAttach3                      KemerSag3_90_04EAE1E6421E00F7FBD408896612925C;     // 0x90(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerSolAttach1                      KemerSol1_93_E926E415405606F18754AEB409DBCF69;     // 0xD8(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerSolAttach2                      KemerSol2_96_3979CD284C82E779DF3E60A19CEA2DB0;     // 0x120(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerSolAttach3                      KemerSol3_99_68123C1249B63A035711329FC1EB47D8;     // 0x168(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKemerArkaAtatch1                     KemerArka1_102_73112A754D96387E5EB354AE3E848FA9;   // 0x1B0(0x14)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3456[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKemerArkaAtatch2                     KemerArka2_105_8F86D82445D29F12245564B2D1C65C1B;   // 0x1C8(0x14)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3457[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

}


