#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_11
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__11_Params
{
public:
	class UAmbientSound*                         Cue_electric_blast;                                // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_10
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__10_Params
{
public:
	class UNiagaraActor*                         FX_Cube_Explode;                                   // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_9
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__9_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_8;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_8
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__8_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_7;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_7
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__7_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_16;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_6
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__6_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_15;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_5
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__5_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_14;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_4
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__4_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_13;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_3
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__3_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_12;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_2
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__2_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_11;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_1
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__1_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_10;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)_0
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__0_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_06;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.SequenceEvent__ENTRYPOINTLVL06_ending (Director BP)
struct ULVL06_ending__Director_BP__C_SequenceEvent__ENTRYPOINTLVL06_ending__Director_BP__Params
{
public:
	class UNiagaraActor*                         FX_Zombie_9;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_9_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_9_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_9;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_06_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_06_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_06;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_10_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_10_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_10;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_11_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_11_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_11;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_12_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_12_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_12;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_13_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_13_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_13;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_14_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_14_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_14;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_15_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_15_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_15;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_16_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_16_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_16;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_7_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_7_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_7;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Zombie_8_Event
struct ULVL06_ending__Director_BP__C_FX_Zombie_8_Event_Params
{
public:
	class UNiagaraActor*                         FX_Zombie_8;                                       // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x9 (0x9 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.FX_Cube_Explode_Event
struct ULVL06_ending__Director_BP__C_FX_Cube_Explode_Event_Params
{
public:
	class UNiagaraActor*                         FX_Cube_Explode;                                   // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         bReset;                                            // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC (0xC - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.Cue_electric_blast_Event
struct ULVL06_ending__Director_BP__C_Cue_electric_blast_Event_Params
{
public:
	class UAmbientSound*                         Cue_electric_blast;                                // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        StartTime;                                         // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xE0 (0xE0 - 0x0)
// Function LVL06_ending.LVL06_ending (Director BP)_C.ExecuteUbergraph_LVL06_ending (Director BP)
struct ULVL06_ending__Director_BP__C_ExecuteUbergraph_LVL06_ending__Director_BP__Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_38CE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAmbientSound*                         K2Node_CustomEvent_Cue_electric_blast;             // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_CustomEvent_StartTime;                      // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_38CF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_9;                    // 0x18(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue;          // 0x20(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_06;                   // 0x28(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x30(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_10;                   // 0x38(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x40(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_11;                   // 0x48(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x50(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_12;                   // 0x58(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_4;        // 0x60(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_13;                   // 0x68(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_5;        // 0x70(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_14;                   // 0x78(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_6;        // 0x80(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_15;                   // 0x88(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_7;        // 0x90(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_16;                   // 0x98(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_8;        // 0xA0(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_7;                    // 0xA8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_9;        // 0xB0(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Zombie_8;                    // 0xB8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_10;       // 0xC0(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraActor*                         K2Node_CustomEvent_FX_Cube_Explode;                // 0xC8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_bReset;                         // 0xD0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_38D3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       CallFunc_K2_GetRootComponent_ReturnValue_11;       // 0xD8(0x8)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}
}


