#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1B (0x1B - 0x0)
// UserDefinedStruct PatchAttach.PatchAttach
struct FPatchAttach
{
public:
	struct FGovdeSagPatch                        GovdeSagPatch_91_BEADFB4C43D3ED4F5E07D69E467E51DD; // 0x0(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGovdeSolPatch                        GovdeSolPatch_94_948238B8438C1718919BBCA20B5CB439; // 0x3(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhOnPatch                          ZirhOnPatch_97_526BA6554596A2200AEE5583EE807EC8;   // 0x6(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhOnUstPatch                       ZirhOnUstPatch_100_15022DA04987651D9039AB8E42F7A166; // 0x9(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhArkaPatch                        ZirhArkaPatch_104_6DB4BF1F47C404C8D1683FB3DFB78A0D; // 0xC(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKaskOnPatch                          KaskOnPatch_106_A4F115DA4D7616597B22C4B4820A96AE;  // 0xF(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKaskArkaPatch                        KaskArkaPatch_109_DD97F44A4AE0EEE149114982EAE06A00; // 0x12(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKaskSagPatch                         KaskSagPatch_112_033880B44F158B6B69292AA860D8F201; // 0x15(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKaskSolPatch                         KaskSolPatch_115_A5F5EB124C65E87F103B98912B3D6068; // 0x18(0x3)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


