#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x80 - 0x0)
// UserDefinedStruct S_AIData.S_AIData
struct FS_AIData
{
public:
	double                                       SoldierRecoilVerticalMin_22_236F30A5472FF7853DDB2A83F7A735C3; // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierRecoilVerticalMax_23_32864C85443F5CEBF98143ABECE9DCA7; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierRecoilHorizontalMin_24_ED886FA943B487BAE39ED2B5033AABC7; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierRecoilHorizontalMax_25_FAEA1A0E463D69D13F939080C0F60336; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierReactionTime_26_90047A254F0056C981309E884648995F; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierReactionTime2_42_4AEDE5F04EB4882E60F531B63903FE58; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierHealth_21_E4BFCBE441E1687E8B24BAA3A432B54F; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierDamage_44_83C3E0E14913C6A64E40419B7C4D7C44; // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierRateofFireMin_47_58C781FA4D5DB4014412C88AA8F75F85; // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierRateofFireMax_49_44D93F3643E52767C6E6CDA5E012A71A; // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SoldierSightShootDelay_29_CB98B22647090DDDAC51AABA72F8A688; // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SpiderHealth_28_143AAA544C216AD05C936C8F871596C5;  // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       DistortedHealth_31_5A83DE354081D1393EC7ABB308CDB975; // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlyerHealth_33_388A15004DDA3B704ECF72BCEB086840;   // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CrawlerHealth_38_55A2F6194DAB9A156351688C3B8A24CB; // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SDFMovementSpeed_36_0444449A4802B78F3F14DCACD946642E; // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


