#pragma once

// Dumped with Dumper-7!


namespace SDK
{
	namespace Soldiers_AnimBP
	{
		//---------------------------------------------------------------------------------------------------------------------
		// ENUMS
		//---------------------------------------------------------------------------------------------------------------------


		//---------------------------------------------------------------------------------------------------------------------
		// STRUCTS
		//---------------------------------------------------------------------------------------------------------------------

		// 0x79F (0x7A0 - 0x1)
		// ScriptStruct Soldiers_AnimBP.Soldiers_AnimBP_C.AnimBlueprintGeneratedConstantData
		struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
		{
		public:
			uint8                                        Pad_2465[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class FName                                  __NameProperty_5627;                               // 0x4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAlphaBlendOption                 __EnumProperty_5628;                               // 0xC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2466[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_5629;                              // 0x10(0x10)(BlueprintVisible, EditFixedSize)
			class FName                                  __NameProperty_5630;                               // 0x20(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5631;                               // 0x28(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5632;                               // 0x30(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5633;                               // 0x38(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5634;                               // 0x40(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5635;                               // 0x48(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5636;                               // 0x50(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5637;                               // 0x58(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5638;                           // 0x60(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5639;                           // 0x68(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5640;                               // 0x70(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5641;                           // 0x78(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5642;                               // 0x80(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5643;                               // 0x88(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5644;                                // 0x90(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5645;                               // 0x94(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_246A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5646;                           // 0xA0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5647;                           // 0xA8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5648;                               // 0xB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5649;                           // 0xB8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5650;                               // 0xC0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5651;                               // 0xC8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5652;                                // 0xD0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5653;                               // 0xD4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_246B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5654;                           // 0xE0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5655;                           // 0xE8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5656;                               // 0xF0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5657;                              // 0xF8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_246C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5658;                           // 0x100(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5659;                               // 0x108(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5660;                               // 0x110(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5661;                                // 0x118(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5662;                              // 0x11C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			TArray<float>                                __ArrayProperty_5663;                              // 0x120(0x10)(BlueprintVisible, EditFixedSize)
			float                                        __FloatProperty_5664;                              // 0x130(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5665;                               // 0x134(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5666;                              // 0x13C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5667;                           // 0x140(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5668;                           // 0x148(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5669;                               // 0x150(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5670;                              // 0x158(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5671;                              // 0x15C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAnimGroupRole                    __ByteProperty_5672;                               // 0x160(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_246F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_5673;                              // 0x164(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5674;                           // 0x168(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5675;                               // 0x170(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5676;                               // 0x178(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5677;                                // 0x180(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2471[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5678;                           // 0x188(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5679;                               // 0x190(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5680;                                // 0x198(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2473[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5681;                           // 0x1A0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5682;                               // 0x1A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5683;                                // 0x1B0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2474[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5684;                           // 0x1B8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5685;                               // 0x1C0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5686;                           // 0x1C8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5687;                               // 0x1D0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5688;                           // 0x1D8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5689;                               // 0x1E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5690;                           // 0x1E8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5691;                               // 0x1F0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5692;                           // 0x1F8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5693;                           // 0x200(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			float                                        __FloatProperty_5694;                              // 0x208(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2479[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5695;                           // 0x210(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5696;                               // 0x218(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAlphaBlendOption                 __EnumProperty_5697;                               // 0x220(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_247C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_5698;                              // 0x228(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_5699;                              // 0x238(0x10)(BlueprintVisible)
			float                                        __FloatProperty_5700;                              // 0x248(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EBlendListTransitionType          __EnumProperty_5701;                               // 0x24C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_247D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_5702;                              // 0x250(0x10)(BlueprintVisible, EditFixedSize)
			class UAnimSequenceBase* __AnimSequenceBase_5703;                           // 0x260(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5704;                           // 0x268(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			float                                        __FloatProperty_5705;                              // 0x270(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5706;                              // 0x274(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5707;                              // 0x278(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_247E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5708;                           // 0x280(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5709;                               // 0x288(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5710;                               // 0x290(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5711;                               // 0x298(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5712;                              // 0x2A0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5713;                              // 0x2A4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5714;                              // 0x2A8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2480[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5715;                           // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5716;                               // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5717;                               // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5718;                               // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5719;                               // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5720;                               // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5721;                               // 0x2E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5722;                              // 0x2E8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5723;                               // 0x2EC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5724;                               // 0x2F4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5725;                               // 0x2FC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5726;                               // 0x304(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5727;                               // 0x30C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5728;                              // 0x314(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5729;                               // 0x318(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5730;                               // 0x320(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5731;                           // 0x328(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5732;                           // 0x330(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5733;                               // 0x338(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5734;                               // 0x340(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5735;                              // 0x348(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2487[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5736;                           // 0x350(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5737;                               // 0x358(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5738;                                // 0x360(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5739;                               // 0x364(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5740;                              // 0x36C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5741;                               // 0x370(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5742;                               // 0x378(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5743;                               // 0x380(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5744;                               // 0x388(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5745;                              // 0x390(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5746;                               // 0x394(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5747;                              // 0x39C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5748;                               // 0x3A0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5749;                               // 0x3A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5750;                               // 0x3B0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5751;                              // 0x3B8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5752;                               // 0x3BC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5753;                               // 0x3C4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5754;                               // 0x3CC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5755;                               // 0x3D4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5756;                              // 0x3DC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5757;                              // 0x3E0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5758;                               // 0x3E4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5759;                               // 0x3EC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			struct FInputScaleBiasClampConstants         __StructProperty_5760;                             // 0x3F4(0x2C)(BlueprintVisible, NoDestructor)
			enum class EAnimSyncMethod                   __EnumProperty_5761;                               // 0x420(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2493[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class FName                                  __NameProperty_5762;                               // 0x424(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5763;                               // 0x42C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2495[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5764;                           // 0x438(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5765;                               // 0x440(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5766;                               // 0x448(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5767;                               // 0x450(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5768;                               // 0x458(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5769;                               // 0x460(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5770;                               // 0x468(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5771;                               // 0x470(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5772;                              // 0x478(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5773;                              // 0x47C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5774;                              // 0x480(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5775;                               // 0x484(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5776;                                // 0x48C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			TArray<float>                                __ArrayProperty_5777;                              // 0x490(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_5778;                              // 0x4A0(0x10)(BlueprintVisible)
			TArray<float>                                __ArrayProperty_5779;                              // 0x4B0(0x10)(BlueprintVisible, EditFixedSize)
			TArray<int32>                                __ArrayProperty_5780;                              // 0x4C0(0x10)(BlueprintVisible)
			class UAnimSequenceBase* __AnimSequenceBase_5781;                           // 0x4D0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			float                                        __FloatProperty_5782;                              // 0x4D8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2498[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5783;                           // 0x4E0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5784;                           // 0x4E8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			float                                        __FloatProperty_5785;                              // 0x4F0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_2499[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5786;                           // 0x4F8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5787;                           // 0x500(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			float                                        __FloatProperty_5788;                              // 0x508(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_249C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5789;                           // 0x510(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5790;                               // 0x518(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5791;                                // 0x520(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5792;                               // 0x524(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5793;                               // 0x52C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5794;                               // 0x534(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5795;                               // 0x53C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5796;                               // 0x544(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5797;                               // 0x54C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5798;                               // 0x554(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24A0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5799;                           // 0x560(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UAnimSequenceBase* __AnimSequenceBase_5800;                           // 0x568(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5801;                               // 0x570(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5802;                               // 0x578(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5803;                               // 0x580(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5804;                                // 0x588(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5805;                               // 0x58C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5806;                               // 0x594(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5807;                               // 0x59C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5808;                               // 0x5A4(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5809;                               // 0x5AC(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class ESequenceEvalReinit               __ByteProperty_5810;                               // 0x5B4(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24A5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_5811;                              // 0x5B8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24A6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UAnimSequenceBase* __AnimSequenceBase_5812;                           // 0x5C0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class FName                                  __NameProperty_5813;                               // 0x5C8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5814;                               // 0x5D0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5815;                               // 0x5D8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5816;                               // 0x5E0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5817;                               // 0x5E8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5818;                               // 0x5F0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5819;                               // 0x5F8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			TArray<float>                                __ArrayProperty_5820;                              // 0x600(0x10)(BlueprintVisible, EditFixedSize)
			TArray<float>                                __ArrayProperty_5821;                              // 0x610(0x10)(BlueprintVisible, EditFixedSize)
			class FName                                  __NameProperty_5822;                               // 0x620(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5823;                               // 0x628(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5824;                                // 0x630(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5825;                               // 0x634(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5826;                                // 0x63C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5827;                              // 0x640(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5828;                               // 0x644(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAlphaBlendOption                 __EnumProperty_5829;                               // 0x64C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24AB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_5830;                              // 0x650(0x10)(BlueprintVisible, EditFixedSize)
			bool                                         __BoolProperty_5831;                               // 0x660(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24AC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_5832;                              // 0x664(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			struct FInputScaleBiasClampConstants         __StructProperty_5833;                             // 0x668(0x2C)(BlueprintVisible, NoDestructor)
			float                                        __FloatProperty_5834;                              // 0x694(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAnimSyncMethod                   __EnumProperty_5835;                               // 0x698(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAnimGroupRole                    __ByteProperty_5836;                               // 0x699(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24AE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class FName                                  __NameProperty_5837;                               // 0x69C(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5838;                                // 0x6A4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5839;                               // 0x6A8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			class FName                                  __NameProperty_5840;                               // 0x6B0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_5841;                                // 0x6B8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24AF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			class UBlendProfile* __BlendProfile_5842;                               // 0x6C0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			class UCurveFloat* __CurveFloat_5843;                                 // 0x6C8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
			bool                                         __BoolProperty_5844;                               // 0x6D0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EAlphaBlendOption                 __EnumProperty_5845;                               // 0x6D1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			enum class EBlendListTransitionType          __EnumProperty_5846;                               // 0x6D2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24B0[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			TArray<float>                                __ArrayProperty_5847;                              // 0x6D8(0x10)(BlueprintVisible, EditFixedSize)
			struct FAnimNodeFunctionRef                  __StructProperty_5848;                             // 0x6E8(0x20)(BlueprintVisible, NoDestructor)
			struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x708(0x80)(None)
			struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x788(0x18)(None)
		};

		// 0x135 (0x136 - 0x1)
		// ScriptStruct Soldiers_AnimBP.Soldiers_AnimBP_C.AnimBlueprintGeneratedMutableData
		struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
		{
		public:
			uint8                                        __ByteProperty;                                    // 0x1(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24B3[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			int32                                        __IntProperty_0;                                   // 0x4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_1;                                 // 0x8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_2;                                 // 0xC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_3;                                   // 0x10(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_4;                                 // 0x14(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_5;                                 // 0x18(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_6;                                   // 0x1C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_7;                                 // 0x20(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_8;                                 // 0x24(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_9;                                   // 0x28(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_10;                                // 0x2C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_11;                                // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			int32                                        __IntProperty_12;                                  // 0x34(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_13;                                 // 0x38(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			int32                                        __IntProperty_14;                                  // 0x3C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_15;                                // 0x40(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_16;                                // 0x44(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_17;                                 // 0x48(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24BD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			int32                                        __IntProperty_18;                                  // 0x4C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_19;                                // 0x50(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_20;                                // 0x54(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_21;                                // 0x58(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_22;                                // 0x5C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_23;                                // 0x60(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_24;                                // 0x64(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_25;                                // 0x68(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_26;                                // 0x6C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_27;                                // 0x70(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_28;                                // 0x74(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_29;                                // 0x78(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_30;                                // 0x7C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_31;                                // 0x80(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_32;                                // 0x84(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_33;                                // 0x88(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_34;                                // 0x8C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_35;                                // 0x90(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_36;                                // 0x94(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_37;                                // 0x98(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_38;                                // 0x9C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_39;                                // 0xA0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_40;                                // 0xA4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_41;                                // 0xA8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_42;                                // 0xAC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_43;                                // 0xB0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_44;                                // 0xB4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_45;                                // 0xB8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_46;                                // 0xBC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_47;                                // 0xC0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_48;                                // 0xC4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_49;                                // 0xC8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_50;                                // 0xCC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_51;                                // 0xD0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_52;                                // 0xD4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_53;                                // 0xD8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_54;                                // 0xDC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_55;                                // 0xE0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_56;                                // 0xE4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_57;                                // 0xE8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_58;                                // 0xEC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_59;                                // 0xF0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_60;                                 // 0xF4(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_61;                                // 0xF8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_62;                                 // 0xFC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24C9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_63;                                // 0x100(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_64;                                 // 0x104(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_65;                                // 0x108(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_66;                                 // 0x10C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        Pad_24CC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
			float                                        __FloatProperty_67;                                // 0x110(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_68;                                 // 0x114(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_69;                                 // 0x115(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_70;                                 // 0x116(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			uint8                                        __ByteProperty_71;                                 // 0x117(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_72;                                // 0x118(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_73;                                // 0x11C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_74;                                // 0x120(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_75;                                // 0x124(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_76;                                // 0x128(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			float                                        __FloatProperty_77;                                // 0x12C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_78;                                 // 0x130(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_79;                                 // 0x131(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_80;                                 // 0x132(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_81;                                 // 0x133(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_82;                                 // 0x134(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
			bool                                         __BoolProperty_83;                                 // 0x135(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		};

	}
}

