#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.OnUpdateHeldObject
struct UYeniAiAnimCharacter_C_OnUpdateHeldObject_Params
{
public:
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x28 (0x28 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.OnUpdateHeldObjectAnimations
struct UYeniAiAnimCharacter_C_OnUpdateHeldObjectAnimations_Params
{
public:
	float                                        CallFunc_GetAnimCurveValue_ReturnValue;            // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EF4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBow_AnimBP_C*                         K2Node_DynamicCast_AsBow_Anim_BP;                  // 0x10(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EF5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       K2Node_VariableSet_Draw_ImplicitCast;              // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_25
struct UYeniAiAnimCharacter_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_25_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_24
struct UYeniAiAnimCharacter_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_24_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_SpaceBar_K2Node_InputKeyEvent_23
struct UYeniAiAnimCharacter_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_23_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_22
struct UYeniAiAnimCharacter_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_22_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_21
struct UYeniAiAnimCharacter_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_21_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent_20
struct UYeniAiAnimCharacter_C_InpActEvt_RightMouseButton_K2Node_InputKeyEvent_20_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_Q_K2Node_InputKeyEvent_19
struct UYeniAiAnimCharacter_C_InpActEvt_Q_K2Node_InputKeyEvent_19_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_E_K2Node_InputKeyEvent_18
struct UYeniAiAnimCharacter_C_InpActEvt_E_K2Node_InputKeyEvent_18_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_One_K2Node_InputKeyEvent_17
struct UYeniAiAnimCharacter_C_InpActEvt_One_K2Node_InputKeyEvent_17_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_Two_K2Node_InputKeyEvent_16
struct UYeniAiAnimCharacter_C_InpActEvt_Two_K2Node_InputKeyEvent_16_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_15
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_15_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent_14
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_14_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadThree_K2Node_InputKeyEvent_13
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_13_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_12
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_12_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadSix_K2Node_InputKeyEvent_11
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_11_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_NumPadFive_K2Node_InputKeyEvent_10
struct UYeniAiAnimCharacter_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_10_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt___K2Node_InputKeyEvent_9
struct UYeniAiAnimCharacter_C_InpActEvt___K2Node_InputKeyEvent_9_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_8
struct UYeniAiAnimCharacter_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_8_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_R_K2Node_InputKeyEvent_7
struct UYeniAiAnimCharacter_C_InpActEvt_R_K2Node_InputKeyEvent_7_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_H_K2Node_InputKeyEvent_6
struct UYeniAiAnimCharacter_C_InpActEvt_H_K2Node_InputKeyEvent_6_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_H_K2Node_InputKeyEvent_5
struct UYeniAiAnimCharacter_C_InpActEvt_H_K2Node_InputKeyEvent_5_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_T_K2Node_InputKeyEvent_4
struct UYeniAiAnimCharacter_C_InpActEvt_T_K2Node_InputKeyEvent_4_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_LeftControl_K2Node_InputKeyEvent_3
struct UYeniAiAnimCharacter_C_InpActEvt_LeftControl_K2Node_InputKeyEvent_3_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_LeftControl_K2Node_InputKeyEvent_2
struct UYeniAiAnimCharacter_C_InpActEvt_LeftControl_K2Node_InputKeyEvent_2_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_L_K2Node_InputKeyEvent_1
struct UYeniAiAnimCharacter_C_InpActEvt_L_K2Node_InputKeyEvent_1_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x18 (0x18 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpActEvt_L_K2Node_InputKeyEvent_0
struct UYeniAiAnimCharacter_C_InpActEvt_L_K2Node_InputKeyEvent_0_Params
{
public:
	struct FKey                                  Key;                                               // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpAxisEvt_Turn_K2Node_InputAxisEvent_1
struct UYeniAiAnimCharacter_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_1_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent_2
struct UYeniAiAnimCharacter_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_2_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpAxisEvt_MoveForward_K2Node_InputAxisEvent_3
struct UYeniAiAnimCharacter_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_3_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.InpAxisEvt_MoveRight_K2Node_InputAxisEvent_5
struct UYeniAiAnimCharacter_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_5_Params
{
public:
	float                                        AxisValue;                                         // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.ReceiveTick
struct UYeniAiAnimCharacter_C_ReceiveTick_Params
{
public:
	float                                        DeltaSeconds;                                      // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x410 (0x410 - 0x0)
// Function YeniAiAnimCharacter.YeniAiAnimCharacter_C.ExecuteUbergraph_YeniAiAnimCharacter
struct UYeniAiAnimCharacter_C_ExecuteUbergraph_YeniAiAnimCharacter_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F39[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  Temp_struct_Variable;                              // 0x8(0x18)(HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F3B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_1;                        // 0x28(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key;                          // 0x40(0x18)(HasGetValueTypeHash)
	struct FKey                                  Temp_struct_Variable_1;                            // 0x58(0x18)(HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_1;                              // 0x70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x71(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F3D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_InputAxisEvent_AxisValue_3;                 // 0x74(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_InputAxisEvent_AxisValue_2;                 // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F3E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_GetActorForwardVector_ReturnValue;        // 0x80(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_InputAxisEvent_AxisValue_1;                 // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F40[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_GetActorRightVector_ReturnValue;          // 0xA0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_InputAxisEvent_AxisValue;                   // 0xB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F41[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_2;                        // 0xC0(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_3;                        // 0xD8(0x18)(HasGetValueTypeHash)
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0xF0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UYeniAiCharacter_AnimBlueprint_C*      K2Node_DynamicCast_AsYeni_Ai_Character_Anim_Blueprint; // 0xF8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x100(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F43[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaSeconds;                         // 0x104(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_GetControlRotation_ReturnValue;           // 0x108(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                  K2Node_InputKeyEvent_Key_4;                        // 0x120(0x18)(HasGetValueTypeHash)
	struct FKey                                  Temp_struct_Variable_2;                            // 0x138(0x18)(HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_2;                              // 0x150(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F44[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_5;                        // 0x158(0x18)(HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_2;                // 0x170(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F45[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_6;                        // 0x178(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_7;                        // 0x190(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_8;                        // 0x1A8(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_9;                        // 0x1C0(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_10;                       // 0x1D8(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_11;                       // 0x1F0(0x18)(HasGetValueTypeHash)
	struct FPhysicalAnimationData                K2Node_MakeStruct_PhysicalAnimationData;           // 0x208(0x24)(NoDestructor)
	uint8                                        Pad_3F46[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_12;                       // 0x230(0x18)(HasGetValueTypeHash)
	TArray<bool>                                 K2Node_MakeArray_Array;                            // 0x248(0x10)(ReferenceParm)
	TArray<bool>                                 K2Node_MakeArray_Array_1;                          // 0x258(0x10)(ReferenceParm)
	TArray<bool>                                 K2Node_MakeArray_Array_2;                          // 0x268(0x10)(ReferenceParm)
	TArray<bool>                                 K2Node_MakeArray_Array_3;                          // 0x278(0x10)(ReferenceParm)
	struct FKey                                  K2Node_InputKeyEvent_Key_13;                       // 0x288(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_14;                       // 0x2A0(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_15;                       // 0x2B8(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_16;                       // 0x2D0(0x18)(HasGetValueTypeHash)
	bool                                         K2Node_MultiGate_FirstRun;                         // 0x2E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F48[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        K2Node_MultiGate_Data;                             // 0x2EC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_MultiGate_ScratchBool;                      // 0x2F0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F4C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        K2Node_MultiGate_ScratchIndex;                     // 0x2F4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_17;                       // 0x2F8(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_18;                       // 0x310(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_19;                       // 0x328(0x18)(HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_3;                              // 0x340(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_3;                // 0x341(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F4E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_20;                       // 0x348(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_21;                       // 0x360(0x18)(HasGetValueTypeHash)
	struct FKey                                  K2Node_InputKeyEvent_Key_22;                       // 0x378(0x18)(HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_4;                              // 0x390(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F4F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_23;                       // 0x398(0x18)(HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_4;                // 0x3B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_5;                              // 0x3B1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F51[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  Temp_struct_Variable_3;                            // 0x3B8(0x18)(HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_5;                // 0x3D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_6;                              // 0x3D1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F54[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_24;                       // 0x3D8(0x18)(HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_6;                // 0x3F0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3F57[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  K2Node_InputKeyEvent_Key_25;                       // 0x3F8(0x18)(HasGetValueTypeHash)
};

}
}


