#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x4A (0x4A - 0x0)
// UserDefinedStruct ZirhAttachWidget.ZirhAttachWidget
struct FZirhAttachWidget
{
public:
	double                                       MoveSpeed_79_95BBBA374CB4CB910ED513B8FBCA8020;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnaSilahAmmo_81_C321B115488460D45345F988F550FFF7;  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AltSilahAmmo_83_764A3B864A4FD7F127B8DB8853C07432;  // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlashAmmo_92_6D715B8B47A33CAD57DD029828E77B3A;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HandAmmo_94_238970A5492A19679956298613BB51D7;      // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmokeAmmo_96_DC833B40423950306999BFB3C3CCF002;     // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StimPackAmmo_99_84606C7544C9077013822A98F0B2CA27;  // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_60_EFFF04E7472E9F2E70AA7381E6AA7387;      // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_Alt1_61_039821FC4F7F053C256251A0827F42CC; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_A_Alt2_62_3973EE7640C45B5035C7FB80A23EBF0C; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_B_63_45FF201B408021E32BA0578A74702FC4;      // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AnaMag_B_Alt1_64_0BF824054310391B0466EDA30E06A684; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_A_65_3732CEFA4EF7B7656FF70DA73E6B317E;     // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_B_66_C1AA967940C244539F749EBA792B62BD;     // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_A_67_5D1C37FD41775344E529C1A3CBEAE072;      // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_B_68_57F8CAB9406E81AAB5751F85C11BD8D9;      // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_C_74_5550A6684369812E2983B581F2049F11;      // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_D_76_D182627B491A797B81D012AF09414229;      // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_69_DC35BF524C4C335A3B88FDA6D5DC3FDD;   // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_Alt1_70_219FA00F4E3719556BBDF38F119B7EF1; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TorbaYatay_F_71_3651C34A4629B8768B947FA493E3912B;  // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TorbaYatay_A_72_776C813D48CBB2210CD52090FECABC4F;  // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flash_Grenade_01_85_A432D74147A621EDF0B7C8889A6E6C76; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Grenade_01_87_2F5230894AB0821CFE76808C9D4F83B8; // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smoke_Grenade_01_89_F0B6905949DDA0F4D695BBBC3F88A601; // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


