#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x48 (0x48 - 0x0)
// UserDefinedStruct ZirhAttachArkaAttach4.ZirhAttachArkaAttach4
struct FZirhAttachArkaAttach4
{
public:
	double                                       MoveSpeed_89_DB2E1BC54F58FBB4EA94B58219E682DC;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnaSilahAmmo_92_EA3FE74849922FD662F89987C8556273;  // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AltSilahAmmo_95_F93BE02C436A54DC577F15BE644C5F38;  // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FlashAmmo_98_E8E2230E467060A9861B51904BECE7F8;     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       HandAmmo_100_639261CB49E5491C4FE48799B28A4281;     // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmokeAmmo_102_FF9A14C34BC388885287919C94C8D990;    // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StimPackAmmo_111_727F653447F93BCA7E655EBC7FD8D6A0; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_82_E436411D4B620D08BCE8C5A75A7DFFA8;     // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_1_83_622ECAD543657D4CFD218080A5485B36; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_A_Alt_2_84_BEADFB4C43D3ED4F5E07D69E467E51DD; // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_85_3F56600349BBA435A91535982DDD5F72;     // 0x3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ana_Mag_B_Alt_1_86_F6C093464D9D7F581F63CB91B7A8F6A7; // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_A_66_E179F5564F9C74B6C0ABB0918AE8B54A;     // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Alt_Mag_B_68_6D0518D241EBA97E66B60CADD52D104A;     // 0x3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_A_70_8105DAD54BFDAF835C7F5291B51DD3E2;      // 0x3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Telsiz_B_72_B56C96854307A05957994BBA35C1050A;      // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_74_64F404EF4EDB522E9385E09B515DFDB7;   // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Chemlight_A_Alt1_76_D66A44214474C95634E28DBB1E667F7B; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_F_79_C758B9554D9B0AC34C7428BCE8C19CAD; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Torba_Yatay_A_81_18FDC56C4FCC8F2188C66C8DD179A032; // 0x44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flash_Grenade_01_104_2595020F4D2463AC5BB3C9AF216BA14B; // 0x45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hand_Grenade_01_106_45002B9845BA795DCFC421B26CF1EF0D; // 0x46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Smoke_Grenade_01_108_EB6382664C60B195AC8740A7B61DCFD8; // 0x47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


