#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x3F0 (0x3F0 - 0x0)
// UserDefinedStruct ZirhAttach.ZirhAttach
struct FZirhAttach
{
public:
	struct FZirhAttachOnAttach1                  OnAttach1_89_18FDC56C4FCC8F2188C66C8DD179A032;     // 0x0(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachOnAttach2                  OnAttach2_92_7AEA1350407AA498540A24841F96A399;     // 0x48(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachOnAttach3                  OnAttach3_95_49D1092046BB4665E360D681EB0F618C;     // 0x90(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachOnAttach4                  OnAttach4_98_D6152A1F4DB6220B0F28CFA83668CCC5;     // 0xD8(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachOnAttachUst1               OnAttachUst1_113_122FA1854B89FF940F9920AA2869BD89; // 0x120(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachOnAttachUst2               OnAttachUst2_116_8F7A40B64E4EB80CCE7CC1B85EBA72D7; // 0x168(0x46)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3883[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachOnAttachUst3               OnAttachUst3_119_B7B0FE0440976CFABD2CF3B648A93831; // 0x1B0(0x46)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3884[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachArkaAttach1                ArkaAttach1_101_4ED424484DD084CCDFC71CB4DA074F24;  // 0x1F8(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachArkaAttach2                ArkaAttach2_104_CDCE756C4EB6A35BA439B6BD9BD2D739;  // 0x240(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachArkaAttach3                ArkaAttach3_107_A7CC769F44F96B6E26BC40A3045CAD88;  // 0x288(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachArkaAttach4                ArkaAttach4_110_8C68101A4C907FE58BEDAC8B798F10F1;  // 0x2D0(0x48)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZirhAttachArkaUstAttach1             ArkaAttachUst1_122_1798133F4C9101EB707966A7640BFC90; // 0x318(0x14)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3885[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachArkaUstAttach2             ArkaAttachUst2_125_9BC3645E41480EE61E2CE282D963F355; // 0x330(0x14)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3886[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachArkaUstAttach3             ArkaAttachUst3_128_0007B1E942E3617A8125C4A0DC86E7A6; // 0x348(0x14)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3887[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachOnAttachSagOmuz            SagOmuz_131_6D927C1649350B8DC50C30B1F6DE8300;      // 0x360(0x17)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3888[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachOnAttachSolOmuz            SolOmuz_134_65795DA943C8333B1F418982EBB69235;      // 0x378(0x17)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3889[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachKoruyucuOmuz               KoruyucuOmuz_137_3DFE031848CA194AC11D6BA3DAB26EC5; // 0x390(0x1A)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_388A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachKoruyucuPelvis             KoruyucuPelvis_140_CED19DB54C246EDEE88082AA54503732; // 0x3B0(0x1A)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_388B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZirhAttachMaterial                   Material_143_4985E2FC438CD9CF354A6A9AE3FF5105;     // 0x3D0(0x1B)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_388C[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

}


